function 取神兽资质(造型,物法)
	if 物法 ~= nil then
		造型 = 造型.."_"..物法
	end
	local bbs = {}
	if 造型 == "超级神龙" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}

	elseif 造型 == "超级神龙_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}

	elseif 造型 == "超级腾蛇" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级腾蛇_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级青鸾" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级青鸾_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级人参娃娃" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级人参娃娃_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级海豚" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级海豚_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神牛" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神牛_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神虎" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神虎_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神兔" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神兔_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级泡泡" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级泡泡_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级大熊猫" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级大熊猫_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级金猴" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级金猴_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级大象" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级大象_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级灵鹿" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级灵鹿_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级白泽" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级白泽_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级赤焰兽" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级赤焰兽_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级麒麟" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级麒麟_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级大鹏" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级大鹏_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级灵狐" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级灵狐_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级孔雀" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级孔雀_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神马" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神马_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级六耳猕猴" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级六耳猕猴_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神羊" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神羊_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级土地公公" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级土地公公_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神猴" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神猴_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级玉兔" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级玉兔_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神鸡" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神鸡_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级筋斗云" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级筋斗云_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神蛇" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神蛇_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "云游火" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "云游火_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "月影仙" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "月影仙_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "月魅" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "月魅_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "涂山雪" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "涂山雪_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "花灵" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "花灵_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "狐不归" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "狐不归_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "谛听" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "谛听_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	     elseif 造型 == "至尊宝" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "至尊宝_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "蛋蛋鸡" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "蛋蛋鸡_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "音乐鼠" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "音乐鼠_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "赤炎龙" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "赤炎龙_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "双鬼刃" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "双鬼刃_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	     elseif 造型 == "剑魂" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "剑魂_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "鬼火" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "鬼火_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "魂枪" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "魂枪_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "游龙" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "游龙_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "白龙" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "白龙_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级小白龙" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "日游神" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "日游神_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "夜精灵" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "夜精灵_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "美猴王" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "美猴王_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级小白龙_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级飞天" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级飞天_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "月影兔" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "月影兔_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "雪精灵" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "雪精灵_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "小龙人" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "小龙人_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "小肥羊" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "小肥羊_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "霸王龙" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "霸王龙_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "贪狼" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "贪狼_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	 elseif 造型 == "关羽" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "关羽_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "骑士" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "骑士_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "罗成" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "罗成_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "龙虾骑士" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级吸血","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "龙虾骑士_法系" then
		bbs[1] = 333333 --攻资
		bbs[2] = 333333 --防资
		bbs[3] = 1666666 --体资
		bbs[4] = 333333 --法资
		bbs[5] = 333333 --速资
		bbs[6] = 300000 --躲闪
		bbs[7] = 15
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","再生","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "风神" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "风神_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "武魂" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "武魂_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "剑侠客泡泡" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "剑侠客泡泡_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神狗" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神狗_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神鼠" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神鼠_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神猪" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神猪_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级猪小戒" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级猪小戒_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	   elseif 造型 == "鲲鹏" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "鲲鹏_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
      --
      elseif 造型 == "浪淘沙_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    		elseif 造型 == "浪淘沙" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    		elseif 造型 == "大蛇_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    		elseif 造型 == "大蛇" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    		elseif 造型 == "狐狸_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    		elseif 造型 == "狐狸" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    		elseif 造型 == "金角大王_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    		elseif 造型 == "金角大王" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    		elseif 造型 == "紫霞_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    		elseif 造型 == "紫霞" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    		elseif 造型 == "猪刚鬣_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    		elseif 造型 == "猪刚鬣" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
   		elseif 造型 == "白无常令_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
   		elseif 造型 == "白无常令" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
   		elseif 造型 == "晶晶仙子" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "晶晶仙子_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "鼠美人_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "鼠美人" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "红孩儿_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "红孩儿" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "白象精_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "白象精" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "白骨精_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "白骨精" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "天机小子_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "天机小子" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "斗战圣佛_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "斗战圣佛" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "金枪二郎神_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "金枪二郎神" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "太白星君_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "太白星君" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "陈玄丈_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "陈玄丈" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "妖皇_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "妖皇" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "人皇_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "人皇" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "元始天尊_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "元始天尊" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "轩辕黄帝_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "轩辕黄帝" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "蚩尤战神_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "蚩尤战神" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "托塔天王_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "托塔天王" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "嫦娥仙子_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "嫦娥仙子" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "刑天_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "刑天" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "火神祝融_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "火神祝融" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	     elseif 造型 == "水神共工_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "水神共工" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "北极仙翁_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "北极仙翁" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "土神后土_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "土神后土" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "盘古_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "盘古" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "齐天大圣_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "齐天大圣" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "太上老君_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "太上老君" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "太已真人_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "太已真人" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "上古天兵_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "上古天兵" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "判官_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "判官" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "白象精_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "白象精" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "上古精灵_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "上古精灵" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "红孩儿_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "红孩儿" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "上古蛟龙_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "上古蛟龙" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "大鹏王_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "大鹏王" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "达摩_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "达摩" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "雨神龙王_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "雨神龙王" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "菩缇老祖_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "菩缇老祖" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "青牛精_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "青牛精" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "青毛狮王_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "青毛狮王" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "六耳猕猴_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "六耳猕猴" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "如来佛祖_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "如来佛祖" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "陆压道人_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "陆压道人" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "瑭僧_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "瑭僧" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "王母娘娘_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "王母娘娘" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "小白龙_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "小白龙" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "白龙女_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "白龙女" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "青蛟龙_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "青蛟龙" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "画中仙_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "画中仙" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "玉皇大帝_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "玉皇大帝" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "镇元大仙_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "镇元大仙" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "火魔女_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "火魔女" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "小白龙_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "小白龙" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "飞羽_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "飞羽" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "奶牛_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "奶牛" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	     elseif 造型 == "明世隐_法系" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级法术连击","高级法术波动","势如破竹","高级魔之心","高级进击法爆","高级法术暴击","观照万象","流沙轻音","叱咤风云","天降灵葫","八凶法阵","水漫金山","泰山压顶","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "明世隐" then
		bbs[1] = 666666 --攻资
		bbs[2] = 666666 --防资
		bbs[3] = 1999999 --体资
		bbs[4] = 666666 --法资
		bbs[5] = 666666 --速资
		bbs[6] = 666666 --躲闪
		bbs[7] = 20
	    bbs[8] = {"高级必杀","高级连击","高级夜战","高级强力","高级感知","驱怪","嗜血追击","高级吸血","乘胜追击","昼伏夜出","理直气壮","千钧一怒","从天而降","苍鸾怒击","高级神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}






	end
	return  bbs
end