--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2021-04-29 17:55:48
--======================================================================--
function 引擎.取战斗模型(pg,wq)
	if pg==nil then
	    pg = "天将"
	end
	local pgs = {}
	local pg2 = pg
	local s = "_普通"
	if wq ~= nil then
	   	s = "_"..wq
	end
	pg = pg..s
	if pg == "竹节双剑_飞燕女_普通" then
		pgs[1] = 1107292387
		pgs[2] = 1107292387
		pgs[3] = 2521369664
		pgs[4] = 3431990852
		pgs[6] = 2150756975
		pgs[7] = 2948306353
		pgs[8] = 3415383948
		pgs[9] = 2723304031
		pgs[10] = "shape.wdf"
	elseif pg == "骨精灵_爪刺" then
		pgs[1] = 3043670818
		pgs[2] = 3043670818
		pgs[3] = 3644222844
		pgs[4] = 2656336023
		pgs[6] = 4229617854
		pgs[7] = 3601844930
		pgs[8] = 2956176231
		pgs[9] = 4259873334
		pgs[10] = "shape.wdf"
	elseif pg == "无极丝_玄彩娥_普通" then
		pgs[1] = 720570501
		pgs[2] = 720570501
		pgs[3] = 177832508
		pgs[4] = 2487726993
		pgs[6] = 3513269889
		pgs[7] = 629550622
		pgs[8] = 327433169
		pgs[9] = 2643257844
		pgs[10] = "shape.wdf"
	elseif pg == "羽灵神_法杖" then
		pgs[1] = 529648379
		pgs[2] = 529648379
		pgs[3] = 570130129
		pgs[4] = 1552868103
		pgs[6] = 2280958058
		pgs[7] = 4138194582
		pgs[8] = 1198313117
		pgs[9] = 1516641634
		pgs[10] = "shape.wdf"
	elseif pg == "狼牙锤_虎头怪_普通" then
		pgs[1] = 2073386691
		pgs[2] = 2073386691
		pgs[3] = 336486465
		pgs[4] = 381771912
		pgs[6] = 4106128916
		pgs[7] = 1791439790
		pgs[8] = 568824381
		pgs[9] = 1676981226
		pgs[10] = "shape.wdf"
	elseif pg == "腾云杖_巫蛮儿_普通" then
		pgs[1] = 3456418962
		pgs[2] = 3456418962
		pgs[3] = 1443524884
		pgs[4] = 2407737199
		pgs[6] = 4073450724
		pgs[7] = 4073450724
		pgs[8] = 2828185705
		pgs[9] = 2088694658
		pgs[10] = "shape.wdf"
	elseif pg == "逍遥生_普通" then
		pgs[1] = 776342191
		pgs[2] = 776342191
		pgs[3] = 2305122459
		pgs[4] = 4097908221
		pgs[6] = 947396698
		pgs[7] = 3952279767
		pgs[8] = 1198567883
		pgs[9] = 1011046408
		pgs[10] = "shape.wdf"
	elseif pg == "龙太子_扇" then
		pgs[1] = 241140809
		pgs[2] = 241140809
		pgs[3] = 1280216665
		pgs[4] = 3101694266
		pgs[6] = 2034116134
		pgs[7] = 2603954881
		pgs[8] = 4232546957
		pgs[9] = 3966136859
        pgs[1.1] =0x6DDC0F67
        pgs[1.2] =0x3AAC439A -- E472B0BE

		pgs[10] = "shape.wdf"
	elseif pg == "游龙剑_剑侠客_普通" then
		pgs[1] = 3922251448
		pgs[2] = 3922251448
		pgs[3] = 2729643500
		pgs[4] = 3737672137
		pgs[6] = 525352739
		pgs[7] = 948395215
		pgs[8] = 563220674
		pgs[9] = 3149578823
		pgs[10] = "shape.wdf"
	elseif pg == "青铜短剑_逍遥生_普通" then
		pgs[1] = 1198108472
		pgs[2] = 1198108472
		pgs[3] = 1361263285
		pgs[4] = 2271925935
		pgs[6] = 2946567894
		pgs[7] = 3149178979
		pgs[8] = 3990213912
		pgs[9] = 3929526014
		pgs[10] = "shape.wdf"
	elseif pg == "飞燕女_普通" then
		pgs[1] = 1018070922
		pgs[2] = 1018070922
		pgs[3] = 322750433
		pgs[4] = 29450010
		pgs[6] = 3234089534
		pgs[7] = 2076610755
		pgs[8] = 2826457680
		pgs[9] = 2418368925
		pgs[10] = "shape.wdf"
	elseif pg == "七彩罗刹_玄彩娥_普通" then
		pgs[1] = 2097271664
		pgs[2] = 2097271664
		pgs[3] = 446065688
		pgs[4] = 34704861
		pgs[6] = 2226391655
		pgs[7] = 4023029297
		pgs[8] = 2658422875
		pgs[9] = 1050015636
		pgs[10] = "shape.wdf"
	elseif pg == "神火扇_龙太子_普通" then
		pgs[1] = 1818358093
		pgs[2] = 1818358093
		pgs[3] = 3568094185
		pgs[4] = 1584219148
		pgs[6] = 3409145103
		pgs[7] = 666236837
		pgs[8] = 3980290410
		pgs[9] = 1171511807
		pgs[10] = "shape.wdf"
	elseif pg == "青铜斧_虎头怪_普通" then
		pgs[1] = 2625820889
		pgs[2] = 2625820889
		pgs[3] = 1963828881
		pgs[4] = 1319228411
		pgs[6] = 860172680
		pgs[7] = 36420174
		pgs[8] = 3821452431
		pgs[9] = 303003892
		pgs[10] = "shape.wdf"
	elseif pg == "狐美人_爪刺" then
		pgs[1] = 143164260
		pgs[2] = 143164260
		pgs[3] = 3180126153
		pgs[4] = 3467601219
		pgs[6] = 1873404188
		pgs[7] = 1585787695
		pgs[8] = 947996020
		pgs[9] = 3212527142
		pgs[1.1] =0xF471D81D
        pgs[1.2] =0x1D156715
		pgs[10] = "shape.wdf"
	elseif pg == "青龙牙_骨精灵_普通" then
		pgs[1] = 3799914888
		pgs[2] = 3799914888
		pgs[3] = 1849406648
		pgs[4] = 623293418
		pgs[6] = 4122645564
		pgs[7] = 674755217
		pgs[8] = 1075420620
		pgs[9] = 3643822727
		pgs[10] = "shape.wdf"
	elseif pg == "乌金三叉戟_神天兵_普通" then
		pgs[1] = 408164304
		pgs[2] = 408164304
		pgs[3] = 4205323621
		pgs[4] = 2362411253
		pgs[6] = 2944638184
		pgs[7] = 611952719
		pgs[8] = 907746138
		pgs[9] = 1478073855
		pgs[10] = "shape.wdf"
	elseif pg == "如意宝珠_杀破狼_普通" then
		pgs[1] = 2994264484
		pgs[2] = 2994264484
		pgs[3] = 1404894523
		pgs[4] = 530980268
		pgs[6] = 3593075951
		pgs[7] = 4288686185
		pgs[8] = 834957611
		pgs[9] = 935164006
		pgs[10] = "shape.wdf"
	elseif pg == "竹节双剑_英女侠_普通" then
		pgs[1] = 785035487
		pgs[2] = 785035487
		pgs[3] = 388404819
		pgs[4] = 3063317704
		pgs[6] = 781929242
		pgs[7] = 992739922
		pgs[8] = 2099829177
		pgs[9] = 2839104966
		pgs[10] = "shape.wdf"
	elseif pg == "双弦钺_虎头怪_普通" then
		pgs[1] = 3106550770
		pgs[2] = 3106550770
		pgs[3] = 867109572
		pgs[4] = 813505863
		pgs[6] = 4256430594
		pgs[7] = 1073168906
		pgs[8] = 3722911626
		pgs[9] = 1532549372
		pgs[10] = "shape.wdf"
	elseif pg == "羽灵神_弓弩" then
		pgs[1] = 1894911422
		pgs[2] = 1894911422
		pgs[3] = 570130129
		pgs[4] = 1552868103
		pgs[6] = 1384231887
		pgs[7] = 3035774294
		pgs[8] = 1198313117
		pgs[9] = 1516641634
		pgs[10] = "shape.wdf"
	elseif pg == "羽灵神_弓弩1" then
		pgs[1] = 0042392635
		pgs[2] = 0042392635
		pgs[3] = 0570130129
		pgs[4] = 1552868103
		pgs[6] = 1139367548
		pgs[7] = 0xB4F23D56
		pgs[8] = 1750053013
		pgs[9] = 1516641634
		pgs[10] = "shape.wdf"
	elseif pg == "青铜短剑_剑侠客_普通" then
		pgs[1] = 4256351077
		pgs[2] = 4256351077
		pgs[3] = 1799000911
		pgs[4] = 3029718579
		pgs[6] = 2340710053
		pgs[7] = 874161900
		pgs[8] = 1001128045
		pgs[9] = 3927011624
		pgs[10] = "shape.wdf"
	elseif pg == "无极丝_舞天姬_普通" then
		pgs[1] = 614245463
		pgs[2] = 614245463
		pgs[3] = 1946824091
		pgs[4] = 694856255
		pgs[6] = 2175791405
		pgs[7] = 448343009
		pgs[8] = 2148337924
		pgs[9] = 2923284079
		pgs[10] = "shape.wdf"
	elseif pg == "翡翠珠_巫蛮儿_普通" then
		pgs[1] = 3539296504
		pgs[2] = 3539296504
		pgs[3] = 2255315467
		pgs[4] = 1802143462
		pgs[6] = 1510770330
		pgs[7] = 1930701898
		pgs[8] = 3505690179
		pgs[9] = 1435774063
		pgs[10] = "shape.wdf"
	elseif pg == "虎头怪_斧钺" then
		pgs[1] = 2471916192
		pgs[2] = 2471916192
		pgs[3] = 1740983547
		pgs[4] = 1851258377
		pgs[6] = 1927395527
		pgs[7] = 1883982028
		pgs[8] = 2089007572
		pgs[9] = 92383142
		pgs[1.1] =0xDE8167D1
        pgs[1.2] =0x55D81513
		pgs[10] = "shape.wdf"
	elseif pg == "点金棒_骨精灵_普通" then
		pgs[1] = 3310814476
		pgs[2] = 3310814476
		pgs[3] = 3103212281
		pgs[4] = 3301564224
		pgs[6] = 1122132964
		pgs[7] = 3107411095
		pgs[8] = 155295757
		pgs[9] = 1580683403
		pgs[10] = "shape.wdf"
	elseif pg == "琉璃珠_巫蛮儿_普通" then
		pgs[1] = 1403236209
		pgs[2] = 1403236209
		pgs[3] = 1329700091
		pgs[4] = 1691312599
		pgs[6] = 786593580
		pgs[7] = 164320860
		pgs[8] = 2463504053
		pgs[9] = 2573416526
		pgs[10] = "shape.wdf"
	elseif pg == "狼牙刀_巨魔王_普通" then
		pgs[1] = 1348040770
		pgs[2] = 1348040770
		pgs[3] = 352421824
		pgs[4] = 1800113692
		pgs[6] = 1284246655
		pgs[7] = 4283867446
		pgs[8] = 1391628501
		pgs[9] = 2232000579
		pgs[10] = "shape.wdf"
	elseif pg == "牛皮鞭_英女侠_普通" then
		pgs[1] = 3931398716
		pgs[2] = 3931398716
		pgs[3] = 1978009081
		pgs[4] = 3180100501
		pgs[6] = 2391704735
		pgs[7] = 2419933303
		pgs[8] = 2521677817
		pgs[9] = 2956424440
		pgs[10] = "shape.wdf"
	elseif pg == "钢结鞭_狐美人_普通" then
		pgs[1] = 2383050056
		pgs[2] = 2383050056
		pgs[3] = 3281460149
		pgs[4] = 3516998304
		pgs[6] = 246739877
		pgs[7] = 3039794984
		pgs[8] = 875610474
		pgs[9] = 3210281280
		pgs[10] = "shape.wdf"
	elseif pg == "逍遥生_剑" then
		pgs[1] = 2801151609
		pgs[2] = 2801151609
		pgs[3] = 1782439566
		pgs[4] = 3738039458
		pgs[6] = 1629704855
		pgs[7] = 1539613628
		pgs[8] = 1512265752
		pgs[9] = 116130982
		pgs[1.1] =0x3936CBE8  --6E78C93B
        pgs[1.2] =0x5F809C80
		pgs[10] = "shape.wdf"
	elseif pg == "折扇_逍遥生_普通" then
		pgs[1] = 2964614373
		pgs[2] = 2964614373
		pgs[3] = 3257923907
		pgs[4] = 293936349
		pgs[6] = 1375158316
		pgs[7] = 3094890393
		pgs[8] = 1511168433
		pgs[9] = 391725534
		pgs[10] = "shape.wdf"
	elseif pg == "青刚刺_狐美人_普通" then
		pgs[1] = 181873383
		pgs[2] = 181873383
		pgs[3] = 1794635107
		pgs[4] = 429992710
		pgs[6] = 1822050644
		pgs[7] = 366643004
		pgs[8] = 2389652378
		pgs[9] = 2180063945
		pgs[10] = "shape.wdf"
	elseif pg == "折扇_龙太子_普通" then
		pgs[1] = 1892693347
		pgs[2] = 1892693347
		pgs[3] = 3257923907
		pgs[4] = 1204995981
		pgs[6] = 1362359639
		pgs[7] = 2228831626
		pgs[8] = 3633790550
		pgs[9] = 80506382
		pgs[10] = "shape.wdf"
	elseif pg == "腾云杖_羽灵神_普通" then
		pgs[1] = 446004749
		pgs[2] = 446004749
		pgs[3] = 866998113
		pgs[4] = 30654504
		pgs[6] = 3664608621
		pgs[7] = 631837046
		pgs[8] = 3821365630
		pgs[9] = 172627858
		pgs[10] = "shape.wdf"
	elseif pg == "龙太子_普通" then
		pgs[1] = 995698620
		pgs[2] = 995698620
		pgs[3] = 2482790664
		pgs[4] = 708419920
		pgs[6] = 397538195
		pgs[7] = 1042710685
		pgs[8] = 1284179344
		pgs[9] = 1173564955
		pgs[10] = "shape.wdf"
	elseif pg == "双弦钺_巨魔王_普通" then
		pgs[1] = 1793132112
		pgs[2] = 1793132112
		pgs[3] = 1963828881
		pgs[4] = 3898773470
		pgs[6] = 2550126650
		pgs[7] = 153091850
		pgs[8] = 544328121
		pgs[9] = 2797209389
		pgs[10] = "shape.wdf"
	elseif pg == "铁爪_骨精灵_普通" then
		pgs[1] = 3158218287
		pgs[2] = 3158218287
		pgs[3] = 4058918673
		pgs[4] = 619798639
		pgs[6] = 4166133046
		pgs[7] = 2469680581
		pgs[8] = 1948730791
		pgs[9] = 2320459601
		pgs[10] = "shape.wdf"
	elseif pg == "青藤柳叶鞭_英女侠_普通" then
		pgs[1] = 2804585084
		pgs[2] = 2804585084
		pgs[3] = 60106873
		pgs[4] = 1142701864
		pgs[6] = 3663657779
		pgs[7] = 1499832483
		pgs[8] = 3691312807
		pgs[9] = 3691312807
		pgs[10] = "shape.wdf"
	elseif pg == "舞天姬_普通" then
		pgs[1] = 2774401093
		pgs[2] = 2774401093
		pgs[3] = 365985475
		pgs[4] = 86275401
		pgs[6] = 3443216643
		pgs[7] = 1786109105
		pgs[8] = 1241775590
		pgs[9] = 4118221086
		pgs[10] = "shape.wdf"
	elseif pg == "飞燕女_双短剑" then
		pgs[1] = 2103710679
		pgs[2] = 2103710679
		pgs[3] = 322750433
		pgs[4] = 29450010
		pgs[6] = 3234089534
		pgs[7] = 2076610755
		pgs[8] = 2826457680
		pgs[9] = 2418368925
		pgs[1.1] =0x7D959E28
         pgs[1.2] =0x6A60178D
		pgs[10] = "shape.wdf"
	elseif pg == "细木棒_骨精灵_普通" then
		pgs[1] = 572946160
		pgs[2] = 572946160
		pgs[3] = 869013113
		pgs[4] = 430229213
		pgs[6] = 1202797055
		pgs[7] = 87009475
		pgs[8] = 3532585728
		pgs[9] = 1194431645
		pgs[10] = "shape.wdf"
	elseif pg == "金背大砍刀_剑侠客_普通" then
		pgs[1] = 2695990707
		pgs[2] = 2695990707
		pgs[3] = 1837946764
		pgs[4] = 1995983471
		pgs[6] = 3956010201
		pgs[7] = 3740065177
		pgs[8] = 3607972716
		pgs[9] = 1238352835
		pgs[10] = "shape.wdf"
	elseif pg == "狐美人_普通" then
		pgs[1] = 143164260
		pgs[2] = 143164260
		pgs[3] = 3180126153
		pgs[4] = 3467601219
		pgs[6] = 1734212905
		pgs[7] = 1585787695
		pgs[8] = 947996020
		pgs[9] = 3212527142
		pgs[10] = "shape.wdf"
	elseif pg == "玄铁矛_神天兵_普通" then
		pgs[1] = 457024889
		pgs[2] = 457024889
		pgs[3] = 575337904
		pgs[4] = 970913679
		pgs[6] = 3111818852
		pgs[7] = 1880364342
		pgs[8] = 883798385
		pgs[9] = 2466450533
		pgs[10] = "shape.wdf"
	elseif pg == "黄铜圈_飞燕女_普通" then
		pgs[1] = 4146113787
		pgs[2] = 4146113787
		pgs[3] = 3328869375
		pgs[4] = 2935267523
		pgs[6] = 2104438938
		pgs[7] = 3418401452
		pgs[8] = 867616434
		pgs[9] = 2580407403
		pgs[10] = "shape.wdf"
	elseif pg == "玄铁矛_龙太子_普通" then
		pgs[1] = 650631390
		pgs[2] = 650631390
		pgs[3] = 1332270280
		pgs[4] = 1220141886
		pgs[6] = 407764697
		pgs[7] = 477458607
		pgs[8] = 4281686609
		pgs[9] = 663869830
		pgs[10] = "shape.wdf"
	elseif pg == "巨魔王_普通" then
		pgs[1] = 508905397
		pgs[2] = 508905397
		pgs[3] = 4036925699
		pgs[4] = 1635724392
		pgs[6] = 2639845870
		pgs[7] = 2750701818
		pgs[8] = 2273495960
		pgs[9] = 4081980249
		pgs[10] = "shape.wdf"
	elseif pg == "青藤柳叶鞭_狐美人_普通" then
		pgs[1] = 1451526591
		pgs[2] = 1451526591
		pgs[3] = 672510267
		pgs[4] = 2873780575
		pgs[6] = 2492119629
		pgs[7] = 599092463
		pgs[8] = 3419036208
		pgs[9] = 2641306317
		pgs[10] = "shape.wdf"
	elseif pg == "玄彩娥_魔棒" then
		pgs[1] = 3947923690
		pgs[2] = 3947923690
		pgs[3] = 1501032219
		pgs[4] = 3870010961
		pgs[6] = 184048410
		pgs[7] = 2162415082
		pgs[8] = 2234123373
		pgs[9] = 2657283590
		pgs[10] = "shape.wdf"
	elseif pg == "连珠神弓_羽灵神_普通" then
		pgs[1] = 2326794251
		pgs[2] = 2326794251
		pgs[3] = 2712600528
		pgs[4] = 3987564547
		pgs[6] = 427605991
		pgs[7] = 3545789610
		pgs[8] = 49846298
		pgs[9] = 4190609956
		pgs[10] = "shape.wdf"
	elseif pg == "蛇形月_飞燕女_普通" then
		pgs[1] = 1584140220
		pgs[2] = 1584140220
		pgs[3] = 1692063004
		pgs[4] = 1463150317
		pgs[6] = 4215251914
		pgs[7] = 3715550978
		pgs[8] = 174531720
		pgs[9] = 913070441
		pgs[10] = "shape.wdf"
	elseif pg == "空度禅师_普通" then
		pgs[1] = 3113824
		pgs[2] = 3115905
		pgs[3] = 3109562
		pgs[4] = 3111694
		pgs[6] = 3107502
		pgs[7] = 3122120
		pgs[8] = 3120101
		pgs[9] = 3105370
		pgs[10] = "shape.dll"
	elseif pg == "翡翠珠_杀破狼_普通" then
		pgs[1] = 1888438119
		pgs[2] = 1888438119
		pgs[3] = 832082873
		pgs[4] = 2462082254
		pgs[6] = 3335305851
		pgs[7] = 3225276990
		pgs[8] = 3777022322
		pgs[9] = 2618824675
		pgs[10] = "shape.wdf"
	elseif pg == "杀破狼_普通" then
		pgs[1] = 2232599242
		pgs[2] = 2232599242
		pgs[3] = 3215162495
		pgs[4] = 3629275056
		pgs[6] = 4241012400
		pgs[7] = 3547444917
		pgs[8] = 1721194312
		pgs[9] = 3836921096
		pgs[10] = "shape.wdf"
	elseif pg == "墨铁拐_羽灵神_普通" then
		pgs[1] = 581491157
		pgs[2] = 581491157
		pgs[3] = 95568889
		pgs[4] = 4136518094
		pgs[6] = 1603576455
		pgs[7] = 2492027915
		pgs[8] = 616237873
		pgs[9] = 2456783957
		pgs[10] = "shape.wdf"
	elseif pg == "飞燕女_环圈" then
		pgs[1] = 1018070922
		pgs[2] = 1018070922
		pgs[3] = 2068177574
		pgs[4] = 4111908170
		pgs[6] = 1489146739
		pgs[7] = 607870271
		pgs[8] = 1607593791
		pgs[9] = 3911067979
		pgs[1.1] =0xBAD926DB
		pgs[1.2] =0x36BDC402
		pgs[10] = "shape.wdf"
	elseif pg == "杀破狼_宝珠" then
		pgs[1] = 3067304876
		pgs[2] = 3067304876
		pgs[3] = 3215162495
		pgs[4] = 1186759867
		pgs[6] = 1266038770
		pgs[7] = 2576943278
		pgs[8] = 1721194312
		pgs[9] = 3836921096
		pgs[10] = "shape.wdf"
	elseif pg == "玄彩娥_普通" then
		pgs[1] = 3947923690
		pgs[2] = 3947923690
		pgs[3] = 1501032219
		pgs[4] = 728904944
		pgs[6] = 2291528828
		pgs[7] = 2162415082
		pgs[8] = 2234123373
		pgs[9] = 2657283590
		pgs[10] = "shape.wdf"
	elseif pg == "双短剑_飞燕女_普通" then
		pgs[1] = 18896713
		pgs[2] = 18896713
		pgs[3] = 2502791430
		pgs[4] = 3950458782
		pgs[6] = 2408807811
		pgs[7] = 3421854459
		pgs[8] = 967461082
		pgs[9] = 372406582
		pgs[10] = "shape.wdf"
	elseif pg == "双短剑_英女侠_普通" then
		pgs[1] = 2749813573
		pgs[2] = 2749813573
		pgs[3] = 3182553286
		pgs[4] = 2212413736
		pgs[6] = 2974322210
		pgs[7] = 4220417948
		pgs[8] = 3709846822
		pgs[9] = 4251803233
		pgs[10] = "shape.wdf"
	elseif pg == "巨魔王_斧钺" then
		pgs[1] = 508905397
		pgs[2] = 508905397
		pgs[3] = 4036925699
		pgs[4] = 1635724392
		pgs[6] = 2639845870
		pgs[7] = 2750701818
		pgs[8] = 2273495960
		pgs[9] = 4081980249
		pgs[1.1] =0xE3AE17C1
		pgs[1.2] =0x2A172A4B
		pgs[10] = "shape.wdf"
	elseif pg == "连珠神弓_杀破狼_普通" then
		pgs[1] = 3896611853
		pgs[2] = 3896611853
		pgs[3] = 2036432029
		pgs[4] = 2102929671
		pgs[6] = 3589969117
		pgs[7] = 3876338026
		pgs[8] = 1811002066
		pgs[9] = 1930889295
		pgs[10] = "shape.wdf"
	elseif pg == "剑侠客_普通" then
		pgs[1] = 2840575336
		pgs[2] = 2840575336
		pgs[3] = 991657694
		pgs[4] = 3738000150
		pgs[6] = 2626634241
		pgs[7] = 1486978342
		pgs[8] = 512918654
		pgs[9] = 361988011
		pgs[10] = "shape.wdf"
	elseif pg == "金刺轮_飞燕女_普通" then
		pgs[1] = 3720262398
		pgs[2] = 3720262398
		pgs[3] = 1115289817
		pgs[4] = 2525078858
		pgs[6] = 827935432
		pgs[7] = 1403033620
		pgs[8] = 2466319363
		pgs[9] = 113367602
		pgs[10] = "shape.wdf"
	elseif pg == "如意宝珠_巫蛮儿_普通" then
		pgs[1] = 3047110383
		pgs[2] = 3047110383
		pgs[3] = 2280873549
		pgs[4] = 2717151389
		pgs[6] = 3043609869
		pgs[7] = 3638266331
		pgs[8] = 2356120530
		pgs[9] = 62625934
		pgs[10] = "shape.wdf"
	elseif pg == "狼牙刀_剑侠客_普通" then
		pgs[1] = 914160701
		pgs[2] = 914160701
		pgs[3] = 790662160
		pgs[4] = 4033879125
		pgs[6] = 2718755916
		pgs[7] = 310154266
		pgs[8] = 2495162598
		pgs[9] = 2607187114
		pgs[10] = "shape.wdf"
	elseif pg == "满天星_玄彩娥_普通" then
		pgs[1] = 3100078257
		pgs[2] = 3100078257
		pgs[3] = 677178981
		pgs[4] = 4188799764
		pgs[6] = 2373806356
		pgs[7] = 123928187
		pgs[8] = 2280722867
		pgs[9] = 591449018
		pgs[10] = "shape.wdf"
	elseif pg == "赤焰双剑_英女侠_普通" then
		pgs[1] = 4168647024
		pgs[2] = 4168647024
		pgs[3] = 3572817351
		pgs[4] = 712581498
		pgs[6] = 2658138658
		pgs[7] = 2764921579
		pgs[8] = 2741994479
		pgs[9] = 4235932064
		pgs[10] = "shape.wdf"
	elseif pg == "英女侠_鞭" then
		pgs[1] = 1083652265
		pgs[2] = 1083652265
		pgs[3] = 550776032
		pgs[4] = 1830207536
		pgs[6] = 487493048
		pgs[7] = 4015503046
		pgs[8] = 3420727052
		pgs[9] = 2264625814
		pgs[1.1] =0x2F78067E --其他代替
        pgs[1.2] =0x440A2BC5
		pgs[10] = "shape.wdf"
	elseif pg == "黄铜圈_舞天姬_普通" then
		pgs[1] = 1246340040
		pgs[2] = 1246340040
		pgs[3] = 1695349470
		pgs[4] = 2991787754
		pgs[6] = 1524014588
		pgs[7] = 4075994022
		pgs[8] = 504842185
		pgs[9] = 1374023375
		pgs[10] = "shape.wdf"
	elseif pg == "金背大砍刀_巨魔王_普通" then
		pgs[1] = 2076710374
		pgs[2] = 2076710374
		pgs[3] = 1462666995
		pgs[4] = 1595258466
		pgs[6] = 3808390705
		pgs[7] = 3112271650
		pgs[8] = 1162958128
		pgs[9] = 3317931600
		pgs[10] = "shape.wdf"
	elseif pg == "巫蛮儿_宝珠" then
		pgs[1] = 724036542
		pgs[2] = 724036542
		pgs[3] = 857427883
		pgs[4] = 1487210709
		pgs[6] = 2600092653
		pgs[7] = 4235120544
		pgs[8] = 3377965731
		pgs[9] = 170880794
		pgs[10] = "shape.wdf"
	elseif pg == "英女侠_普通" then
		pgs[1] = 1131552735
		pgs[2] = 1131552735
		pgs[3] = 550776032
		pgs[4] = 1762226248
		pgs[6] = 283881972
		pgs[7] = 1333230872
		pgs[8] = 2022264436
		pgs[9] = 1784128647
		pgs[10] = "shape.wdf"
	elseif pg == "五色缎带_玄彩娥_普通" then
		pgs[1] = 986673291
		pgs[2] = 986673291
		pgs[3] = 2847084631
		pgs[4] = 1814531001
		pgs[6] = 2478192000
		pgs[7] = 3703252301
		pgs[8] = 3541518516
		pgs[9] = 3812334075
		pgs[10] = "shape.wdf"
	elseif pg == "龙太子_枪矛" then
		pgs[1] = 995698620
		pgs[2] = 995698620
		pgs[3] = 2482790664
		pgs[4] = 708419920
		pgs[6] = 397538195
		pgs[7] = 1042710685
		pgs[8] = 1284179344
		pgs[9] = 1173564955
		pgs[10] = "shape.wdf"
		pgs[1.1] =0x6C1E5A4A  --E2770734
        pgs[1.2] =0xAFBCB42D
	elseif pg == "金刺轮_舞天姬_普通" then
		pgs[1] = 3926831021
		pgs[2] = 3926831021
		pgs[3] = 1774309751
		pgs[4] = 2501160049
		pgs[6] = 2255887722
		pgs[7] = 173996820
		pgs[8] = 4154265461
		pgs[9] = 3161036338
		pgs[10] = "shape.wdf"
	elseif pg == "红缨枪_龙太子_普通" then
		pgs[1] = 4208641994
		pgs[2] = 4208641994
		pgs[3] = 3367459571
		pgs[4] = 4155725796
		pgs[6] = 170841557
		pgs[7] = 2694226760
		pgs[8] = 1612726780
		pgs[9] = 1217969354
		pgs[10] = "shape.wdf"
	elseif pg == "巫蛮儿_法杖" then
		pgs[1] = 2404345852
		pgs[2] = 2404345852
		pgs[3] = 857427883
		pgs[4] = 3299007490
		pgs[6] = 3847342356
		pgs[7] = 2219256477
		pgs[8] = 3377965731
		pgs[9] = 1458812347
		pgs[10] = "shape.wdf"
	elseif pg == "乌金三叉戟_龙太子_普通" then
		pgs[1] = 2664793060
		pgs[2] = 2664793060
		pgs[3] = 1779222969
		pgs[4] = 1212846725
		pgs[6] = 3544733296
		pgs[7] = 2097787361
		pgs[8] = 2856910184
		pgs[9] = 2573475492
		pgs[10] = "shape.wdf"
	elseif pg == "柳叶刀_巨魔王_普通" then
		pgs[1] = 3522958092
		pgs[2] = 3522958092
		pgs[3] = 2519475388
		pgs[4] = 3788202981
		pgs[6] = 333884425
		pgs[7] = 3427345453
		pgs[8] = 1323639728
		pgs[9] = 4266255286
		pgs[10] = "shape.wdf"
	elseif pg == "青刚刺_骨精灵_普通" then
		pgs[1] = 3075032207
		pgs[2] = 3075032207
		pgs[3] = 4256318239
		pgs[4] = 3075032207
		pgs[6] = 1414239405
		pgs[7] = 1414239405
		pgs[8] = 2053717070
		pgs[9] = 2785457115
		pgs[10] = "shape.wdf"
	elseif pg == "羽灵神_普通" then
		pgs[1] = 1894911422
		pgs[2] = 1894911422
		pgs[3] = 570130129
		pgs[4] = 1552868103
		pgs[6] = 1384231887
		pgs[7] = 3035774294
		pgs[8] = 1198313117
		pgs[9] = 1516641634
		pgs[10] = "shape.wdf"
	elseif pg == "琉璃珠_杀破狼_普通" then
		pgs[1] = 1347542308
		pgs[2] = 1347542308
		pgs[3] = 1084648267
		pgs[4] = 2598475041
		pgs[6] = 220293482
		pgs[7] = 309382841
		pgs[8] = 3237534358
		pgs[9] = 4248308764
		pgs[10] = "shape.wdf"
	elseif pg == "虎头怪_锤" then
		pgs[1] = 3188334211
		pgs[2] = 3188334211
		pgs[3] = 3845828864
		pgs[4] = 3951179215
		pgs[6] = 1705376638
		pgs[7] = 659922551
		pgs[8] = 3836622392
		pgs[9] = 4274012337
		pgs[10] = "shape.wdf"
	elseif pg == "五色缎带_舞天姬_普通" then
		pgs[1] = 13536912
		pgs[2] = 13536912
		pgs[3] = 3018065077
		pgs[4] = 4096686404
		pgs[6] = 2509295261
		pgs[7] = 3306367653
		pgs[8] = 4257026415
		pgs[9] = 213886082
		pgs[10] = "shape.wdf"
	elseif pg == "逍遥生_扇" then
		pgs[1] = 776342191
		pgs[2] = 776342191
		pgs[3] = 2305122459
		pgs[4] = 4097908221
		pgs[6] = 947396698
		pgs[7] = 3952279767
		pgs[8] = 1198567883
		pgs[9] = 1011046408
		pgs[1.1] =0x797993B0
        pgs[1.2] =0x0193E046
		pgs[10] = "shape.wdf"
	elseif pg == "舞天姬_飘带" then
		pgs[1] = 2774401093
		pgs[2] = 2774401093
		pgs[3] = 365985475
		pgs[4] = 86275401
		pgs[6] = 3443216643
		pgs[7] = 1786109105
		pgs[8] = 1241775590
		pgs[9] = 4118221086
		pgs[10] = "shape.wdf"
	elseif pg == "赤焰双剑_飞燕女_普通" then
		pgs[1] = 1548996612
		pgs[2] = 1548996612
		pgs[3] = 2446905048
		pgs[4] = 3742981382
		pgs[6] = 2519910999
		pgs[7] = 313011222
		pgs[8] = 3245654395
		pgs[9] = 2878513884
		pgs[10] = "shape.wdf"
	elseif pg == "青锋剑_剑侠客_普通" then
		pgs[1] = 128739684
		pgs[2] = 128739684
		pgs[3] = 1360269025
		pgs[4] = 1259586579
		pgs[6] = 3155607107
		pgs[7] = 3585789919
		pgs[8] = 548399706
		pgs[9] = 3149578823
		pgs[10] = "shape.wdf"
	elseif pg == "狼牙锤_神天兵_普通" then
		pgs[1] = 103920893
		pgs[2] = 103920893
		pgs[3] = 3337098745
		pgs[4] = 1754275390
		pgs[6] = 1598161855
		pgs[7] = 4165662626
		pgs[8] = 3269185703
		pgs[9] = 685627288
		pgs[10] = "shape.wdf"
	elseif pg == "宝雕长弓_杀破狼_普通" then
		pgs[1] = 3187707461
		pgs[2] = 3187707461
		pgs[3] = 3770288341
		pgs[4] = 2752043077
		pgs[6] = 2434290964
		pgs[7] = 3329145004
		pgs[8] = 1745722591
		pgs[9] = 9444076
		pgs[10] = "shape.wdf"
	elseif pg == "宝雕长弓_羽灵神_普通" then
		pgs[1] = 4253393401
		pgs[2] = 4253393401
		pgs[3] = 1615127028
		pgs[4] = 3401409995
		pgs[6] = 2163483216
		pgs[7] = 2874238993
		pgs[8] = 290712464
		pgs[9] = 412551822
		pgs[10] = "shape.wdf"
	elseif pg == "硬木弓_杀破狼_普通" then
		pgs[1] = 3001778802
		pgs[2] = 3001778802
		pgs[3] = 2629114281
		pgs[4] = 370350902
		pgs[6] = 3945843828
		pgs[7] = 297727953
		pgs[8] = 1273865503
		pgs[9] = 1767508772
		pgs[10] = "shape.wdf"
	elseif pg == "硬木弓_羽灵神_普通" then
		pgs[1] = 150635600
		pgs[2] = 150635600
		pgs[3] = 1149486021
		pgs[4] = 1352870002
		pgs[6] = 3031812840
		pgs[7] = 2982615098
		pgs[8] = 3723589923
		pgs[9] = 1534728987
		pgs[10] = "shape.wdf"
	elseif pg == "墨铁拐_巫蛮儿_普通" then
		pgs[1] = 333733022
		pgs[2] = 333733022
		pgs[3] = 923276916
		pgs[4] = 1683281266
		pgs[6] = 3200804307
		pgs[7] = 2976979233
		pgs[8] = 160002331
		pgs[9] = 1565301941
		pgs[10] = "shape.wdf"
	elseif pg == "乌金鬼头镰_巨魔王_普通" then
		pgs[1] = 208276143
		pgs[2] = 208276143
		pgs[3] = 3914981211
		pgs[4] = 1471811059
		pgs[6] = 1976211634
		pgs[7] = 153091850
		pgs[8] = 3647700056
		pgs[9] = 4019257677
		pgs[10] = "shape.wdf"
	elseif pg == "巨魔王_刀" then
		pgs[1] = 1518169819
		pgs[2] = 1518169819
		pgs[3] = 2951893280
		pgs[4] = 533876880
		pgs[6] = 747524185
		pgs[7] = 594523269
		pgs[8] = 3417945932
		pgs[9] = 2896805672
		pgs[1.1] =0x01700A6C
		pgs[10] = "shape.wdf"
	elseif pg == "柳叶刀_剑侠客_普通" then
		pgs[1] = 2309692066
		pgs[2] = 2309692066
		pgs[3] = 4083786274
		pgs[4] = 1649684398
		pgs[6] = 3909215663
		pgs[7] = 1820668649
		pgs[8] = 1323639728
		pgs[9] = 3231555815
		pgs[10] = "shape.wdf"
	elseif pg == "英女侠_双短剑" then
		pgs[1] = 1131552735
		pgs[2] = 1131552735
		pgs[3] = 550776032
		pgs[4] = 1762226248
		pgs[6] = 283881972
		pgs[7] = 1333230872
		pgs[8] = 2022264436
		pgs[9] = 1784128647
		pgs[1.1] =0x7D959E28
        pgs[1.2] =0x87F8C21A
		pgs[10] = "shape.wdf"
	elseif pg == "蛇形月_舞天姬_普通" then
		pgs[1] = 3668441645
		pgs[2] = 3668441645
		pgs[3] = 1423059990
		pgs[4] = 9780356
		pgs[6] = 2142449311
		pgs[7] = 2142449311
		pgs[8] = 4149929342
		pgs[9] = 712091462
		pgs[10] = "shape.wdf"
	elseif pg == "钢结鞭_英女侠_普通" then
		pgs[1] = 271263789
		pgs[2] = 271263789
		pgs[3] = 1861510591
		pgs[4] = 1546457330
		pgs[6] = 2479743000
		pgs[7] = 95594363
		pgs[8] = 2418442398
		pgs[9] = 1501213311
		pgs[10] = "shape.wdf"
	elseif pg == "牛皮鞭_狐美人_普通" then
		pgs[1] = 803587567
		pgs[2] = 803587567
		pgs[3] = 2928593272
		pgs[4] = 3180100501
		pgs[6] = 3201126946
		pgs[7] = 3347553641
		pgs[8] = 435101418
		pgs[9] = 2721039077
		pgs[10] = "shape.wdf"
	elseif pg == "青铜斧_巨魔王_普通" then
		pgs[1] = 182516681
		pgs[2] = 182516681
		pgs[3] = 433361276
		pgs[4] = 3396040890
		pgs[6] = 3108223122
		pgs[7] = 1776525498
		pgs[8] = 3618533458
		pgs[9] = 2670573290
		pgs[10] = "shape.wdf"
	elseif pg == "点金棒_玄彩娥_普通" then
		pgs[1] = 321961419
		pgs[2] = 321961419
		pgs[3] = 1825339978
		pgs[4] = 2854164977
		pgs[6] = 1309940385
		pgs[7] = 3400892076
		pgs[8] = 3042819558
		pgs[9] = 499124570
		pgs[10] = "shape.wdf"
	elseif pg == "剑侠客_刀" then
		pgs[1] = 3074477781
		pgs[2] = 3074477781
		pgs[3] = 991657694
		pgs[4] = 2583942498
		pgs[6] = 1121741199
		pgs[7] = 701848281
		pgs[8] = 621175708
		pgs[9] = 2285822938
		pgs[1.1] =0x60E4C3FA
        pgs[1.2] =0x1C55C59F
		pgs[10] = "shape.wdf"
	elseif pg == "细木棒_玄彩娥_普通" then
		pgs[1] = 2705175188
		pgs[2] = 2705175188
		pgs[3] = 4202680960
		pgs[4] = 3228448399
		pgs[6] = 436522649
		pgs[7] = 2039230457
		pgs[8] = 1506278188
		pgs[9] = 375356336
		pgs[10] = "shape.wdf"
	elseif pg == "剑侠客_剑" then
		pgs[1] = 2840575336
		pgs[2] = 2840575336
		pgs[3] = 991657694
		pgs[4] = 3738000150
		pgs[6] = 2626634241
		pgs[7] = 1486978342
		pgs[8] = 512918654
		pgs[9] = 361988011
		pgs[1.1] =0x6C1E5A4A
        pgs[1.2] =0xDD3B0296
		pgs[10] = "shape.wdf"
	elseif pg == "玄彩娥_飘带" then
		pgs[1] = 4201959108
		pgs[2] = 4201959108
		pgs[3] = 3290427143
		pgs[4] = 728904944
		pgs[6] = 2291528828
		pgs[7] = 1617545683
		pgs[8] = 339045070
		pgs[9] = 2545689750
		pgs[1.1] =0x3CD82541
        pgs[1.2] =0x60D01153
		pgs[10] = "shape.wdf"
	elseif pg == "震天锤_神天兵_普通" then
		pgs[1] = 3035485426
		pgs[2] = 3035485426
		pgs[3] = 1437571424
		pgs[4] = 3129123356
		pgs[6] = 3250445538
		pgs[7] = 4112972849
		pgs[8] = 4145837202
		pgs[9] = 4145837202
		pgs[10] = "shape.wdf"
	elseif pg == "青锋剑_逍遥生_普通" then
		pgs[1] = 2028105319
		pgs[2] = 2028105319
		pgs[3] = 3791928171
		pgs[4] = 2088494889
		pgs[6] = 91578554
		pgs[7] = 518706841
		pgs[8] = 3909235980
		pgs[9] = 526326278
		pgs[10] = "shape.wdf"
	elseif pg == "青龙牙_狐美人_普通" then
		pgs[1] = 3328063850
		pgs[2] = 3328063850
		pgs[3] = 3138195936
		pgs[4] = 1207144244
		pgs[6] = 620017539
		pgs[7] = 1100137434
		pgs[8] = 957732521
		pgs[9] = 702824336
		pgs[10] = "shape.wdf"
	elseif pg == "神天兵_普通" then
		pgs[1] = 3139413485
		pgs[2] = 3139413485
		pgs[3] = 3251213113
		pgs[4] = 1857394109
		pgs[6] = 1539170847
		pgs[7] = 1525915374
		pgs[8] = 2489545420
		pgs[9] = 2207457325
		pgs[10] = "shape.wdf"
	elseif pg == "八卦_神天兵_普通" then
		pgs[1] = 0x94265799
		pgs[2] = 0x94265799
		pgs[3] = 0x35A8F0B2
		pgs[4] = 0xF721C3A5
		pgs[6] = 0x82407177
		pgs[7] = 0x14046CB9
		pgs[8] = 0x793550FC
		pgs[9] = 0x66D1B6C4
		pgs[10] = "shape.wdf"
	elseif pg == "八卦_虎头怪_普通" then
		pgs[1] = 0xBE38AE31
		pgs[2] = 0xBE38AE31
		pgs[3] = 0x39793BD1
		pgs[4] = 0x1A309122
		pgs[6] = 0x98779F86
		pgs[7] = 0x359A5C9F
		pgs[8] = 0x6BE1D5E3
		pgs[9] = 0x4E17B675
		pgs[10] = "shape.wdf"
	elseif pg == "神天兵_锤" then
		pgs[1] = 1465303491
		pgs[2] = 1465303491
		pgs[3] = 1649555822
		pgs[4] = 2910864082
		pgs[6] = 3107944047
		pgs[7] = 2714401860
		pgs[8] = 2489545420
		pgs[9] = 2796680623
		pgs[1.1] =0x4E65CD50-- C7B92924
        pgs[1.2] =0x3C1EC801-- 5A51CA67
		pgs[10] = "shape.wdf"
	elseif pg == "松木锤_虎头怪_普通" then
		pgs[1] = 3954765830
		pgs[2] = 3954765830
		pgs[3] = 1463806219
		pgs[4] = 4224177154
		pgs[6] = 78625091
		pgs[7] = 2652829739
		pgs[8] = 2214494438
		pgs[9] = 1060924399
		pgs[10] = "shape.wdf"
	elseif pg == "骨精灵_普通" then
		pgs[1] = 3043670818
		pgs[2] = 3043670818
		pgs[3] = 3644222844
		pgs[4] = 2656336023
		pgs[6] = 4229617854
		pgs[7] = 3601844930
		pgs[8] = 2956176231
		pgs[9] = 4259873334
		pgs[10] = "shape.wdf"
	elseif pg == "骨精灵_魔棒" then
		pgs[1] = 2452516043
		pgs[2] = 2452516043
		pgs[3] = 1899323518
		pgs[4] = 3477875588
		pgs[6] = 1063711236
		pgs[7] = 3657445131
		pgs[8] = 2024668974
		pgs[9] = 3508788176
		pgs[10] = "shape.wdf"
	elseif pg == "曲柳杖_羽灵神_普通" then
		pgs[1] = 177392781
		pgs[2] = 177392781
		pgs[3] = 126506799
		pgs[4] = 2086224634
		pgs[6] = 2070674478
		pgs[7] = 2841942625
		pgs[8] = 1310664391
		pgs[9] = 945248214
		pgs[10] = "shape.wdf"
	elseif pg == "铁面扇_逍遥生_普通" then
		pgs[1] = 265930064
		pgs[2] = 265930064
		pgs[3] = 1315781189
		pgs[4] = 851934430
		pgs[6] = 3398365059
		pgs[7] = 1327574185
		pgs[8] = 3720853183
		pgs[9] = 2140890725
		pgs[10] = "shape.wdf"
	elseif pg == "舞天姬_环圈" then
		pgs[1] = 4193428466
		pgs[2] = 4193428466
		pgs[3] = 3043244041
		pgs[4] = 2814262767
		pgs[6] = 4189229797
		pgs[7] = 3277294463
		pgs[8] = 3942685609
		pgs[9] = 610824997
		pgs[10] = "shape.wdf"
	elseif pg == "神火扇_逍遥生_普通" then
		pgs[1] = 809466984
		pgs[2] = 809466984
		pgs[3] = 3900102624
		pgs[4] = 1484450534
		pgs[6] = 1946292417
		pgs[7] = 2773394627
		pgs[8] = 3033319609
		pgs[9] = 815459690
		pgs[10] = "shape.wdf"
	elseif pg == "铁爪_狐美人_普通" then
		pgs[1] = 1341071015
		pgs[2] = 1341071015
		pgs[3] = 2333330309
		pgs[4] = 2453642175
		pgs[6] = 1760107365
		pgs[7] = 4127315635
		pgs[8] = 2476805398
		pgs[9] = 2928915082
		pgs[10] = "shape.wdf"
	elseif pg == "满天星_骨精灵_普通" then
		pgs[1] = 3437083756
		pgs[2] = 3437083756
		pgs[3] = 2306843235
		pgs[4] = 1714484126
		pgs[6] = 373133398
		pgs[7] = 3805394703
		pgs[8] = 1606121584
		pgs[9] = 1531375263
		pgs[10] = "shape.wdf"
	elseif pg == "游龙剑_逍遥生_普通" then
		pgs[1] = 2298557178
		pgs[2] = 2298557178
		pgs[3] = 923259950
		pgs[4] = 145374235
		pgs[6] = 4267993677
		pgs[7] = 3641474775
		pgs[8] = 345371692
		pgs[9] = 551366747
		pgs[10] = "shape.wdf"
	elseif pg == "巫蛮儿_普通" then
		pgs[1] = 2404345852
		pgs[2] = 2404345852
		pgs[3] = 857427883
		pgs[4] = 3299007490
		pgs[6] = 3847342356
		pgs[7] = 2219256477
		pgs[8] = 3377965731
		pgs[9] = 1458812347
		pgs[10] = "shape.wdf"
	elseif pg == "红缨枪_神天兵_普通" then
		pgs[1] = 3072500196
		pgs[2] = 3072500196
		pgs[3] = 1936650700
		pgs[4] = 522874091
		pgs[6] = 72270422
		pgs[7] = 2966336322
		pgs[8] = 117062963
		pgs[9] = 3637390492
		pgs[10] = "shape.wdf"
	elseif pg == "铁面扇_龙太子_普通" then
		pgs[1] = 1892693347
		pgs[2] = 1892693347
		pgs[3] = 3257923907
		pgs[4] = 1204995981
		pgs[6] = 1362359639
		pgs[7] = 2228831626
		pgs[8] = 3633790550
		pgs[9] = 80506382
		pgs[10] = "shape.wdf"
	elseif pg == "狐美人_鞭" then
		pgs[1] = 1138804365
		pgs[2] = 1138804365
		pgs[3] = 247333098
		pgs[4] = 303785981
		pgs[6] = 1734212905
		pgs[7] = 3749438
		pgs[8] = 4126393258
		pgs[9] = 3502426669
		pgs[10] = "shape.wdf"
	elseif pg == "乌金鬼头镰_虎头怪_普通" then
		pgs[1] = 3466710001
		pgs[2] = 3466710001
		pgs[3] = 2029741881
		pgs[4] = 3433763427
		pgs[6] = 752010966
		pgs[7] = 2871143747
		pgs[8] = 1261420343
		pgs[9] = 2046811187
		pgs[10] = "shape.wdf"
	elseif pg == "神天兵_枪矛" then
		pgs[1] = 3139413485
		pgs[2] = 3139413485
		pgs[3] = 3251213113
		pgs[4] = 1857394109
		pgs[6] = 1539170847
		pgs[7] = 1525915374
		pgs[8] = 2489545420
		pgs[9] = 2207457325
        pgs[1.1] =0x36284398
        pgs[1.2] =0x32170257
		pgs[10] = "shape.wdf"
	elseif pg == "震天锤_虎头怪_普通" then
		pgs[1] = 910543157
		pgs[2] = 910543157
		pgs[3] = 396098490
		pgs[4] = 51606250
		pgs[6] = 647794191
		pgs[7] = 1034863730
		pgs[8] = 34149923
		pgs[9] = 2195214010
		pgs[10] = "shape.wdf"
	elseif pg == "七彩罗刹_舞天姬_普通" then
		pgs[1] = 1449553165
		pgs[2] = 1449553165
		pgs[3] = 2145124847
		pgs[4] = 4157162296
		pgs[6] = 1859257571
		pgs[7] = 2698141768
		pgs[8] = 2971905394
		pgs[9] = 2020209393
		pgs[10] = "shape.wdf"
	elseif pg == "松木锤_神天兵_普通" then
		pgs[1] = 4014115127
		pgs[2] = 4014115127
		pgs[3] = 433361276
		pgs[4] = 2686623681
		pgs[6] = 316202605
		pgs[7] = 776522968
		pgs[8] = 400987167
		pgs[9] = 3257370843
		pgs[10] = "shape.wdf"
	elseif pg == "杀破狼_弓弩" then
		pgs[1] = 2232599242
		pgs[2] = 2232599242
		pgs[3] = 3215162495
		pgs[4] = 3629275056
		pgs[6] = 4241012400
		pgs[7] = 3547444917
		pgs[8] = 1721194312
		pgs[9] = 3836921096
		pgs[10] = "shape.wdf"
	elseif pg == "杀破狼_弓弩1" then
		pgs[1] = 3555676410
		pgs[2] = 3555676410
		pgs[3] = 3215162495
		pgs[4] = 3629275056
		pgs[6] = 0167917977
		pgs[7] = 2697172445
		pgs[8] = 1721194312
		pgs[9] = 3836921096
		pgs[10] = "shape.wdf"
	elseif pg == "曲柳杖_巫蛮儿_普通" then
		pgs[1] = 3570910020
		pgs[2] = 3570910020
		pgs[3] = 923276916
		pgs[4] = 1683281266
		pgs[6] = 3312479705
		pgs[7] = 429861263
		pgs[8] = 3316485994
		pgs[9] = 1090261872
		pgs[10] = "shape.wdf"
	elseif pg == "虎头怪_普通" then
		pgs[1] = 3188334211
		pgs[2] = 3188334211
		pgs[3] = 3845828864
		pgs[4] = 3951179215
		pgs[6] = 1705376638
		pgs[7] = 659922551
		pgs[8] = 2089007572
		pgs[9] = 4274012337
		pgs[10] = "shape.wdf"
	-- v1.3
	-- 武器新增
	elseif pg == "飞龙在天_神天兵_普通" then
		pgs[1] = 2032927311
		pgs[2] = 2032927311
		pgs[3] = 1657151508
		pgs[4] = 3978455792
		pgs[6] = 1874013939
		pgs[7] = 3740325538
		pgs[8] = 2181635146
		pgs[9] = 599728780
		pgs[10] = "shape.wdf"
	elseif pg == "天龙破城_神天兵_普通" then
		pgs[1] = 0171966452
		pgs[2] = 0171966452
		pgs[3] = 2084794125
		pgs[4] = 2107979991
		pgs[6] = 1581914867
		pgs[7] = 2942548432
		pgs[8] = 1411813089
		pgs[9] = 1849607449
		pgs[10] = "shape.dll"
	elseif pg == "弑皇_神天兵_普通" then
		pgs[1] = 1997962163
		pgs[2] = 1997962163
		pgs[3] = 0736116348
		pgs[4] = 1627526221
		pgs[6] = 0244362789
		pgs[7] = 0451837867
		pgs[8] = 3255465889
		pgs[9] = 1104681624
		pgs[10] = "shape.dll"
	elseif pg == "肃魂_虎头怪_普通" then
		pgs[1] = 3347502793
		pgs[2] = 3347502793
		pgs[3] = 3860676924
		pgs[4] = 118700546
		pgs[6] = 2438511946
		pgs[7] = 654574910
		pgs[8] = 2443863215
		pgs[9] = 3044188142
		pgs[10] = "shape.wdf"
	elseif pg == "无敌_虎头怪_普通" then
		pgs[1] = 3570280462
		pgs[2] = 3570280462
		pgs[3] = 4153716432
		pgs[4] = 4066794943
		pgs[6] = 2962716394
		pgs[7] = 2728193647
		pgs[8] = 1018712733
		pgs[9] = 3542032877
		pgs[10] = "shape.wdf"
	elseif pg == "雪蚕之刺_骨精灵_普通" then
		pgs[1] = 463147476
		pgs[2] = 463147476
		pgs[3] = 156477563
		pgs[4] = 2554614685
		pgs[6] = 1016195647
		pgs[7] = 1685978750
		pgs[8] = 882510520
		pgs[9] = 3100053953
		pgs[10] = "shape.wdf"
	elseif pg == "雷神_虎头怪_普通" then
		pgs[1] = 3666407377
		pgs[2] = 3666407377
		pgs[3] = 465270733
		pgs[4] = 2173835439
		pgs[6] = 1254874348
		pgs[7] = 2506000487
		pgs[8] = 3727411622
		pgs[9] = 2103867801
		pgs[10] = "shape.wdf"
	elseif pg == "灵蛇_英女侠_普通" then
		pgs[1] = 3036397933
		pgs[2] = 3036397933
		pgs[3] = 109615900
		pgs[4] = 2747926100
		pgs[6] = 2286194550
		pgs[7] = 2559098069
		pgs[8] = 227111990
		pgs[9] = 2520581903
		pgs[10] = "shape.wdf"
	elseif pg == "冥火薄天_羽灵神_普通" then
		pgs[1] = 2410653859
		pgs[2] = 2410653859
		pgs[3] = 412668278
		pgs[4] = 411982136
		pgs[6] = 2414080025
		pgs[7] = 3270399877
		pgs[8] = 1113080394
		pgs[9] = 2526125934
		pgs[10] = "shape.wdf"
	elseif pg == "晓风残月_巨魔王_普通" then
		pgs[1] = 684541206
		pgs[2] = 684541206
		pgs[3] = 575760044
		pgs[4] = 2922449802
		pgs[6] = 578321277
		pgs[7] = 1145919811
		pgs[8] = 1959824975
		pgs[9] = 2531067724
		pgs[10] = "shape.wdf"
	elseif pg == "斩妖泣血_剑侠客_普通" then
		pgs[1] = 3366877163
		pgs[2] = 3366877163
		pgs[3] = 2527757700
		pgs[4] = 423606103
		pgs[6] = 2965089172
		pgs[7] = 3694647351
		pgs[8] = 223797192
		pgs[9] = 902186530
		pgs[10] = "shape.wdf"
	elseif pg == "业火三灾_剑侠客_普通" then
		pgs[1] = 0210215203
		pgs[2] = 0210215203
		pgs[3] = 0742329354
		pgs[4] = 4144128188
		pgs[6] = 3922982597
		pgs[7] = 3358965260
		pgs[8] = 2322529890
		pgs[9] = 2370381803
		pgs[10] = "shape.dll"
	elseif pg == "鸣鸿_剑侠客_普通" then
		pgs[1] = 1301462828
		pgs[2] = 1301462828
		pgs[3] = 0874331809
		pgs[4] = 1002416013
		pgs[6] = 0119572952
		pgs[7] = 2800523884
		pgs[8] = 4144463970
		pgs[9] = 3391554113
		pgs[10] = "shape.dll"
	elseif pg == "九瓣莲花_虎头怪_普通" then
		pgs[1] = 4211862022
		pgs[2] = 4211862022
		pgs[3] = 3700497436
		pgs[4] = 2579634951
		pgs[6] = 3976648204
		pgs[7] = 2765994764
		pgs[8] = 3401808842
		pgs[9] = 4094340569
		pgs[10] = "shape.wdf"
	elseif pg == "暗夜_龙太子_普通" then
		pgs[1] = 741288949
		pgs[2] = 741288949
		pgs[3] = 1972123841
		pgs[4] = 2182082171
		pgs[6] = 4066915831
		pgs[7] = 1492298468
		pgs[8] = 3678212997
		pgs[9] = 1751076384
		pgs[10] = "shape.wdf"
	elseif pg == "祖龙对剑_飞燕女_普通" then
		pgs[1] = 985733706
		pgs[2] = 985733706
		pgs[3] = 3613383230
		pgs[4] = 1544369507
		pgs[6] = 3553066663
		pgs[7] = 4238979964
		pgs[8] = 2190872843
		pgs[9] = 2053572839
		pgs[10] = "shape.wdf"
	elseif pg == "紫电青霜_飞燕女_普通" then
		pgs[1] = 1709377296
		pgs[2] = 1709377296
		pgs[3] = 0883367126
		pgs[4] = 2079837773
		pgs[6] = 2835812814
		pgs[7] = 1289475462
		pgs[8] = 1892940716
		pgs[9] = 1899538113
		pgs[10] = "shape.dll"
	elseif pg == "浮犀_飞燕女_普通" then
		pgs[1] = 1474639442
		pgs[2] = 1474639442
		pgs[3] = 3471018206
		pgs[4] = 2084990754
		pgs[6] = 2071526304
		pgs[7] = 1695237386
		pgs[8] = 2750824335
		pgs[9] = 0969736831
		pgs[10] = "shape.dll"
	elseif pg == "秋水人家_龙太子_普通" then
		pgs[1] = 3391613661
		pgs[2] = 3391613661
		pgs[3] = 1065383079
		pgs[4] = 2120876772
		pgs[6] = 2647082872
		pgs[7] = 1201013296
		pgs[8] = 1941233906
		pgs[9] = 817870297
		pgs[10] = "shape.wdf"
	elseif pg == "红莲_玄彩娥_普通" then
		pgs[1] = 3643377339
		pgs[2] = 3643377339
		pgs[3] = 476128501
		pgs[4] = 3322875805
		pgs[6] = 1450950143
		pgs[7] = 1405056236
		pgs[8] = 477554400
		pgs[9] = 1296371001
		pgs[10] = "shape.wdf"
	elseif pg == "裂云啸日_杀破狼_普通" then
		pgs[1] = 1323042371
		pgs[2] = 1323042371
		pgs[3] = 2471306192
		pgs[4] = 2206427343
		pgs[6] = 3359417010
		pgs[7] = 3912741797
		pgs[8] = 753797811
		pgs[9] = 656525376
		pgs[10] = "shape.wdf"
	elseif pg == "云雷万里_杀破狼_普通" then
		pgs[1] = 0929693147
		pgs[2] = 0929693147
		pgs[3] = 2339783982
		pgs[4] = 2673184399
		pgs[6] = 1053032888
		pgs[7] = 1343023772
		pgs[8] = 1593490105
		pgs[9] = 0305349853
		pgs[10] = "shape.wdf"
	elseif pg == "赤明_杀破狼_普通" then
		pgs[1] = 0454754499
		pgs[2] = 0454754499
		pgs[3] = 4014535055
		pgs[4] = 1847890126
		pgs[6] = 0039518222
		pgs[7] = 2065247607
		pgs[8] = 1441775582
		pgs[9] = 0138471714
		pgs[10] = "shape.wdf"
	elseif pg == "元神禁锢_巨魔王_普通" then
		pgs[1] = 1611966521
		pgs[2] = 1611966521
		pgs[3] = 2319213890
		pgs[4] = 3825599050
		pgs[6] = 2980430167
		pgs[7] = 2239466708
		pgs[8] = 1421663600
		pgs[9] = 2749153529
		pgs[10] = "shape.wdf"
	elseif pg == "胭脂_狐美人_普通" then
		pgs[1] = 435255964
		pgs[2] = 435255964
		pgs[3] = 2314371856
		pgs[4] = 3864765510
		pgs[6] = 505158205
		pgs[7] = 1747354624
		pgs[8] = 1199574166
		pgs[9] = 954931940
		pgs[10] = "shape.wdf"
	elseif pg == "刑天之逆_龙太子_普通" then
		pgs[1] = 1200609263
		pgs[2] = 1200609263
		pgs[3] = 2005252098
		pgs[4] = 3509150743
		pgs[6] = 3445110785
		pgs[7] = 951231487
		pgs[8] = 220558504
		pgs[9] = 4062233204
		pgs[10] = "shape.wdf"
	elseif pg == "霹雳_龙太子_普通" then
		pgs[1] = 278992607
		pgs[2] = 278992607
		pgs[3] = 1512127783
		pgs[4] = 3642679990
		pgs[6] = 1313071015
		pgs[7] = 3971560979
		pgs[8] = 2173299537
		pgs[9] = 4060439247
		pgs[10] = "shape.wdf"
	elseif pg == "沧海_玄彩娥_普通" then
		pgs[1] = 3065680078
		pgs[2] = 3065680078
		pgs[3] = 504261236
		pgs[4] = 60075072
		pgs[6] = 3170504444
		pgs[7] = 3448269542
		pgs[8] = 1357669355
		pgs[9] = 3608953515
		pgs[10] = "shape.wdf"
	elseif pg == "贵霜之牙_狐美人_普通" then
		pgs[1] = 2026448705
		pgs[2] = 2026448705
		pgs[3] = 741309234
		pgs[4] = 3203975285
		pgs[6] = 1564840489
		pgs[7] = 474679658
		pgs[8] = 4058539230
		pgs[9] = 926627376
		pgs[10] = "shape.wdf"
	elseif pg == "忘川三途_狐美人_普通" then
		pgs[1] = 0236232349
		pgs[2] = 0236232349
		pgs[3] = 1075219754
		pgs[4] = 1037429893
		pgs[6] = 2989801805
		pgs[7] = 1339124563
		pgs[8] = 3926929253
		pgs[9] = 3874185526
		pgs[10] = "shape.dll"
	elseif pg == "离钩_狐美人_普通" then
		pgs[1] = 0564401744
		pgs[2] = 0564401744
		pgs[3] = 1267356954
		pgs[4] = 2021299893
		pgs[6] = 3148444658
		pgs[7] = 3954561085
		pgs[8] = 4230441971
		pgs[9] = 1335188315
		pgs[10] = "shape.dll"
	elseif pg == "护法灭魔_巨魔王_普通" then
		pgs[1] = 1083493637
		pgs[2] = 1083493637
		pgs[3] = 812737125
		pgs[4] = 2551291495
		pgs[6] = 4082536262
		pgs[7] = 2847560160
		pgs[8] = 1955001763
		pgs[9] = 4262995164
		pgs[10] = "shape.wdf"
	elseif pg == "碧血干戚_巨魔王_普通" then
		pgs[1] = 0325617872
		pgs[2] = 0325617872
		pgs[3] = 2652356421
		pgs[4] = 1634024596
		pgs[6] = 2566297187
		pgs[7] = 1516430527
		pgs[8] = 1859893291
		pgs[9] = 1309789755
		pgs[10] = "shape.dll"
	elseif pg == "裂天_巨魔王_普通" then
		pgs[1] = 3770058550
		pgs[2] = 3770058550
		pgs[3] = 0606207925
		pgs[4] = 4223217027
		pgs[6] = 3564628022
		pgs[7] = 2046633309
		pgs[8] = 2119151502
		pgs[9] = 1758406529
		pgs[10] = "shape.dll"
	elseif pg == "裂云啸日_巫蛮儿_普通" then
		pgs[1] = 1953175087
		pgs[2] = 1953175087
		pgs[3] = 3696783624
		pgs[4] = 2606125215
		pgs[6] = 1758916755
		pgs[7] = 3089221190
		pgs[8] = 147933165
		pgs[9] = 3171772535
		pgs[10] = "shape.wdf"
	elseif pg == "云雷万里_巫蛮儿_普通" then
		pgs[1] = 3496291125
		pgs[2] = 3496291125
		pgs[3] = 1465968075
		pgs[4] = 1397554648
		pgs[6] = 2459508456
		pgs[7] = 2516514287
		pgs[8] = 3589170230
		pgs[9] = 3317700918
		pgs[10] = "shape.wdf"
	elseif pg == "赤明_巫蛮儿_普通" then
		pgs[1] = 0200658060
		pgs[2] = 0200658060
		pgs[3] = 3759594662
		pgs[4] = 3318654178
		pgs[6] = 4035253624
		pgs[7] = 2693415826
		pgs[8] = 2972224698
		pgs[9] = 3906907508
		pgs[10] = "shape.wdf"
	elseif pg == "元神禁锢_虎头怪_普通" then
		pgs[1] = 345884366
		pgs[2] = 345884366
		pgs[3] = 1989535927
		pgs[4] = 3684415104
		pgs[6] = 3779343772
		pgs[7] = 1164144313
		pgs[8] = 2870850177
		pgs[9] = 1485270944
		pgs[10] = "shape.wdf"
	elseif pg == "游龙惊鸿_英女侠_普通" then
		pgs[1] = 1724242915
		pgs[2] = 1724242915
		pgs[3] = 84894305
		pgs[4] = 1910956791
		pgs[6] = 4279024946
		pgs[7] = 4245988549
		pgs[8] = 204351801
		pgs[9] = 3689683150
		pgs[10] = "shape.wdf"
	elseif pg == "鬼王蚀日_神天兵_普通" then
		pgs[1] = 963362133
		pgs[2] = 963362133
		pgs[3] = 152105194
		pgs[4] = 3867741716
		pgs[6] = 1752393650
		pgs[7] = 278748353
		pgs[8] = 1749943111
		pgs[9] = 0xB1EC4BAE
		pgs[10] = "shape.wdf"
	elseif pg == "狂澜碎岳_神天兵_普通" then
		pgs[1] = 2235903565
		pgs[2] = 2235903565
		pgs[3] = 2603636370
		pgs[4] = 2603636370
		pgs[6] = 2176071785
		pgs[7] = 4182805395
		pgs[8] = 0485622618
		pgs[9] = 0725700904
		pgs[10] = "shape.dll"
	elseif pg == "碎寂_神天兵_普通" then
		pgs[1] = 3625830153
		pgs[2] = 3625830153
		pgs[3] = 3568054291
		pgs[4] = 2897242392
		pgs[6] = 2339108953
		pgs[7] = 0520986973
		pgs[8] = 3030332360
		pgs[9] = 1269074276
		pgs[10] = "shape.dll"
	elseif pg == "画龙点睛_龙太子_普通" then
		pgs[1] = 479654062
		pgs[2] = 479654062
		pgs[3] = 2783759891
		pgs[4] = 2828288868
		pgs[6] = 2229841293
		pgs[7] = 235465927
		pgs[8] = 3332787791
		pgs[9] = 1018236421
		pgs[10] = "shape.wdf"
	elseif pg == "紫金葫芦_巫蛮儿_普通" then
		pgs[1] = 2831632905
		pgs[2] = 2831632905
		pgs[3] = 3521304774
		pgs[4] = 3768453514
		pgs[6] = 2981305233
		pgs[7] = 2400756176
		pgs[8] = 1889441810
		pgs[9] = 2164075551
		pgs[10] = "shape.wdf"
	elseif pg == "百花_英女侠旧_普通" then
		pgs[1] = 120
		pgs[2] = 120
		pgs[3] = 128
		pgs[4] = 119
		pgs[6] = 130
		pgs[7] = 121
		pgs[8] = 129
		pgs[9] = 117
		pgs[10] = "shape.wdf"
	elseif pg == "月光双剑_英女侠_普通" then
		pgs[1] = 2739970529
		pgs[2] = 2739970529
		pgs[3] = 1305035055
		pgs[4] = 908717950
		pgs[6] = 1760682539
		pgs[7] = 433987877
		pgs[8] = 2692136956
		pgs[9] = 3445935850
		pgs[10] = "shape.wdf"
	elseif pg == "血刃_巨魔王_普通" then
		pgs[1] = 1939335498
		pgs[2] = 1939335498
		pgs[3] = 877636726
		pgs[4] = 916167152
		pgs[6] = 867523001
		pgs[7] = 3564043256
		pgs[8] = 776791724
		pgs[9] = 1515674466
		pgs[10] = "shape.wdf"
	elseif pg == "此最相思_舞天姬_普通" then
		pgs[1] = 1976958564
		pgs[2] = 1976958564
		pgs[3] = 3060982721
		pgs[4] = 3902626006
		pgs[6] = 1239150663
		pgs[7] = 1817978990
		pgs[8] = 3578667390
		pgs[9] = 2374794875
		pgs[10] = "shape.wdf"
	elseif pg == "揽月摘星_舞天姬_普通" then
		pgs[1] = 3095847005
		pgs[2] = 3095847005
		pgs[3] = 0328405538
		pgs[4] = 2694329428
		pgs[6] = 4179340991
		pgs[7] = 2099180209
		pgs[8] = 0795965688
		pgs[9] = 1691850913
		pgs[10] = "shape.dll"
	elseif pg == "九霄_舞天姬_普通" then
		pgs[1] = 1709199725
		pgs[2] = 1709199725
		pgs[3] = 4183907044
		pgs[4] = 0940501812
		pgs[6] = 1332030559
		pgs[7] = 3784736116
		pgs[8] = 1618775589
		pgs[9] = 0895130345
		pgs[10] = "shape.dll"
	elseif pg == "龙鸣寒水_杀破狼_普通" then
		pgs[1] = 2135796424
		pgs[2] = 2135796424
		pgs[3] = 4117872420
		pgs[4] = 4105996895
		pgs[6] = 2127507146
		pgs[7] = 4261464327
		pgs[8] = 1514939238
		pgs[9] = 748425136
		pgs[10] = "shape.wdf"
	elseif pg == "暗夜_神天兵_普通" then
		pgs[1] = 1082922820
		pgs[2] = 1082922820
		pgs[3] = 975258259
		pgs[4] = 3895199857
		pgs[6] = 1619820242
		pgs[7] = 3383885620
		pgs[8] = 336694600
		pgs[9] = 932923894
		pgs[10] = "shape.wdf"
	elseif pg == "屠龙_巨魔王_普通" then
		pgs[1] = 1484416784
		pgs[2] = 1484416784
		pgs[3] = 1775621951
		pgs[4] = 1549828750
		pgs[6] = 3154364234
		pgs[7] = 993921470
		pgs[8] = 2220195117
		pgs[9] = 2747950696
		pgs[10] = "shape.wdf"
	elseif pg == "离火_巫蛮儿_普通" then
		pgs[1] = 593251101
		pgs[2] = 593251101
		pgs[3] = 1674828781
		pgs[4] = 83754672
		pgs[6] = 3337153292
		pgs[7] = 341330281
		pgs[8] = 662302587
		pgs[9] = 1380161976
		pgs[10] = "shape.wdf"
	elseif pg == "魏武青虹_剑侠客_普通" then
		pgs[1] = 3545119585
		pgs[2] = 3545119585
		pgs[3] = 157523664
		pgs[4] = 1783491444
		pgs[6] = 1488281366
		pgs[7] = 2951999449
		pgs[8] = 1776089940
		pgs[9] = 599864712
		pgs[10] = "shape.wdf"
	elseif pg == "百花_狐美人_普通" then
		pgs[1] = 1502748093
		pgs[2] = 1502748093
		pgs[3] = 2250675787
		pgs[4] = 2755073465
		pgs[6] = 1990532858
		pgs[7] = 1787167953
		pgs[8] = 3161043606
		pgs[9] = 546759080
		pgs[10] = "shape.wdf"
	elseif pg == "撕天_骨精灵_普通" then
		pgs[1] = 1763722445
		pgs[2] = 1763722445
		pgs[3] = 933726342
		pgs[4] = 974601076
		pgs[6] = 311571350
		pgs[7] = 482224323
		pgs[8] = 1316921786
		pgs[9] = 3581381656
		pgs[10] = "shape.wdf"
	elseif pg == "玉龙_逍遥生_普通" then
		pgs[1] = 291599680
		pgs[2] = 291599680
		pgs[3] = 715603823
		pgs[4] = 1026330223
		pgs[6] = 3159923026
		pgs[7] = 2920506479
		pgs[8] = 2112187507
		pgs[9] = 3163375922
		pgs[10] = "shape.wdf"
	elseif pg == "红莲_骨精灵_普通" then
		pgs[1] = 3424827150
		pgs[2] = 3424827150
		pgs[3] = 934671466
		pgs[4] = 1076423299
		pgs[6] = 3574472708
		pgs[7] = 2280284843
		pgs[8] = 506056336
		pgs[9] = 2313738142
		pgs[10] = "shape.wdf"
	elseif pg == "彩虹_舞天姬_普通" then
		pgs[1] = 3921702263
		pgs[2] = 3921702263
		pgs[3] = 3711439731
		pgs[4] = 261592524
		pgs[6] = 3826935762
		pgs[7] = 1461988918
		pgs[8] = 658865406
		pgs[9] = 2510075859
		pgs[10] = "shape.wdf"
	elseif pg == "魏武青虹_逍遥生_普通" then
		pgs[1] = 2954647770
		pgs[2] = 2954647770
		pgs[3] = 1287899115
		pgs[4] = 3269954632
		pgs[6] = 2567725998
		pgs[7] = 2862658372
		pgs[8] = 4023660358
		pgs[9] = 1267402087
		pgs[10] = "shape.wdf"
	elseif pg == "雪蟒霜寒_巫蛮儿_普通" then
		pgs[1] = 739148944
		pgs[2] = 739148944
		pgs[3] = 1573479582
		pgs[4] = 1491739579
		pgs[6] = 851932811
		pgs[7] = 3605348497
		pgs[8] = 1658854000
		pgs[9] = 759781703
		pgs[10] = "shape.wdf"
	elseif pg == "碧海潮生_巫蛮儿_普通" then
		pgs[1] = 3910342400
		pgs[2] = 3910342400
		pgs[3] = 0733894543
		pgs[4] = 1050839754
		pgs[6] = 3505371915
		pgs[7] = 1647388270
		pgs[8] = 1832777753
		pgs[9] = 0844025414
		pgs[10] = "shape.wdf"
	elseif pg == "弦月_巫蛮儿_普通" then
		pgs[1] = 3736877850
		pgs[2] = 3736877850
		pgs[3] = 3588393432
		pgs[4] = 2220097459
		pgs[6] = 0280199730
		pgs[7] = 3405371659
		pgs[8] = 2586240981
		pgs[9] = 0420838884
		pgs[10] = "shape.wdf"
	elseif pg == "血刃_剑侠客_普通" then
		pgs[1] = 3942369185
		pgs[2] = 3942369185
		pgs[3] = 2744623122
		pgs[4] = 3558966261
		pgs[6] = 2535946630
		pgs[7] = 1477301268
		pgs[8] = 658806952
		pgs[9] = 3254342488
		pgs[10] = "shape.wdf"
	elseif pg == "碧波_玄彩娥_普通" then
		pgs[1] = 970441283
		pgs[2] = 970441283
		pgs[3] = 1029717118
		pgs[4] = 1436245505
		pgs[6] = 3228799230
		pgs[7] = 3957482085
		pgs[8] = 1916346891
		pgs[9] = 1521611307
		pgs[10] = "shape.wdf"
	elseif pg == "飞星_巫蛮儿_普通" then
		pgs[1] = 902532881
		pgs[2] = 902532881
		pgs[3] = 1311875894
		pgs[4] = 1263683269
		pgs[6] = 4006180572
		pgs[7] = 941967075
		pgs[8] = 1752683572
		pgs[9] = 173425117
		pgs[10] = "shape.wdf"
	elseif pg == "回风舞雪_巫蛮儿_普通" then
		pgs[1] = 1226070803
		pgs[2] = 1226070803
		pgs[3] = 3590109632
		pgs[4] = 3593543610
		pgs[6] = 3882426852
		pgs[7] = 136839080
		pgs[8] = 1265716525
		pgs[9] = 126040992
		pgs[10] = "shape.wdf"
	elseif pg == "五虎断魂_龙太子_普通" then
		pgs[1] = 1272648373
		pgs[2] = 1272648373
		pgs[3] = 1067074679
		pgs[4] = 1592032597
		pgs[6] = 2132267301
		pgs[7] = 4089962192
		pgs[8] = 1673526656
		pgs[9] = 2635610460
		pgs[10] = "shape.wdf"
	elseif pg == "祖龙对剑_英女侠_普通" then
		pgs[1] = 371522347
		pgs[2] = 371522347
		pgs[3] = 1072281713
		pgs[4] = 3068921098
		pgs[6] = 3389582086
		pgs[7] = 388288592
		pgs[8] = 640740376
		pgs[9] = 3752665492
		pgs[10] = "shape.wdf"
	elseif pg == "紫电青霜_英女侠_普通" then
		pgs[1] = 2940261156
		pgs[2] = 2940261156
		pgs[3] = 0883367126
		pgs[4] = 1476632389
		pgs[6] = 2376803038
		pgs[7] = 3092849276
		pgs[8] = 1335963374
		pgs[9] = 3005914168
		pgs[10] = "shape.dll"
	elseif pg == "浮犀_英女侠_普通" then
		pgs[1] = 1239588375
		pgs[2] = 1239588375
		pgs[3] = 0756053968
		pgs[4] = 0821109265
		pgs[6] = 1472865246
		pgs[7] = 2192274301
		pgs[8] = 1990043008
		pgs[9] = 3996927795
		pgs[10] = "shape.dll"

	elseif pg == "盘龙_玄彩娥_普通" then
		pgs[1] = 3068635068
		pgs[2] = 3068635068
		pgs[3] = 959077202
		pgs[4] = 3616804633
		pgs[6] = 2106636810
		pgs[7] = 555283478
		pgs[8] = 2056912982
		pgs[9] = 2481130669
		pgs[10] = "shape.wdf"
	elseif pg == "斩妖泣血_巨魔王_普通" then
		pgs[1] = 1896056556
		pgs[2] = 1896056556
		pgs[3] = 399651097
		pgs[4] = 335656095
		pgs[6] = 4247090300
		pgs[7] = 3557597697
		pgs[8] = 131374191
		pgs[9] = 3408927878
		pgs[10] = "shape.wdf"
	elseif pg == "业火三灾_巨魔王_普通" then
		pgs[1] = 4258129878
		pgs[2] = 4258129878
		pgs[3] = 3927074237
		pgs[4] = 0727738647
		pgs[6] = 0460666887
		pgs[7] = 3086041675
		pgs[8] = 0213811481
		pgs[9] = 2227980701
		pgs[10] = "shape.dll"
	elseif pg == "鸣鸿_巨魔王_普通" then
		pgs[1] = 2725911621
		pgs[2] = 2725911621
		pgs[3] = 1064946168
		pgs[4] = 0641529870
		pgs[6] = 1154664012
		pgs[7] = 2387777949
		pgs[8] = 0310225545
		pgs[9] = 2338581088
		pgs[10] = "shape.dll"
	elseif pg == "梨花_神天兵_普通" then
		pgs[1] = 1046350880
		pgs[2] = 1046350880
		pgs[3] = 3432918521
		pgs[4] = 2634626428
		pgs[6] = 3303390888
		pgs[7] = 1240292677
		pgs[8] = 3708021512
		pgs[9] = 1872876301
		pgs[10] = "shape.wdf"
	elseif pg == "仙人指路_狐美人_普通" then
		pgs[1] = 1169841436
		pgs[2] = 1169841436
		pgs[3] = 851455711
		pgs[4] = 1792787137
		pgs[6] = 1034828303
		pgs[7] = 4038631411
		pgs[8] = 1358665134
		pgs[9] = 657246130
		pgs[10] = "shape.wdf"
	elseif pg == "金玉双环_飞燕女_普通" then
		pgs[1] = 358856899
		pgs[2] = 358856899
		pgs[3] = 1504523359
		pgs[4] = 1837818019
		pgs[6] = 2360002112
		pgs[7] = 1630259287
		pgs[8] = 1285329813
		pgs[9] = 1980919951
		pgs[10] = "shape.wdf"
	elseif pg == "阴阳_英女侠_普通" then
		pgs[1] = 3489122494
		pgs[2] = 3489122494
		pgs[3] = 880749981
		pgs[4] = 4142038041
		pgs[6] = 2678300879
		pgs[7] = 3591452298
		pgs[8] = 351801901
		pgs[9] = 2182164503
		pgs[10] = "shape.wdf"
	elseif pg == "金玉双环_舞天姬_普通" then
		pgs[1] = 3279495962
		pgs[2] = 3279495962
		pgs[3] = 1189482605
		pgs[4] = 2148299765
		pgs[6] = 3630009301
		pgs[7] = 3263066954
		pgs[8] = 3371000519
		pgs[9] = 2240511279
		pgs[10] = "shape.wdf"
	elseif pg == "逍遥江湖_龙太子_普通" then
		pgs[1] = 346935725
		pgs[2] = 346935725
		pgs[3] = 91893473
		pgs[4] = 4293635787
		pgs[6] = 4152040342
		pgs[7] = 3271976691
		pgs[8] = 3980106552
		pgs[9] = 2687029336
		pgs[10] = "shape.wdf"
	elseif pg == "玉龙_龙太子_普通" then
		pgs[1] = 2333774279
		pgs[2] = 2333774279
		pgs[3] = 1147744590
		pgs[4] = 444659320
		pgs[6] = 629954791
		pgs[7] = 263378940
		pgs[8] = 1570393999
		pgs[9] = 862461187
		pgs[10] = "shape.wdf"
	elseif pg == "浩气长舒_龙太子_普通" then
		pgs[1] = 0x2CA2202A
		pgs[2] = 0x2CA2202A
		pgs[3] = 0x46585355
		pgs[4] = 0x322040E
		pgs[6] = 0xEBBBD6A
		pgs[7] = 0xAF198759
		pgs[8] = 0x7B25ED36
		pgs[9] = 0x8D6EBCD
		pgs[10] = "shape.dll"
	elseif pg == "星瀚_龙太子_普通" then
		pgs[1] = 0xF67E30AD
		pgs[2] = 0xF67E30AD
		pgs[3] = 0x36CC7C67
		pgs[4] = 0xA7FAAB06
		pgs[6] = 0x67BC1005
		pgs[7] = 0x9FE029BF
		pgs[8] = 0x8B72FF9
		pgs[9] = 0xBF00ABF2
		pgs[10] = "shape.dll"
	elseif pg == "墨玉骷髅_骨精灵_普通" then
		pgs[1] = 577830528
		pgs[2] = 577830528
		pgs[3] = 3266821735
		pgs[4] = 1068099312
		pgs[6] = 4070992100
		pgs[7] = 977905309
		pgs[8] = 2508349179
		pgs[9] = 100402035
		pgs[10] = "shape.wdf"
	elseif pg == "丝萝乔木_骨精灵_普通" then
		pgs[1] = 0901353063
		pgs[2] = 0901353063
		pgs[3] = 2063487357
		pgs[4] = 0147143279
		pgs[6] = 2653363272
		pgs[7] = 1155369624
		pgs[8] = 1510947809
		pgs[9] = 3973054279
		pgs[10] = "shape.dll"
	elseif pg == "醍醐_骨精灵_普通" then
		pgs[1] = 1250633387
		pgs[2] = 1250633387
		pgs[3] = 2381723311
		pgs[4] = 1282610978
		pgs[6] = 0138367003
		pgs[7] = 1160534304
		pgs[8] = 3907592293
		pgs[9] = 0808638054
		pgs[10] = "shape.dll"
	elseif pg == "别情离恨_飞燕女_普通" then
		pgs[1] = 2294614510
		pgs[2] = 2294614510
		pgs[3] = 1412079494
		pgs[4] = 1646305352
		pgs[6] = 2256502232
		pgs[7] = 104447335
		pgs[8] = 471741487
		pgs[9] = 1039274121
		pgs[10] = "shape.wdf"
	elseif pg == "雪蟒霜寒_羽灵神_普通" then
		pgs[1] = 2930005782
		pgs[2] = 2930005782
		pgs[3] = 1411447909
		pgs[4] = 1157464245
		pgs[6] = 1798260255
		pgs[7] = 3245955639
		pgs[8] = 1135006044
		pgs[9] = 272976564
		pgs[10] = "shape.wdf"
	elseif pg == "九阴勾魂_狐美人_普通" then
		pgs[1] = 34055457
		pgs[2] = 34055457
		pgs[3] = 2107661171
		pgs[4] = 2594225835
		pgs[6] = 1606837702
		pgs[7] = 4229873282
		pgs[8] = 14066732
		pgs[9] = 3187095867
		pgs[10] = "shape.wdf"
	elseif pg == "非攻_羽灵神_普通" then
		pgs[1] = 2832976024
		pgs[2] = 2832976024
		pgs[3] = 1185088706
		pgs[4] = 4004334076
		pgs[6] = 3652084138
		pgs[7] = 384985378
		pgs[8] = 2233740441
		pgs[9] = 1204493716
		pgs[10] = "shape.wdf"
	elseif pg == "九阴勾魂_骨精灵_普通" then
		pgs[1] = 1703807983
		pgs[2] = 1703807983
		pgs[3] = 1108591457
		pgs[4] = 2771732364
		pgs[6] = 489022779
		pgs[7] = 3267946192
		pgs[8] = 3766522110
		pgs[9] = 2175760076
		pgs[10] = "shape.wdf"
	elseif pg == "梨花_龙太子_普通" then
		pgs[1] = 3747222349
		pgs[2] = 3747222349
		pgs[3] = 3189155092
		pgs[4] = 3062365732
		pgs[6] = 1598243358
		pgs[7] = 2389430522
		pgs[8] = 3918605409
		pgs[9] = 1648372626
		pgs[10] = "shape.wdf"
	elseif pg == "护法灭魔_虎头怪_普通" then
		pgs[1] = 2333757160
		pgs[2] = 2333757160
		pgs[3] = 608625932
		pgs[4] = 1240918279
		pgs[6] = 4006191476
		pgs[7] = 291325187
		pgs[8] = 1586774719
		pgs[9] = 2726510090
		pgs[10] = "shape.wdf"
	elseif pg == "碧血干戚_虎头怪_普通" then
		pgs[1] = 2522616044
		pgs[2] = 2522616044
		pgs[3] = 3551561984
		pgs[4] = 4132910073
		pgs[6] = 2916654539
		pgs[7] = 1375729749
		pgs[8] = 3235367936
		pgs[9] = 2444186613
		pgs[10] = "shape.dll"
	elseif pg == "裂天_虎头怪_普通" then
		pgs[1] = 3605525759
		pgs[2] = 3605525759
		pgs[3] = 1658258788
		pgs[4] = 1428790516
		pgs[6] = 1927582914
		pgs[7] = 0157199347
		pgs[8] = 2018235479
		pgs[9] = 0184731195
		pgs[10] = "shape.dll"
	elseif pg == "五虎断魂_神天兵_普通" then
		pgs[1] = 2816878895
		pgs[2] = 2816878895
		pgs[3] = 3237243180
		pgs[4] = 298941115
		pgs[6] = 555909501
		pgs[7] = 683330927
		pgs[8] = 2195670772
		pgs[9] = 223295368
		pgs[10] = "shape.wdf"
	elseif pg == "庄周梦蝶_羽灵神_普通" then
		pgs[1] = 101429091
		pgs[2] = 101429091
		pgs[3] = 1184168411
		pgs[4] = 3432364546
		pgs[6] = 3657330082
		pgs[7] = 548056296
		pgs[8] = 3683860076
		pgs[9] = 1443396752
		pgs[10] = "shape.wdf"
	elseif pg == "庄周梦蝶_巫蛮儿_普通" then
		pgs[1] = 2699629829
		pgs[2] = 2699629829
		pgs[3] = 19941067
		pgs[4] = 2214888719
		pgs[6] = 2405414221
		pgs[7] = 3124365588
		pgs[8] = 181704645
		pgs[9] = 1598617101
		pgs[10] = "shape.wdf"
	elseif pg == "鹿鸣_羽灵神_普通" then
		pgs[1] = 430621291
		pgs[2] = 430621291
		pgs[3] = 3690027526
		pgs[4] = 2690907506
		pgs[6] = 2067206624
		pgs[7] = 3983937939
		pgs[8] = 2646614429
		pgs[9] = 664180130
		pgs[10] = "shape.wdf"

	elseif pg == "碧海潮生_羽灵神_普通" then
		pgs[1] = 2874500726
		pgs[2] = 2874500726
		pgs[3] = 2974311966
		pgs[4] = 3236853267
		pgs[6] = 2141705747
		pgs[7] = 3946028962
		pgs[8] = 4233351592
		pgs[9] = 2739863852
		pgs[10] = "shape.wdf"
	elseif pg == "弦月_羽灵神_普通" then
		pgs[1] = 4100861245
		pgs[2] = 4100861245
		pgs[3] = 2434737195
		pgs[4] = 2220097459
		pgs[6] = 0862692538
		pgs[7] = 2870088340
		pgs[8] = 1671028156
		pgs[9] = 2129606162
		pgs[10] = "shape.wdf"
	elseif pg == "连理双树_飞燕女_普通" then
		pgs[1] = 2798452597
		pgs[2] = 2798452597
		pgs[3] = 2779592090
		pgs[4] = 111849301
		pgs[6] = 3818492150
		pgs[7] = 359904366
		pgs[8] = 981796200
		pgs[9] = 1623427017
		pgs[10] = "shape.wdf"
	elseif pg == "青藤玉树_骨精灵_普通" then
		pgs[1] = 3707129187
		pgs[2] = 3707129187
		pgs[3] = 260368700
		pgs[4] = 1260458106
		pgs[6] = 2796632770
		pgs[7] = 1119703569
		pgs[8] = 229416981
		pgs[9] = 2366517522
		pgs[10] = "shape.wdf"
	elseif pg == "月光双剑_飞燕女_普通" then
		pgs[1] = 2513982445
		pgs[2] = 2513982445
		pgs[3] = 1641721613
		pgs[4] = 2962390676
		pgs[6] = 586287519
		pgs[7] = 851655841
		pgs[8] = 1872246816
		pgs[9] = 3097886899
		pgs[10] = "shape.wdf"
	elseif pg == "鬼牙_神天兵_普通" then
		pgs[1] = 2430761776
		pgs[2] = 2430761776
		pgs[3] = 3359352706
		pgs[4] = 2621027170
		pgs[6] = 1110189315
		pgs[7] = 2486917341
		pgs[8] = 2741674073
		pgs[9] = 2681319409
		pgs[10] = "shape.wdf"
	elseif pg == "玉辉_羽灵神_普通" then
		pgs[1] = 1799011000
		pgs[2] = 1799011000
		pgs[3] = 3831187618
		pgs[4] = 2997063111
		pgs[6] = 3312955607
		pgs[7] = 3013082841
		pgs[8] = 1939053710
		pgs[9] = 1116805220
		pgs[10] = "shape.wdf"
	elseif pg == "乾坤_飞燕女_普通" then
		pgs[1] = 3034288425
		pgs[2] = 3034288425
		pgs[3] = 2723272677
		pgs[4] = 1960402927
		pgs[6] = 3867771865
		pgs[7] = 1780449233
		pgs[8] = 967310259
		pgs[9] = 2120714102
		pgs[10] = "shape.wdf"
	elseif pg == "倚天_剑侠客_普通" then
		pgs[1] = 1368524342
		pgs[2] = 1368524342
		pgs[3] = 1068916714
		pgs[4] = 4221789782
		pgs[6] = 360062771
		pgs[7] = 517811079
		pgs[8] = 3380216158
		pgs[9] = 195389599
		pgs[10] = "shape.wdf"
	elseif pg == "玉辉_巫蛮儿_普通" then
		pgs[1] = 2197847487
		pgs[2] = 2197847487
		pgs[3] = 647814036
		pgs[4] = 643336377
		pgs[6] = 3288644239
		pgs[7] = 869836664
		pgs[8] = 2936127898
		pgs[9] = 2134751551
		pgs[10] = "shape.wdf"
	elseif pg == "业焰_羽灵神_普通" then
		pgs[1] = 1471856529
		pgs[2] = 1471856529
		pgs[3] = 1895438642
		pgs[4] = 1769877803
		pgs[6] = 4245874516
		pgs[7] = 572738149
		pgs[8] = 1774544621
		pgs[9] = 565335915
		pgs[10] = "shape.wdf"
	elseif pg == "鱼肠_逍遥生_普通" then
		pgs[1] = 111752242
		pgs[2] = 111752242
		pgs[3] = 2779964916
		pgs[4] = 3099677412
		pgs[6] = 1315883113
		pgs[7] = 4096670906
		pgs[8] = 3380575361
		pgs[9] = 3347297766
		pgs[10] = "shape.wdf"
	elseif pg == "肃魂_巨魔王_普通" then
		pgs[1] = 3727576188
		pgs[2] = 3727576188
		pgs[3] = 3246311288
		pgs[4] = 4127273897
		pgs[6] = 1400005662
		pgs[7] = 3888898365
		pgs[8] = 2920150876
		pgs[9] = 696981765
		pgs[10] = "shape.wdf"
	elseif pg == "业焰_巫蛮儿_普通" then
		pgs[1] = 358788281
		pgs[2] = 358788281
		pgs[3] = 3187541069
		pgs[4] = 1276652632
		pgs[6] = 746435059
		pgs[7] = 1492176534
		pgs[8] = 4078550197
		pgs[9] = 2864410571
		pgs[10] = "shape.wdf"
	elseif pg == "龙鸣寒水_羽灵神_普通" then
		pgs[1] = 2288999152
		pgs[2] = 2288999152
		pgs[3] = 3191815629
		pgs[4] = 975203915
		pgs[6] = 3559987378
		pgs[7] = 0xDE5063CD
		pgs[8] = 55816849
		pgs[9] = 1433469896
		pgs[10] = "shape.wdf"
	elseif pg == "太极流光_杀破狼_普通" then
		pgs[1] = 2074525537
		pgs[2] = 2074525537
		pgs[3] = 449187270
		pgs[4] = 2759360079
		pgs[6] = 3413608092
		pgs[7] = 1682905191
		pgs[8] = 4051367450
		pgs[9] = 3252077695
		pgs[10] = "shape.wdf"
	elseif pg == "九霄风雷_杀破狼_普通" then
		pgs[1] = 3704392067
		pgs[2] = 3704392067
		pgs[3] = 3632605747
		pgs[4] = 2197826216
		pgs[6] = 2845081681
		pgs[7] = 2020968771
		pgs[8] = 3450511222
		pgs[9] = 1885695436
		pgs[10] = "shape.wdf"
	elseif pg == "若木_杀破狼_普通" then
		pgs[1] = 2783866786
		pgs[2] = 2783866786
		pgs[3] = 1862994822
		pgs[4] = 1445406110
		pgs[6] = 1501063042
		pgs[7] = 1500235485
		pgs[8] = 3264257605
		pgs[9] = 3963075748
		pgs[10] = "shape.wdf"

	elseif pg == "秋水落霞_玄彩娥_普通" then
		pgs[1] = 2834670277
		pgs[2] = 2834670277
		pgs[3] = 3677397747
		pgs[4] = 1773897847
		pgs[6] = 2096851051
		pgs[7] = 2528379760
		pgs[8] = 4035277094
		pgs[9] = 2619283310
		pgs[10] = "shape.wdf"
	elseif pg == "湛卢_剑侠客_普通" then
		pgs[1] = 174574078
		pgs[2] = 174574078
		pgs[3] = 2462930631
		pgs[4] = 623897396
		pgs[6] = 357132169
		pgs[7] = 1091639193
		pgs[8] = 132771616
		pgs[9] = 1502161679
		pgs[10] = "shape.wdf"
	elseif pg == "飞星_杀破狼_普通" then
		pgs[1] = 1920229574
		pgs[2] = 1920229574
		pgs[3] = 3670774470
		pgs[4] = 1565695987
		pgs[6] = 612719827
		pgs[7] = 304215519
		pgs[8] = 15688186
		pgs[9] = 3390941259
		pgs[10] = "shape.wdf"
	elseif pg == "太极流光_羽灵神_普通" then
		pgs[1] = 2848033504
		pgs[2] = 2848033504
		pgs[3] = 2656382753
		pgs[4] = 2977776427
		pgs[6] = 1141425103
		pgs[7] = 3968350241
		pgs[8] = 2316321007
		pgs[9] = 104034525
		pgs[10] = "shape.wdf"
	elseif pg == "九霄风雷_羽灵神_普通" then
		pgs[1] = 0158730771
		pgs[2] = 0158730771
		pgs[3] = 0132145415
		pgs[4] = 0764898549
		pgs[6] = 3046428836
		pgs[7] = 0756094913
		pgs[8] = 1838448889
		pgs[9] = 0827920690
		pgs[10] = "shape.wdf"
	elseif pg == "若木_羽灵神_普通" then
		pgs[1] = 4068136814
		pgs[2] = 4068136814
		pgs[3] = 0418458259
		pgs[4] = 3490606442
		pgs[6] = 3417142708
		pgs[7] = 3650939868
		pgs[8] = 3613858643
		pgs[9] = 3612898812
		pgs[10] = "shape.wdf"
	elseif pg == "冥火薄天_杀破狼_普通" then
		pgs[1] = 871369705
		pgs[2] = 871369705
		pgs[3] = 1399674031
		pgs[4] = 1805010867
		pgs[6] = 1620002437
		pgs[7] = 1839576620
		pgs[8] = 621841422
		pgs[9] = 3126248794
		pgs[10] = "shape.wdf"
	elseif pg == "幽篁_杀破狼_普通" then
		pgs[1] = 1663842501
		pgs[2] = 1663842501
		pgs[3] = 2110884946
		pgs[4] = 4241477506
		pgs[6] = 4245424904
		pgs[7] = 1184291529
		pgs[8] = 3595306000
		pgs[9] = 3541370331
		pgs[10] = "shape.wdf"
	elseif pg == "霹雳_神天兵_普通" then
		pgs[1] = 1051053489
		pgs[2] = 1051053489
		pgs[3] = 4239140569
		pgs[4] = 2085918398
		pgs[6] = 3349289903
		pgs[7] = 3508045990
		pgs[8] = 143015740
		pgs[9] = 2889808459
		pgs[10] = "shape.wdf"
	elseif pg == "四法青云_剑侠客_普通" then
		pgs[1] = 2301962273
		pgs[2] = 2301962273
		pgs[3] = 1642344190
		pgs[4] = 4019743340
		pgs[6] = 690548315
		pgs[7] = 654838706
		pgs[8] = 3259089844
		pgs[9] = 3268379919
		pgs[10] = "shape.wdf"

	elseif pg == "霜冷九州_逍遥生_普通" then
		pgs[1] = 3500923187
		pgs[2] = 3500923187
		pgs[3] = 3419416515
		pgs[4] = 4121135422
		pgs[6] = 1766329695
		pgs[7] = 1208240575
		pgs[8] = 2948332373
		pgs[9] = 0569489195
		pgs[10] = "shape.dll"
	elseif pg == "霜冷九州_剑侠客_普通" then
		pgs[1] = 3750052903
		pgs[2] = 3750052903
		pgs[3] = 3978185529
		pgs[4] = 1126547325
		pgs[6] = 3133397477
		pgs[7] = 1400612648
		pgs[8] = 1048600867
		pgs[9] = 0587348277
		pgs[10] = "shape.dll"
	elseif pg == "擒龙_逍遥生_普通" then
		pgs[1] = 2313480743
		pgs[2] = 2313480743
		pgs[3] = 1394178168
		pgs[4] = 3931344485
		pgs[6] = 4049254285
		pgs[7] = 1046891202
		pgs[8] = 2147278343
		pgs[9] = 4088283715
		pgs[10] = "shape.dll"
	elseif pg == "擒龙_剑侠客_普通" then
		pgs[1] = 2066485351
		pgs[2] = 2066485351
		pgs[3] = 3200400983
		pgs[4] = 4074782058
		pgs[6] = 2739156816
		pgs[7] = 2620255839
		pgs[8] = 3164581880
		pgs[9] = 0839277591
		pgs[10] = "shape.dll"
	elseif pg == "百鬼_杀破狼_普通" then
		pgs[1] = 2607438844
		pgs[2] = 2607438844
		pgs[3] = 894755654
		pgs[4] = 1601466888
		pgs[6] = 520922337
		pgs[7] = 3106122659
		pgs[8] = 610584642
		pgs[9] = 1809776963
		pgs[10] = "shape.wdf"
	elseif pg == "破魄_巨魔王_普通" then
		pgs[1] = 319488423
		pgs[2] = 319488423
		pgs[3] = 276199838
		pgs[4] = 3984718092
		pgs[6] = 3043299876
		pgs[7] = 2152441077
		pgs[8] = 4105273607
		pgs[9] = 1812185996
		pgs[10] = "shape.wdf"
	elseif pg == "贵霜之牙_骨精灵_普通" then
		pgs[1] = 13151833
		pgs[2] = 13151833
		pgs[3] = 3119070731
		pgs[4] = 2925176370
		pgs[6] = 799282094
		pgs[7] = 602955150
		pgs[8] = 2619296391
		pgs[9] = 1165096955
		pgs[10] = "shape.wdf"
	elseif pg == "忘川三途_骨精灵_普通" then
		pgs[1] = 1057196119
		pgs[2] = 1057196119
		pgs[3] = 3284493434
		pgs[4] = 3066925446
		pgs[6] = 0859112470
		pgs[7] = 2663913050
		pgs[8] = 1551227703
		pgs[9] = 2945401960
		pgs[10] = "shape.dll"
	elseif pg == "离钩_骨精灵_普通" then
		pgs[1] = 4162960663
		pgs[2] = 4162960663
		pgs[3] = 2169364374
		pgs[4] = 0433475784
		pgs[6] = 0158171847
		pgs[7] = 2484616195
		pgs[8] = 1699445520
		pgs[9] = 2751461351
		pgs[10] = "shape.dll"

	elseif pg == "幽篁_羽灵神_普通" then
		pgs[1] = 1385345996
		pgs[2] = 1385345996
		pgs[3] = 767991055
		pgs[4] = 2413280637
		pgs[6] = 3907295353
		pgs[7] = 4034909222
		pgs[8] = 590632369
		pgs[9] = 1102812055
		pgs[10] = "shape.wdf"
	elseif pg == "非攻_杀破狼_普通" then
		pgs[1] = 1885839562
		pgs[2] = 1885839562
		pgs[3] = 3957124377
		pgs[4] = 3204102825
		pgs[6] = 2379415806
		pgs[7] = 1950788981
		pgs[8] = 1127738414
		pgs[9] = 2661471858
		pgs[10] = "shape.wdf"
	elseif pg == "紫金葫芦_杀破狼_普通" then
		pgs[1] = 994535269
		pgs[2] = 994535269
		pgs[3] = 4014927528
		pgs[4] = 3310480847
		pgs[6] = 2831639351
		pgs[7] = 122206673
		pgs[8] = 1940957103
		pgs[9] = 2257546251
		pgs[10] = "shape.wdf"
	elseif pg == "回风舞雪_杀破狼_普通" then
		pgs[1] = 723925966
		pgs[2] = 723925966
		pgs[3] = 1798299344
		pgs[4] = 1212380108
		pgs[6] = 1637540313
		pgs[7] = 2653292719
		pgs[8] = 257191592
		pgs[9] = 2659671813
		pgs[10] = "shape.wdf"
	elseif pg == "飞龙在天_龙太子_普通" then
		pgs[1] = 0x49187E40
		pgs[2] = 0x49187E40
		pgs[3] = 0xA87E49E8
		pgs[4] = 0x41E835B5
		pgs[6] = 0x28FCF221
		pgs[7] = 0x367AC070
		pgs[8] = 0x1255644D
		pgs[9] = 0x4E9D13AE
		pgs[10] = "shape.wdf"
	elseif pg == "天龙破城_龙太子_普通" then
		pgs[1] = 0666227171
		pgs[2] = 0666227171
		pgs[3] = 3545294647
		pgs[4] = 1075279479
		pgs[6] = 4013753607
		pgs[7] = 1440842173
		pgs[8] = 1146668387
		pgs[9] = 1609569152
		pgs[10] = "shape.dll"
	elseif pg == "弑皇_龙太子_普通" then
		pgs[1] = 0x2F84D4CA
		pgs[2] = 0x2F84D4CA
		pgs[3] = 0x9792B519
		pgs[4] = 0xB80DD092
		pgs[6] = 0xEF721760
		pgs[7] = 0x6B780672
		pgs[8] = 0xA85D5556
		pgs[9] = 0x28B45289
		pgs[10] = "shape.dll"
	elseif pg == "雪蚕之刺_狐美人_普通" then
		pgs[1] = 3375230005
		pgs[2] = 3375230005
		pgs[3] = 49297381
		pgs[4] = 4186182464
		pgs[6] = 4168563223
		pgs[7] = 3779159654
		pgs[8] = 1556439270
		pgs[9] = 3143637419
		pgs[10] = "shape.wdf"
	elseif pg == "毒牙_狐美人_普通" then
		pgs[1] = 2678046311
		pgs[2] = 2678046311
		pgs[3] = 147162749
		pgs[4] = 1046153681
		pgs[6] = 3025877259
		pgs[7] = 4196456021
		pgs[8] = 2797725717
		pgs[9] = 648763427
		pgs[10] = "shape.wdf"
	elseif pg == "鬼牙_虎头怪_普通" then
		pgs[1] = 3191385649
		pgs[2] = 3191385649
		pgs[3] = 964246481
		pgs[4] = 439390498
		pgs[6] = 2557976454
		pgs[7] = 899308703
		pgs[8] = 1809962467
		pgs[9] = 1310176885
		pgs[10] = "shape.wdf"
	elseif pg == "五丁开山_巨魔王_普通" then
		pgs[1] = 2764988110
		pgs[2] = 2764988110
		pgs[3] = 658496727
		pgs[4] = 1647167110
		pgs[6] = 3579833021
		pgs[7] = 1948978116
		pgs[8] = 1824676110
		pgs[9] = 1166051005
		pgs[10] = "shape.wdf"
	elseif pg == "月光双环_舞天姬_普通" then
		pgs[1] = 3165243568
		pgs[2] = 3165243568
		pgs[3] = 16282348
		pgs[4] = 2288648467
		pgs[6] = 3693039080
		pgs[7] = 2693457978
		pgs[8] = 3984861090
		pgs[9] = 1429132352
		pgs[10] = "shape.wdf"
	elseif pg == "晓风残月_剑侠客_普通" then
		pgs[1] = 3614142659
		pgs[2] = 3614142659
		pgs[3] = 222137428
		pgs[4] = 162101136
		pgs[6] = 3111105254
		pgs[7] = 1410594659
		pgs[8] = 1285154537
		pgs[9] = 1663734878
		pgs[10] = "shape.wdf"
	elseif pg == "无敌_巨魔王_普通" then
		pgs[1] = 1778946713
		pgs[2] = 1778946713
		pgs[3] = 524617246
		pgs[4] = 1841084145
		pgs[6] = 2152432898
		pgs[7] = 2969721676
		pgs[8] = 1229188957
		pgs[9] = 788779469
		pgs[10] = "shape.wdf"
	elseif pg == "离火_杀破狼_普通" then
		pgs[1] = 1736891488
		pgs[2] = 1736891488
		pgs[3] = 1516097158
		pgs[4] = 1419099406
		pgs[6] = 619566973
		pgs[7] = 332324123
		pgs[8] = 942082261
		pgs[9] = 4082318050
		pgs[10] = "shape.wdf"
	elseif pg == "碧波_舞天姬_普通" then
		pgs[1] = 1034789143
		pgs[2] = 1034789143
		pgs[3] = 4113412723
		pgs[4] = 2355929470
		pgs[6] = 2655943207
		pgs[7] = 2855246102
		pgs[8] = 241555200
		pgs[9] = 1141838919
		pgs[10] = "shape.wdf"
	elseif pg == "此最相思_玄彩娥_普通" then
		pgs[1] = 193367860
		pgs[2] = 193367860
		pgs[3] = 1702432156
		pgs[4] = 2340791616
		pgs[6] = 493173921
		pgs[7] = 1169690561
		pgs[8] = 2674679688
		pgs[9] = 668529798
		pgs[10] = "shape.wdf"
	elseif pg == "揽月摘星_玄彩娥_普通" then
		pgs[1] = 3957461210
		pgs[2] = 3957461210
		pgs[3] = 1507018653
		pgs[4] = 1507018653
		pgs[6] = 2821704604
		pgs[7] = 3505463631
		pgs[8] = 2825593192
		pgs[9] = 1456089502
		pgs[10] = "shape.dll"
	elseif pg == "九霄_玄彩娥_普通" then
		pgs[1] = 1925606125
		pgs[2] = 1925606125
		pgs[3] = 1672964794
		pgs[4] = 3074777996
		pgs[6] = 3263307981
		pgs[7] = 1083356098
		pgs[8] = 2475418304
		pgs[9] = 2130671600
		pgs[10] = "shape.dll"
	elseif pg == "连理双树_英女侠_普通" then
		pgs[1] = 1056087193
		pgs[2] = 1056087193
		pgs[3] = 158990972
		pgs[4] = 2230185189
		pgs[6] = 3682647142
		pgs[7] = 3580865845
		pgs[8] = 686282707
		pgs[9] = 3554518006
		pgs[10] = "shape.wdf"
	elseif pg == "凤翼流珠_巫蛮儿_普通" then
		pgs[1] = 2005711219
		pgs[2] = 2005711219
		pgs[3] = 1777115444
		pgs[4] = 738268467
		pgs[6] = 3554514707
		pgs[7] = 2166949971
		pgs[8] = 2242679788
		pgs[9] = 3110874208
		pgs[10] = "shape.wdf"
	elseif pg == "金龙双剪_飞燕女_普通" then
		pgs[1] = 1411197712
		pgs[2] = 1411197712
		pgs[3] = 4046830583
		pgs[4] = 2149768266
		pgs[6] = 3896276189
		pgs[7] = 1274536324
		pgs[8] = 3865893351
		pgs[9] = 4293096481
		pgs[10] = "shape.wdf"
	elseif pg == "游龙惊鸿_狐美人_普通" then
		pgs[1] = 1677496371
		pgs[2] = 1677496371
		pgs[3] = 1419416100
		pgs[4] = 1427572959
		pgs[6] = 3911390728
		pgs[7] = 4269124018
		pgs[8] = 1118732647
		pgs[9] = 1632285264
		pgs[10] = "shape.wdf"
	elseif pg == "倚天_逍遥生_普通" then
		pgs[1] = 944530413
		pgs[2] = 944530413
		pgs[3] = 4288693369
		pgs[4] = 2648862354
		pgs[6] = 893536575
		pgs[7] = 3580840293
		pgs[8] = 1513199932
		pgs[9] = 1959183902
		pgs[10] = "shape.wdf"
	elseif pg == "雷神_神天兵_普通" then
		pgs[1] = 148474283
		pgs[2] = 148474283
		pgs[3] = 2398394513
		pgs[4] = 2945190989
		pgs[6] = 3920362664
		pgs[7] = 3086874992
		pgs[8] = 2993116090
		pgs[9] = 2515289535
		pgs[10] = "shape.wdf"
	elseif pg == "湛卢_逍遥生_普通" then
		pgs[1] = 4122820611
		pgs[2] = 4122820611
		pgs[3] = 39942374
		pgs[4] = 3784693035
		pgs[6] = 3879135399
		pgs[7] = 1799718291
		pgs[8] = 2656683712
		pgs[9] = 356672046
		pgs[10] = "shape.wdf"
	elseif pg == "屠龙_剑侠客_普通" then
		pgs[1] = 892827193
		pgs[2] = 892827193
		pgs[3] = 2530500829
		pgs[4] = 3739812188
		pgs[6] = 408410478
		pgs[7] = 2903940161
		pgs[8] = 1040159026
		pgs[9] = 319067749
		pgs[10] = "shape.wdf"
	elseif pg == "盘龙_骨精灵_普通" then
		pgs[1] = 399188318
		pgs[2] = 399188318
		pgs[3] = 3336570526
		pgs[4] = 2823302607
		pgs[6] = 4143522053
		pgs[7] = 4066814475
		pgs[8] = 2053873433
		pgs[9] = 4254444118
		pgs[10] = "shape.wdf"
	elseif pg == "龙筋_英女侠旧_普通" then
		pgs[1] = 151
		pgs[2] = 151
		pgs[3] = 153
		pgs[4] = 150
		pgs[6] = 257
		pgs[7] = 152
		pgs[8] = 256
		pgs[9] = 148
		pgs[10] = "shape.wdf"
	elseif pg == "秋风_龙太子_普通" then
		pgs[1] = 775882284
		pgs[2] = 775882284
		pgs[3] = 749947548
		pgs[4] = 4103046621
		pgs[6] = 4079294468
		pgs[7] = 1774952424
		pgs[8] = 409973300
		pgs[9] = 342475400
		pgs[10] = "shape.wdf"
	elseif pg == "胭脂_骨精灵_普通" then
		pgs[1] = 4115672778
		pgs[2] = 4115672778
		pgs[3] = 2352019632
		pgs[4] = 1274576130
		pgs[6] = 970419487
		pgs[7] = 2008951769
		pgs[8] = 275870055
		pgs[9] = 2737514270
		pgs[10] = "shape.wdf"
	elseif pg == "画龙点睛_逍遥生_普通" then
		pgs[1] = 1820963257
		pgs[2] = 1820963257
		pgs[3] = 177826354
		pgs[4] = 847585063
		pgs[6] = 2168341927
		pgs[7] = 2999351206
		pgs[8] = 2759214368
		pgs[9] = 3485764253
		pgs[10] = "shape.wdf"
	elseif pg == "月光双剑_英女侠旧_普通" then
		pgs[1] = 293
		pgs[2] = 293
		pgs[3] = 295
		pgs[4] = 292
		pgs[6] = 297
		pgs[7] = 294
		pgs[8] = 296
		pgs[9] = 290
		pgs[10] = "shape.wdf"
	elseif pg == "混元金锤_神天兵_普通" then
		pgs[1] = 1923208867
		pgs[2] = 1923208867
		pgs[3] = 3952062894
		pgs[4] = 1295504995
		pgs[6] = 577114027
		pgs[7] = 1445398766
		pgs[8] = 3171781597
		pgs[9] = 1835217455
		pgs[10] = "shape.wdf"
	elseif pg == "降魔玉杵_玄彩娥_普通" then
		pgs[1] = 4099217390
		pgs[2] = 4099217390
		pgs[3] = 3206381160
		pgs[4] = 2229271781
		pgs[6] = 2242027872
		pgs[7] = 775886307
		pgs[8] = 3480235058
		pgs[9] = 3182933271
		pgs[10] = "shape.wdf"
	elseif pg == "流云_舞天姬_普通" then
		pgs[1] = 4195857049
		pgs[2] = 4195857049
		pgs[3] = 2514907580
		pgs[4] = 972420940
		pgs[6] = 198547491
		pgs[7] = 2802292186
		pgs[8] = 3885561582
		pgs[9] = 1837939421
		pgs[10] = "shape.wdf"
	elseif pg == "如意_舞天姬_普通" then
		pgs[1] = 3267454880
		pgs[2] = 3267454880
		pgs[3] = 1911031086
		pgs[4] = 2351280146
		pgs[6] = 850292701
		pgs[7] = 500162329
		pgs[8] = 1166644566
		pgs[9] = 197968673
		pgs[10] = "shape.wdf"
	elseif pg == "流云_玄彩娥_普通" then
		pgs[1] = 2363368052
		pgs[2] = 2363368052
		pgs[3] = 469609710
		pgs[4] = 1588271293
		pgs[6] = 688944433
		pgs[7] = 4012911086
		pgs[8] = 4199981403
		pgs[9] = 459658607
		pgs[10] = "shape.wdf"
	elseif pg == "晃金仙绳_舞天姬_普通" then
		pgs[1] = 480998208
		pgs[2] = 480998208
		pgs[3] = 536662357
		pgs[4] = 1983509384
		pgs[6] = 2029228117
		pgs[7] = 1363856210
		pgs[8] = 66546999
		pgs[9] = 4226984468
		pgs[10] = "shape.wdf"
	elseif pg == "鹿鸣_巫蛮儿_普通" then
		pgs[1] = 2923599993
		pgs[2] = 2923599993
		pgs[3] = 862900418
		pgs[4] = 2806977290
		pgs[6] = 2678464587
		pgs[7] = 893469617
		pgs[8] = 3689245011
		pgs[9] = 780797617
		pgs[10] = "shape.wdf"
	elseif pg == "沧海_骨精灵_普通" then
		pgs[1] = 3063376651
		pgs[2] = 3063376651
		pgs[3] = 2245942073
		pgs[4] = 3879413923
		pgs[6] = 3414421168
		pgs[7] = 4221563191
		pgs[8] = 3538250889
		pgs[9] = 3779942817
		pgs[10] = "shape.wdf"
	elseif pg == "太极_龙太子_普通" then
		pgs[1] = 3905888692
		pgs[2] = 3905888692
		pgs[3] = 2235760273
		pgs[4] = 518907138
		pgs[6] = 121079973
		pgs[7] = 662010105
		pgs[8] = 1852360605
		pgs[9] = 269312850
		pgs[10] = "shape.wdf"
	elseif pg == "阴阳_英女侠旧_普通" then
		pgs[1] = 293
		pgs[2] = 293
		pgs[3] = 295
		pgs[4] = 292
		pgs[6] = 297
		pgs[7] = 294
		pgs[8] = 296
		pgs[9] = 290
		pgs[10] = "shape.wdf"
	elseif pg == "吹雪_英女侠_普通" then
		pgs[1] = 1984457860
		pgs[2] = 1984457860
		pgs[3] = 2659822722
		pgs[4] = 4091160803
		pgs[6] = 2259108135
		pgs[7] = 1616653577
		pgs[8] = 3980490964
		pgs[9] = 1671498156
		pgs[10] = "shape.wdf"
	elseif pg == "太极_逍遥生_普通" then
		pgs[1] = 649896254
		pgs[2] = 649896254
		pgs[3] = 1386995615
		pgs[4] = 2206939775
		pgs[6] = 4084370231
		pgs[7] = 730224004
		pgs[8] = 2110134716
		pgs[9] = 297375576
		pgs[10] = "shape.wdf"
	elseif pg == "百花_英女侠_普通" then
		pgs[1] = 1180240329
		pgs[2] = 1180240329
		pgs[3] = 2921076198
		pgs[4] = 2432608663
		pgs[6] = 1464871645
		pgs[7] = 2411376211
		pgs[8] = 421272947
		pgs[9] = 1686679961
		pgs[10] = "shape.wdf"
	elseif pg == "九天金线_飞燕女_普通" then
		pgs[1] = 256145777
		pgs[2] = 256145777
		pgs[3] = 805152074
		pgs[4] = 612236907
		pgs[6] = 1205883736
		pgs[7] = 4056107702
		pgs[8] = 1146798449
		pgs[9] = 876728636
		pgs[10] = "shape.wdf"
	elseif pg == "无关风月_飞燕女_普通" then
		pgs[1] = 2051866479
		pgs[2] = 2051866479
		pgs[3] = 1785158753
		pgs[4] = 1982666386
		pgs[6] = 3204942337
		pgs[7] = 1654668611
		pgs[8] = 0930614766
		pgs[9] = 3051530981
		pgs[10] = "shape.dll"
	elseif pg == "朝夕_飞燕女_普通" then
		pgs[1] = 4138802289
		pgs[2] = 4138802289
		pgs[3] = 0258017396
		pgs[4] = 0480690756
		pgs[6] = 2701132789
		pgs[7] = 3192094510
		pgs[8] = 3576848265
		pgs[9] = 1213207317
		pgs[10] = "shape.dll"
	elseif pg == "鱼肠_剑侠客_普通" then
		pgs[1] = 4227823198
		pgs[2] = 4227823198
		pgs[3] = 2698488437
		pgs[4] = 3798717939
		pgs[6] = 3533475904
		pgs[7] = 3303465815
		pgs[8] = 1861666518
		pgs[9] = 1012813203
		pgs[10] = "shape.wdf"
	elseif pg == "别情离恨_舞天姬_普通" then
		pgs[1] = 799504916
		pgs[2] = 799504916
		pgs[3] = 842553389
		pgs[4] = 1982103646
		pgs[6] = 2210222918
		pgs[7] = 1858157676
		pgs[8] = 1117799210
		pgs[9] = 3296383020
		pgs[10] = "shape.wdf"
	elseif pg == "月华_杀破狼_普通" then
		pgs[1] = 3883698348
		pgs[2] = 3883698348
		pgs[3] = 1535796704
		pgs[4] = 81237364
		pgs[6] = 786918783
		pgs[7] = 1149367266
		pgs[8] = 2874084219
		pgs[9] = 2578429791
		pgs[10] = "shape.wdf"
	elseif pg == "月光双环_飞燕女_普通" then
		pgs[1] = 4194305873
		pgs[2] = 4194305873
		pgs[3] = 2807816879
		pgs[4] = 73773078
		pgs[6] = 1041791674
		pgs[7] = 1651978044
		pgs[8] = 2848081881
		pgs[9] = 3069409432
		pgs[10] = "shape.wdf"
	elseif pg == "彩虹_玄彩娥_普通" then
		pgs[1] = 4010760941
		pgs[2] = 4010760941
		pgs[3] = 3725639444
		pgs[4] = 444072186
		pgs[6] = 1602142769
		pgs[7] = 3326013825
		pgs[8] = 1763662402
		pgs[9] = 2222466647
		pgs[10] = "shape.wdf"
	elseif pg == "墨玉骷髅_玄彩娥_普通" then
		pgs[1] = 1829371224
		pgs[2] = 1829371224
		pgs[3] = 2002019356
		pgs[4] = 2320316366
		pgs[6] = 2555196614
		pgs[7] = 335647506
		pgs[8] = 2671690470
		pgs[9] = 85118950
		pgs[10] = "shape.wdf"
	elseif pg == "丝萝乔木_玄彩娥_普通" then
		pgs[1] = 1121230155
		pgs[2] = 1121230155
		pgs[3] = 0322946589
		pgs[4] = 4206785453
		pgs[6] = 2777298091
		pgs[7] = 2186653861
		pgs[8] = 1884580054
		pgs[9] = 0740212343
		pgs[10] = "shape.dll"
	elseif pg == "醍醐_玄彩娥_普通" then
		pgs[1] = 3632446855
		pgs[2] = 3632446855
		pgs[3] = 2786004275
		pgs[4] = 4043816298
		pgs[6] = 0583826926
		pgs[7] = 2781044081
		pgs[8] = 0752278480
		pgs[9] = 0053905909
		pgs[10] = "shape.dll"
	elseif pg == "百鬼_羽灵神_普通" then
		pgs[1] = 433769011
		pgs[2] = 433769011
		pgs[3] = 1388983839
		pgs[4] = 2412124226
		pgs[6] = 3519132595
		pgs[7] = 2744030084
		pgs[8] = 3242785816
		pgs[9] = 4010155361
		pgs[10] = "shape.wdf"
	elseif pg == "鬼王蚀日_虎头怪_普通" then
		pgs[1] = 2268846765
		pgs[2] = 2268846765
		pgs[3] = 257733900
		pgs[4] = 733650393
		pgs[6] = 2155760337
		pgs[7] = 3690009014
		pgs[8] = 3223595996
		pgs[9] = 553446556
		pgs[10] = "shape.wdf"
	elseif pg == "狂澜碎岳_虎头怪_普通" then
		pgs[1] = 0843924172
		pgs[2] = 0843924172
		pgs[3] = 3497818294
		pgs[4] = 0119723529
		pgs[6] = 2748969191
		pgs[7] = 1323769114
		pgs[8] = 1279428078
		pgs[9] = 1811551067
		pgs[10] = "shape.dll"
	elseif pg == "碎寂_虎头怪_普通" then
		pgs[1] = 3620927202
		pgs[2] = 3620927202
		pgs[3] = 1460939045
		pgs[4] = 3684775387
		pgs[6] = 3894472815
		pgs[7] = 0534677085
		pgs[8] = 1857702941
		pgs[9] = 3336710114
		pgs[10] = "shape.dll"
	elseif pg == "秋风_逍遥生_普通" then
		pgs[1] = 2946234719
		pgs[2] = 2946234719
		pgs[3] = 918869516
		pgs[4] = 913597263
		pgs[6] = 1906683947
		pgs[7] = 3000647151
		pgs[8] = 3901133072
		pgs[9] = 1776219114
		pgs[10] = "shape.wdf"
	elseif pg == "血之刺藤_英女侠_普通" then
		pgs[1] = 543888368
		pgs[2] = 543888368
		pgs[3] = 3535124792
		pgs[4] = 1279996625
		pgs[6] = 676243872
		pgs[7] = 355830171
		pgs[8] = 3183836178
		pgs[9] = 373595036
		pgs[10] = "shape.wdf"
	elseif pg == "牧云清歌_英女侠_普通" then
		pgs[1] = 4166360919
		pgs[2] = 4166360919
		pgs[3] = 2255696063
		pgs[4] = 3268785498
		pgs[6] = 0534627512
		pgs[7] = 1644779301
		pgs[8] = 0411350546
		pgs[9] = 3269704350
		pgs[10] = "shape.dll"
	elseif pg == "霜陨_英女侠_普通" then
		pgs[1] = 3617687903
		pgs[2] = 3617687903
		pgs[3] = 3055706917
		pgs[4] = 0667306037
		pgs[6] = 4248825161
		pgs[7] = 0234849785
		pgs[8] = 0336164631
		pgs[9] = 2174583476
		pgs[10] = "shape.dll"
	elseif pg == "灵犀神剑_剑侠客_普通" then
		pgs[1] = 1664613177
		pgs[2] = 1664613177
		pgs[3] = 739286596
		pgs[4] = 3081380929
		pgs[6] = 2240524266
		pgs[7] = 2235430645
		pgs[8] = 2276071821
		pgs[9] = 83886513
		pgs[10] = "shape.wdf"
	elseif pg == "冷月_剑侠客_普通" then
		pgs[1] = 1050757801
		pgs[2] = 1050757801
		pgs[3] = 2523626742
		pgs[4] = 332965488
		pgs[6] = 797204911
		pgs[7] = 1739503652
		pgs[8] = 3541810222
		pgs[9] = 1219913712
		pgs[10] = "shape.wdf"
	elseif pg == "四法青云_逍遥生_普通" then
		pgs[1] = 3016226515
		pgs[2] = 3016226515
		pgs[3] = 52451636
		pgs[4] = 1691019474
		pgs[6] = 2058662475
		pgs[7] = 1670645347
		pgs[8] = 372928672
		pgs[9] = 3475794618
		pgs[10] = "shape.wdf"
	elseif pg == "刑天之逆_神天兵_普通" then
		pgs[1] = 4050435392
		pgs[2] = 4050435392
		pgs[3] = 1597843931
		pgs[4] = 1688528240
		pgs[6] = 2425493529
		pgs[7] = 1710005881
		pgs[8] = 507405361
		pgs[9] = 167694840
		pgs[10] = "shape.wdf"
	elseif pg == "偃月青龙_剑侠客_普通" then
		pgs[1] = 190424072
		pgs[2] = 190424072
		pgs[3] = 1961249071
		pgs[4] = 3838801989
		pgs[6] = 2829649300
		pgs[7] = 3543370033
		pgs[8] = 1454309726
		pgs[9] = 1450613061
		pgs[10] = "shape.wdf"
	elseif pg == "偃月青龙_巨魔王_普通" then
		pgs[1] = 4010127360
		pgs[2] = 4010127360
		pgs[3] = 1888302904
		pgs[4] = 1208038344
		pgs[6] = 1840793383
		pgs[7] = 1348825008
		pgs[8] = 868863512
		pgs[9] = 514498611
		pgs[10] = "shape.wdf"
	elseif pg == "灵蛇_飞燕女_普通" then
		pgs[1] = 2306957117
		pgs[2] = 2306957117
		pgs[3] = 1793932680
		pgs[4] = 2656017222
		pgs[6] = 3801799119
		pgs[7] = 2677792087
		pgs[8] = 1072683373
		pgs[9] = 2798173689
		pgs[10] = "shape.wdf"
	elseif pg == "混元金锤_虎头怪_普通" then
		pgs[1] = 3310158404
		pgs[2] = 3310158404
		pgs[3] = 3916719461
		pgs[4] = 2256126103
		pgs[6] = 1047119087
		pgs[7] = 649007137
		pgs[8] = 3287631002
		pgs[9] = 3272074169
		pgs[10] = "shape.wdf"
	elseif pg == "秋水人家_逍遥生_普通" then
		pgs[1] = 3722556358
		pgs[2] = 3722556358
		pgs[3] = 1425493699
		pgs[4] = 817486875
		pgs[6] = 2119665882
		pgs[7] = 79540806
		pgs[8] = 1912450629
		pgs[9] = 3131282288
		pgs[10] = "shape.wdf"
	elseif pg == "血之刺藤_狐美人_普通" then
		pgs[1] = 4050126740
		pgs[2] = 4050126740
		pgs[3] = 3429497989
		pgs[4] = 2489520435
		pgs[6] = 2605547995
		pgs[7] = 888707380
		pgs[8] = 1942318093
		pgs[9] = 3544559629
		pgs[10] = "shape.wdf"
	elseif pg == "牧云清歌_狐美人_普通" then
		pgs[1] = 1719727329
		pgs[2] = 1719727329
		pgs[3] = 0210056156
		pgs[4] = 4235354976
		pgs[6] = 3324406676
		pgs[7] = 4002747821
		pgs[8] = 2497747470
		pgs[9] = 0747942707
		pgs[10] = "shape.dll"
	elseif pg == "霜陨_狐美人_普通" then
		pgs[1] = 1258580513
		pgs[2] = 1258580513
		pgs[3] = 1285805382
		pgs[4] = 3557049784
		pgs[6] = 0373506230
		pgs[7] = 1376923560
		pgs[8] = 4168352366
		pgs[9] = 1324744500
		pgs[10] = "shape.dll"
	elseif pg == "冷月_巨魔王_普通" then
		pgs[1] = 432866760
		pgs[2] = 432866760
		pgs[3] = 1400294209
		pgs[4] = 2104157931
		pgs[6] = 1649287571
		pgs[7] = 3373155289
		pgs[8] = 3573839422
		pgs[9] = 914206326
		pgs[10] = "shape.wdf"
	elseif pg == "九天金线_舞天姬_普通" then
		pgs[1] = 1669961605
		pgs[2] = 1669961605
		pgs[3] = 280626373
		pgs[4] = 2737030257
		pgs[6] = 1711064047
		pgs[7] = 2155201472
		pgs[8] = 2934052938
		pgs[9] = 2722500657
		pgs[10] = "shape.wdf"
	elseif pg == "无关风月_舞天姬_普通" then
		pgs[1] = 3653729862
		pgs[2] = 3653729862
		pgs[3] = 2118476708
		pgs[4] = 1290614140
		pgs[6] = 2011121195
		pgs[7] = 3035499198
		pgs[8] = 3842984317
		pgs[9] = 1519396140
		pgs[10] = "shape.dll"
	elseif pg == "朝夕_舞天姬_普通" then
		pgs[1] = 2395353653
		pgs[2] = 2395353653
		pgs[3] = 0708502548
		pgs[4] = 3224442340
		pgs[6] = 3649114993
		pgs[7] = 2271525100
		pgs[8] = 3918368321
		pgs[9] = 3452351752
		pgs[10] = "shape.dll"
	elseif pg == "逍遥江湖_逍遥生_普通" then
		pgs[1] = 3459742955
		pgs[2] = 3459742955
		pgs[3] = 1723293957
		pgs[4] = 4224277364
		pgs[6] = 1818516162
		pgs[7] = 3783711264
		pgs[8] = 3566337709
		pgs[9] = 2650676483
		pgs[10] = "shape.wdf"
	elseif pg == "浩气长舒_逍遥生_普通" then
		pgs[1] = 1787687382
		pgs[2] = 1787687382
		pgs[3] = 2437076334
		pgs[4] = 2007103844
		pgs[6] = 1976544695
		pgs[7] = 1456930860
		pgs[8] = 2385855153
		pgs[9] = 3599367465
		pgs[10] = "shape.dll"
	elseif pg == "星瀚_逍遥生_普通" then
		pgs[1] = 2809028406
		pgs[2] = 2809028406
		pgs[3] = 3517798323
		pgs[4] = 0635822686
		pgs[6] = 4199298440
		pgs[7] = 4100767959
		pgs[8] = 3470836750
		pgs[9] = 0649411872
		pgs[10] = "shape.dll"
	elseif pg == "五丁开山_虎头怪_普通" then
		pgs[1] = 2062014821
		pgs[2] = 2062014821
		pgs[3] = 2363797327
		pgs[4] = 3661893622
		pgs[6] = 1889040253
		pgs[7] = 1541320741
		pgs[8] = 1738256578
		pgs[9] = 722835269
		pgs[10] = "shape.wdf"
	elseif pg == "游龙惊鸿_英女侠旧_普通" then
		pgs[1] = 17
		pgs[2] = 17
		pgs[3] = 19
		pgs[4] = 16
		pgs[6] = 368
		pgs[7] = 18
		pgs[8] = 361
		pgs[9] = 8
		pgs[10] = "shape.wdf"
	elseif pg == "月华_巫蛮儿_普通" then
		pgs[1] = 1792811676
		pgs[2] = 1792811676
		pgs[3] = 4148391824
		pgs[4] = 3636515320
		pgs[6] = 3355609993
		pgs[7] = 4240539050
		pgs[8] = 3498546662
		pgs[9] = 2176161640
		pgs[10] = "shape.wdf"
	elseif pg == "金龙双剪_英女侠_普通" then
		pgs[1] = 2024899093
		pgs[2] = 2024899093
		pgs[3] = 3727381444
		pgs[4] = 2340031682
		pgs[6] = 1687704448
		pgs[7] = 573860286
		pgs[8] = 1396936106
		pgs[9] = 2113820492
		pgs[10] = "shape.wdf"
	elseif pg == "降魔玉杵_骨精灵_普通" then
		pgs[1] = 3334934404
		pgs[2] = 3334934404
		pgs[3] = 3854049791
		pgs[4] = 1672795955
		pgs[6] = 2227811489
		pgs[7] = 2499485952
		pgs[8] = 265141570
		pgs[9] = 1457344498
		pgs[10] = "shape.wdf"
	elseif pg == "青藤玉树_玄彩娥_普通" then
		pgs[1] = 2503627450
		pgs[2] = 2503627450
		pgs[3] = 3110285636
		pgs[4] = 1992978765
		pgs[6] = 3809375891
		pgs[7] = 2547741955
		pgs[8] = 4282993605
		pgs[9] = 462404473
		pgs[10] = "shape.wdf"
	elseif pg == "仙人指路_英女侠_普通" then
		pgs[1] = 1536229276
		pgs[2] = 1536229276
		pgs[3] = 3074198838
		pgs[4] = 781619913
		pgs[6] = 2533848487
		pgs[7] = 4069179535
		pgs[8] = 1975224690
		pgs[9] = 1681443649
		pgs[10] = "shape.wdf"
	elseif pg == "破魄_虎头怪_普通" then
		pgs[1] = 66503730
		pgs[2] = 66503730
		pgs[3] = 2454517146
		pgs[4] = 147936745
		pgs[6] = 915959107
		pgs[7] = 2946347461
		pgs[8] = 1892595080
		pgs[9] = 1320517389
		pgs[10] = "shape.wdf"
	elseif pg == "灵犀神剑_逍遥生_普通" then
		pgs[1] = 4048939390
		pgs[2] = 4048939390
		pgs[3] = 2956972471
		pgs[4] = 91663105
		pgs[6] = 1499210091
		pgs[7] = 3108724735
		pgs[8] = 3464352844
		pgs[9] = 1984805790
		pgs[10] = "shape.wdf"
	elseif pg == "毒牙_骨精灵_普通" then
		pgs[1] = 991315240
		pgs[2] = 991315240
		pgs[3] = 1625283763
		pgs[4] = 2524067340
		pgs[6] = 1149167732
		pgs[7] = 1113746352
		pgs[8] = 590367663
		pgs[9] = 288632015
		pgs[10] = "shape.wdf"
	elseif pg == "秋水落霞_舞天姬_普通" then
		pgs[1] = 1202111998
		pgs[2] = 1202111998
		pgs[3] = 2037655830
		pgs[4] = 3049902097
		pgs[6] = 690602552
		pgs[7] = 1342960347
		pgs[8] = 3838882501
		pgs[9] = 1483726919
		pgs[10] = "shape.wdf"
	elseif pg == "凤翼流珠_羽灵神_普通" then
		pgs[1] = 3353149334
		pgs[2] = 3353149334
		pgs[3] = 1074224727
		pgs[4] = 160508292
		pgs[6] = 3400914167
		pgs[7] = 3537311768
		pgs[8] = 1351147384
		pgs[9] = 279371088
		pgs[10] = "shape.wdf"
	elseif pg == "九瓣莲花_神天兵_普通" then
		pgs[1] = 697482824
		pgs[2] = 697482824
		pgs[3] = 1082828846
		pgs[4] = 1141897393
		pgs[6] = 3748355701
		pgs[7] = 616355012
		pgs[8] = 2187902545
		pgs[9] = 927580732
		pgs[10] = "shape.wdf"
	elseif pg == "龙筋_狐美人_普通" then
		pgs[1] = 3760276395
		pgs[2] = 3760276395
		pgs[3] = 53105381
		pgs[4] = 3304310422
		pgs[6] = 1123548549
		pgs[7] = 478714521
		pgs[8] = 3148732170
		pgs[9] = 61804478
		pgs[10] = "shape.wdf"
	elseif pg == "龙筋_英女侠_普通" then
		pgs[1] = 983659718
		pgs[2] = 983659718
		pgs[3] = 4209944243
		pgs[4] = 1910275062
		pgs[6] = 2426563525
		pgs[7] = 3749832411
		pgs[8] = 277618128
		pgs[9] = 1847888299
		pgs[10] = "shape.wdf"
	elseif pg == "灵蛇_英女侠旧_普通" then
		pgs[1] = 262
		pgs[2] = 262
		pgs[3] = 264
		pgs[4] = 261
		pgs[6] = 272
		pgs[7] = 263
		pgs[8] = 265
		pgs[9] = 407
		pgs[10] = "shape.wdf"
	elseif pg == "如意_飞燕女_普通" then
		pgs[1] = 361357102
		pgs[2] = 361357102
		pgs[3] = 1779832361
		pgs[4] = 1983738335
		pgs[6] = 1018400713
		pgs[7] = 3356485876
		pgs[8] = 1369851554
		pgs[9] = 4083603000
		pgs[10] = "shape.wdf"
	elseif pg == "吹雪_狐美人_普通" then
		pgs[1] = 2782365575
		pgs[2] = 2782365575
		pgs[3] = 2863024953
		pgs[4] = 2075646427
		pgs[6] = 1793299889
		pgs[7] = 3492647849
		pgs[8] = 4255111126
		pgs[9] = 3079814036
		pgs[10] = "shape.wdf"
	elseif pg == "阴阳_飞燕女_普通" then
		pgs[1] = 308284096
		pgs[2] = 308284096
		pgs[3] = 1909875299
		pgs[4] = 624581176
		pgs[6] = 2662103332
		pgs[7] = 338180652
		pgs[8] = 2211026380
		pgs[9] = 162524465
		pgs[10] = "shape.wdf"
	elseif pg == "吹雪_英女侠旧_普通" then
		pgs[1] = 120
		pgs[2] = 120
		pgs[3] = 128
		pgs[4] = 119
		pgs[6] = 130
		pgs[7] = 121
		pgs[8] = 129
		pgs[9] = 117
		pgs[10] = "shape.wdf"
	elseif pg == "晃金仙绳_玄彩娥_普通" then
		pgs[1] = 2648596978
		pgs[2] = 2648596978
		pgs[3] = 3580927340
		pgs[4] = 2708781818
		pgs[6] = 1007388957
		pgs[7] = 629130124
		pgs[8] = 99182575
		pgs[9] = 359094555
		pgs[10] = "shape.wdf"
	elseif pg == "撕天_狐美人_普通" then
		pgs[1] = 3142217049
		pgs[2] = 3142217049
		pgs[3] = 448133610
		pgs[4] = 3204327512
		pgs[6] = 2232734491
		pgs[7] = 2803578940
		pgs[8] = 1204989569
		pgs[9] = 3697845403
		pgs[10] = "shape.wdf"
	elseif pg == "乾坤_舞天姬_普通" then
		pgs[1] = 266685423
		pgs[2] = 266685423
		pgs[3] = 2851409574
		pgs[4] = 3890863565
		pgs[6] = 1515127869
		pgs[7] = 256273093
		pgs[8] = 2425863420
		pgs[9] = 615875314
		pgs[10] = "shape.wdf"
	-- 新增武器
	elseif pg == "擒龙_剑侠客_普通" then
		pgs[1] = 2066485351
		pgs[2] = 2066485351
		pgs[3] = 3200400983
		pgs[4] = 4074782058
		pgs[6] = 2739156816
		pgs[7] = 2620255839
		pgs[8] = 3164581880
		pgs[9] = 0839277591
		pgs[10] = "shape.dll"
	elseif pg == "擒龙_逍遥生_普通" then
		pgs[1] = 2313480743
		pgs[2] = 2313480743
		pgs[3] = 1394178168
		pgs[4] = 3931344485
		pgs[6] = 4049254285
		pgs[7] = 1046891202
		pgs[8] = 2147278343
		pgs[9] = 4088283715
		pgs[10] = "shape.dll"
	-- 召唤兽饰品

	elseif pg == "海星_饰品_普通"then
	   pgs[6] = 0xB493BB73
	   pgs[9] = 0xDE6C1E4F
	   pgs[8] = 0xE7B23E25
	   pgs[5] = 0x78A6332D
	   pgs[4] = 0xED0FEFF2
	   pgs[1] = 0xED1A0CFB
	   pgs[2] = 0x0F9000C0
	   pgs[7] = 0xE614E1D3
	   pgs[3] = 0x76A91B64
		pgs[10] = "shape.dll"




	elseif pg == "金身罗汉_饰品_普通" then
		pgs[1] = 0xF03453FF
		pgs[2] = 0x025E7649
		pgs[3] = 0x1B2DB29F
		pgs[4] = 0x5DAA3352
		pgs[6] = 0x676E4514
		pgs[7] = 0xA1592F3C
		pgs[8] = 0x1BD399D4
		pgs[9] = 0xE661D1C4
		pgs[10] = "shape.dll"
	elseif pg == "曼珠沙华_饰品_普通" then
		pgs[1] = 2317095498
		pgs[2] = 849834035
		pgs[3] = 2636792557
		pgs[4] = 3633408982
		pgs[6] = 2259035885
		pgs[7] = 2580792640
		pgs[8] = 3524643380
		pgs[9] = 3958834151
		pgs[10] = "shape.dll"
	elseif pg == "修罗傀儡妖_饰品_普通" then
		pgs[1] = 0420253972
		pgs[2] = 0342977654
		pgs[3] = 2177416929
		pgs[4] = 1819772183
		pgs[6] = 1497548360
		pgs[7] = 2277326627
		pgs[8] = 2896859424
		pgs[9] = 2552853662
		pgs[10] = "shape.dll"
	elseif pg == "蜃气妖_饰品_普通" then
		pgs[1] = 0854139860
		pgs[2] = 3530931959
		pgs[3] = 1824546331
		pgs[4] = 1304625856
		pgs[6] = 2619382823
		pgs[7] = 1813318860
		pgs[8] = 4221810370
		pgs[9] = 1098681578
		pgs[10] = "shape.dll"
	-- elseif pg == "蔓藤妖花_饰品_普通" then
	-- 	pgs[1] = 4214261687
	-- 	pgs[2] = 3057100362
	-- 	pgs[3] = 1121748098
	-- 	pgs[4] = 37949006
	-- 	pgs[6] = 208262235
	-- 	pgs[7] = 1684774168
	-- 	pgs[8] = 3190746990
	-- 	pgs[9] = 883329921
	-- 	pgs[10] = "shape.dll"
	elseif pg == "修罗傀儡鬼_饰品_普通" then
		pgs[1] = 2449444902
		pgs[2] = 4153916126
		pgs[3] = 2714571622
		pgs[4] = 2916144736
		pgs[6] = 2056878163
		pgs[7] = 1864393258
		pgs[8] = 569784461
		pgs[9] = 46409968
		pgs[10] = "shape.dll"
	elseif pg == "巨力神猿_饰品_普通" then
		pgs[1] = 3038073317
		pgs[2] = 3038073317
		pgs[3] = 4122897891
		pgs[4] = 832384200
		pgs[6] = 3839257445
		pgs[7] = 963583986
		pgs[8] = 3871344022
		pgs[9] = 2087129752
		pgs[10] = "shape.dll"
	elseif pg == "长眉灵猴_饰品_普通" then
		pgs[1] = 0523716420
		pgs[2] = 0523716420
		pgs[3] = 1716304351
		pgs[4] = 0342538825
		pgs[6] = 2163676405
		pgs[7] = 3202812229
		pgs[8] = 2490481092
		pgs[9] = 3465520327
		pgs[10] = "shape.dll"
	elseif pg == "龙龟_饰品_普通" then
		pgs[1] = 4236041856
		pgs[2] = 1569996023
		pgs[3] = 4200424006
		pgs[4] = 2263379169
		pgs[6] = 3443209915
		pgs[7] = 2780205951
		pgs[8] = 4112109433
		pgs[9] = 3913649595
		pgs[10] = "shape.dll"
	elseif pg == "红萼仙子_饰品_普通" then
		pgs[1] = 3151975234
		pgs[2] = 1196901001
		pgs[3] = 3282586790
		pgs[4] = 1747543237
		pgs[6] = 2064260942
		pgs[7] = 570751236
		pgs[8] = 3044170857
		pgs[9] = 2428138668
		pgs[10] = "shape.dll"
	elseif pg == "大力金刚_饰品_普通" then
		pgs[1] = 0248042529
		pgs[2] = 0248042529
		pgs[3] = 1913558866
		pgs[4] = 2059841352
		pgs[6] = 0695374251
		pgs[7] = 0831557948
		pgs[8] = 2456933099
		pgs[9] = 0853948815
		pgs[10] = "shape.dll"
	elseif pg == "雾中仙_饰品_普通" then
		pgs[1] = 4160484117
		pgs[2] = 4160484117
		pgs[3] = 0779864831
		pgs[4] = 3695693170
		pgs[6] = 3371003518
		pgs[7] = 3294354660
		pgs[8] = 1567558104
		pgs[9] = 3658814300
		pgs[10] = "shape.dll"
	elseif pg == "灵鹤_饰品_普通" then
		pgs[1] = 2262979874
		pgs[2] = 2262979874
		pgs[3] = 4202705707
		pgs[4] = 2263379169
		pgs[6] = 259543323
		pgs[7] = 1142568018
		pgs[8] = 237294734
		pgs[9] = 3392312624
		pgs[10] = "shape.dll"
	elseif pg == "夜罗刹_饰品_普通" then
		pgs[1] = 2856885331
		pgs[2] = 2856885331
		pgs[3] = 0086918518
		pgs[4] = 4122029303
		pgs[6] = 3650142004
		pgs[7] = 2409112847
		pgs[8] = 2250352058
		pgs[9] = 351247023
		pgs[10] = "shape.dll"
	elseif pg == "持国巡守_饰品_普通" then
		pgs[1] = 2671541795
		pgs[2] = 2671541795
		pgs[3] = 0366025564
		pgs[4] = 1224940167
		pgs[6] = 2109179609
		pgs[7] = 1452371771
		pgs[8] = 3238209904
		pgs[9] = 0311713284
		pgs[10] = "shape.dll"
	elseif pg == "鬼将_饰品_普通" then
		pgs[1] = 0616095302
		pgs[2] = 1197215229
		pgs[3] = 2529893689
		pgs[4] = 0418681955
		pgs[6] = 3666200993
		pgs[7] = 0148218758
		pgs[8] = 3734274497
		pgs[9] = 3321162020
		pgs[10] = "shape.dll"
	elseif pg == "吸血鬼_饰品_普通" then
		pgs[1] = 3590527920
		pgs[2] = 3171509091
		pgs[3] = 512934183
		pgs[4] = 0943413673
		pgs[6] = 3726816684
		pgs[7] = 3615173504
		pgs[8] = 392952768
		pgs[9] = 3619461634
		pgs[10] = "shape.dll"
	elseif pg == "幽灵_饰品_普通" then
		pgs[1] = 0243535650
		pgs[2] = 3793136552
		pgs[3] = 4063459357
		pgs[4] = 0943413673
		pgs[6] = 0221669070
		pgs[7] = 3615173504
		pgs[8] = 2951941466
		pgs[9] = 1617333511
		pgs[10] = "shape.dll"
	elseif pg == "画魂_饰品_普通" then
		pgs[1] = 4185991899
		pgs[2] = 2765493229
		pgs[3] = 1155623764
		pgs[4] = 2877479373
		pgs[6] = 3955975204
		pgs[7] = 1770979928
		pgs[8] = 631357825
		pgs[9] = 2686032392
		pgs[10] = "shape.dll"
	elseif pg == "幽萤娃娃_饰品_普通" then
		pgs[1] = 3100497660
		pgs[2] = 2288910562
		pgs[3] = 0078833491
		pgs[4] = 534074471
		pgs[6] = 0291283863
		pgs[7] = 2620956795
		pgs[8] = 1900505124
		pgs[9] = 2254194962
		pgs[10] = "shape.dll"
	elseif pg == "噬天虎_饰品_普通" then
		pgs[1] = 3445672828
		pgs[2] = 3445672828
		pgs[3] = 0944643151
		pgs[4] = 1866252113
		pgs[6] = 0453487187
		pgs[7] = 4118556548
		pgs[8] = 877233757
		pgs[9] = 2909769871
		pgs[10] = "shape.dll"
	elseif pg == "律法女娲_饰品_普通" then
		pgs[1] = 2323776709
		pgs[2] = 0935572776
		pgs[3] = 2697501805
		pgs[4] = 2474579287
		pgs[6] = 2477757802
		pgs[7] = 3481604899
		pgs[8] = 1535493420
		pgs[9] = 1056190338
		pgs[10] = "shape.dll"
	elseif pg == "灵符女娲_饰品_普通" then
		pgs[1] = 0003090846
		pgs[2] = 3813831413
		pgs[3] = 0153076923
		pgs[4] = 3046255915
		pgs[6] = 1197898561
		pgs[7] = 4286788669
		pgs[8] = 2508613359
		pgs[9] = 1975880080
		pgs[10] = "shape.dll"
	elseif pg == "天兵_饰品_普通" then
		pgs[1] = 3589082614
		pgs[2] = 3589082614
		pgs[3] = 2799459652
		pgs[4] = 1431436302
		pgs[6] = 4005260775
		pgs[7] = 2310242932
		pgs[8] = 0261461703
		pgs[9] = 3588105226
		pgs[10] = "shape.dll"
	elseif pg == "雷鸟人_饰品_普通" then
		pgs[1] = 4191158253
		pgs[2] = 4191158253
		pgs[3] = 121154274
		pgs[4] = 580743854
		pgs[6] = 3525864488
		pgs[7] = 345331361
		pgs[8] = 2968785456
		pgs[9] = 2952405085
		pgs[10] = "shape.dll"
	elseif pg == "凤凰_饰品_普通" then
		pgs[1] = 2317320870
		pgs[2] = 2317320870
		pgs[3] = 3631288812
		pgs[4] = 3074741946
		pgs[6] = 3213916219
		pgs[7] = 1747324301
		pgs[8] = 3482276200
		pgs[9] = 2295632088
		pgs[10] = "shape.dll"
	elseif pg == "进阶毗舍童子_饰品_普通" then
		pgs[1] = 3962829865
		pgs[2] = 1588953244
		pgs[3] = 3111788471
		pgs[4] = 3123789597
		pgs[6] = 0546360664
		pgs[7] = 3962025927
		pgs[8] = 4085290579
		pgs[9] = 3523832617
		pgs[10] = "shape.dll"
	elseif pg == "进阶毗舍童子_饰品_普通" then
		pgs[1] = 2673292069
		pgs[2] = 1981279108
		pgs[3] = 2689732621
		pgs[4] = 1883247869
		pgs[6] = 3632830999
		pgs[7] = 2181794953
		pgs[8] = 3663424761
		pgs[9] = 3107041363
		pgs[10] = "shape.dll"
	elseif pg == "真陀护法_饰品_普通" then
		pgs[1] = 4144532136
		pgs[2] = 1768800860
		pgs[3] = 0020900420
		pgs[4] = 0521651285
		pgs[6] = 1856395139
		pgs[7] = 3019401759
		pgs[8] = 3630034166
		pgs[9] = 1209544518
		pgs[10] = "shape.dll"
	elseif pg == "进阶黑山老妖_饰品_普通" then
		pgs[1] = 0345057684
		pgs[2] = 0047511186
		pgs[3] = 0859849420
		pgs[4] = 3522429858
		pgs[6] = 3354659179
		pgs[7] = 1655626164
		pgs[8] = 0031651577
		pgs[9] = 0472804254
		pgs[10] = "shape.dll"
	elseif pg == "进阶千年蛇魅_饰品_普通" then
		pgs[1] = 0684983675
		pgs[2] = 0839744438
		pgs[3] = 2451665711
		pgs[4] = 1323385682
		pgs[6] = 0803293421
		pgs[7] = 0803293421
		pgs[8] = 3507665223
		pgs[9] = 3943404282
		pgs[10] = "shape.dll"
	elseif pg == "进阶狂豹人形_饰品_普通" then
		pgs[1] = 0742343767
		pgs[2] = 0742343767
		pgs[3] = 3793367799
		pgs[4] = 4052747504
		pgs[6] = 0542004089
		pgs[7] = 2048358837
		pgs[8] = 4170501480
		pgs[9] = 3178866389
		pgs[10] = "shape.dll"
	elseif pg == "进阶吸血鬼_饰品_普通" then
		pgs[1] = 0512348717
		pgs[2] = 2687552467
		pgs[3] = 3873134131
		pgs[4] = 0626792005
		pgs[6] = 0542004089
		pgs[7] = 3157202698
		pgs[8] = 1580632831
		pgs[9] = 0x5E368AFF
		pgs[10] = "shape.dll"
	-- 新增人物
	elseif pg == "偃无师_普通" then
		pgs[1] = 0x00000097
		pgs[2] = 0x00000097
		pgs[3] = 0x00000100
		pgs[4] = 0x00000096
		pgs[6] = 0x00000095
		pgs[7] = 0x00000099
		pgs[8] = 0x00000101
		pgs[9] = 0x00000094
		pgs[10] = "common/shape.wda"
	elseif pg == "偃无师_巨剑" then
		pgs[1] = 0x00000097
		pgs[2] = 0x00000097
		pgs[3] = 0x00000100
		pgs[4] = 0x00000096
		pgs[6] = 0x00000095
		pgs[7] = 0x00000099
		pgs[8] = 0x00000101
		pgs[9] = 0x00000094
		pgs[10] = "common/shape.wda"
	elseif pg == "钝铁重剑_偃无师_普通" then
		pgs[1] = 0x00000036
		pgs[2] = 0x00000036
		pgs[3] = 0x00000084
		pgs[4] = 0x00000025
		pgs[6] = 0x00000013
		pgs[7] = 0x00000037
		pgs[8] = 0x00000072
		pgs[9] = 0x00000002
		pgs[10] = "common/shape.wda"
	elseif pg == "壁玉长铗_偃无师_普通" then
		pgs[1] = 0x00000043
		pgs[2] = 0x00000043
		pgs[3] = 0x00000090
		pgs[4] = 0x00000031
		pgs[6] = 0x00000019
		pgs[7] = 0x00000054
		pgs[8] = 0x00000066
		pgs[9] = 0x00000008
		pgs[10] = "common/shape.wda"
	elseif pg == "惊涛雪_偃无师_普通" then
		pgs[1] = 0x00000049
		pgs[2] = 0x00000049
		pgs[3] = 0x00000085
		pgs[4] = 0x00000026
		pgs[6] = 0x00000014
		pgs[7] = 0x00000038
		pgs[8] = 0x00000048
		pgs[9] = 0x00000003
		pgs[10] = "common/shape.wda"
	elseif pg == "鸦九_偃无师_普通" then
		pgs[1] = 0x00000045
		pgs[2] = 0x00000045
		pgs[3] = 0x00000091
		pgs[4] = 0x00000033
		pgs[6] = 0x00000021
		pgs[7] = 0x00000055
		pgs[8] = 0x00000067
		pgs[9] = 0x00000010
		pgs[10] = "common/shape.wda"
	elseif pg == "昆吾_偃无师_普通" then
		pgs[1] = 0x00000047
		pgs[2] = 0x00000047
		pgs[3] = 0x00000086
		pgs[4] = 0x00000027
		pgs[6] = 0x00000015
		pgs[7] = 0x00000039
		pgs[8] = 0x00000051
		pgs[9] = 0x00000004
		pgs[10] = "common/shape.wda"
	elseif pg == "弦歌_偃无师_普通" then
		pgs[1] = 0x00000057
		pgs[2] = 0x00000057
		pgs[3] = 0x00000093
		pgs[4] = 0x00000034
		pgs[6] = 0x00000023
		pgs[7] = 0x00000046
		pgs[8] = 0x00000082
		pgs[9] = 0x00000011
		pgs[10] = "common/shape.wda"
	elseif pg == "墨骨枯麟_偃无师_普通" then
		pgs[1] = 0x00000040
		pgs[2] = 0x00000040
		pgs[3] = 0x00000087
		pgs[4] = 0x00000028
		pgs[6] = 0x00000016
		pgs[7] = 0x00000053
		pgs[8] = 0x00000063
		pgs[9] = 0x00000005
		pgs[10] = "common/shape.wda"
	elseif pg == "腾蛇郁刃_偃无师_普通" then
		pgs[1] = 0x00000042
		pgs[2] = 0x00000042
		pgs[3] = 0x00000089
		pgs[4] = 0x00000030
		pgs[6] = 0x00000018
		pgs[7] = 0x00000052
		pgs[8] = 0x00000103
		pgs[9] = 0x00000007
		pgs[10] = "common/shape.wda"
	elseif pg == "秋水澄流_偃无师_普通" then
		pgs[1] = 0x000000105
		pgs[2] = 0x000000105
		pgs[3] = 0x00000088
		pgs[4] = 0x00000029
		pgs[6] = 0x00000017
		pgs[7] = 0x00000041
		pgs[8] = 0x00000064
		pgs[9] = 0x00000006
		pgs[10] = "common/shape.wda"
	elseif pg == "百辟镇魂_偃无师_普通" then
		pgs[1] = 0x00000035
		pgs[2] = 0x00000035
		pgs[3] = 0x00000083
		pgs[4] = 0x00000024
		pgs[6] = 0x00000012
		pgs[7] = 0x00000106
		pgs[8] = 0x00000107
		pgs[9] = 0x00000001
		pgs[10] = "common/shape.wda"
	elseif pg == "长息_偃无师_普通" then
		pgs[1] = 0x00000044
		pgs[2] = 0x00000044
		pgs[3] = 0x00000092
		pgs[4] = 0x00000032
		pgs[6] = 0x00000020
		pgs[7] = 0x00000108
		pgs[8] = 0x00000109
		pgs[9] = 0x00000009
		pgs[10] = "common/shape.wda"
	elseif pg == "桃夭夭_普通" then
		pgs[1] = 0x00000088
		pgs[2] = 0x00000088
		pgs[3] = 0x00000094
		pgs[4] = 0x00000087
		pgs[6] = 0x00000086
		pgs[7] = 0x00000089
		pgs[8] = 0x00000092
		pgs[9] = 0x00000085
		pgs[10] = "common/shape.wdb"
	elseif pg == "桃夭夭_灯笼" then
		pgs[1] = 0x00000088
		pgs[2] = 0x00000088
		pgs[3] = 0x00000094
		pgs[4] = 0x00000087
		pgs[6] = 0x00000086
		pgs[7] = 0x00000089
		pgs[8] = 0x00000092
		pgs[9] = 0x00000085
		pgs[10] = "common/shape.wdb"
	elseif pg == "素纸灯_桃夭夭_普通" then
		pgs[1] = 0x00000037
		pgs[2] = 0x00000037
		pgs[3] = 0x00000080
		pgs[4] = 0x00000027
		pgs[6] = 0x00000017
		pgs[7] = 0x00000070
		pgs[8] = 0x00000048
		pgs[9] = 0x00000006
		pgs[10] = "common/shape.wdb"
	elseif pg == "如意宫灯_桃夭夭_普通" then
		pgs[1] = 0x00000036
		pgs[2] = 0x00000036
		pgs[3] = 0x00000079
		pgs[4] = 0x00000026
		pgs[6] = 0x00000016
		pgs[7] = 0x00000069
		pgs[8] = 0x00000047
		pgs[9] = 0x00000005
		pgs[10] = "common/shape.wdb"
	elseif pg == "玉兔盏_桃夭夭_普通" then
		pgs[1] = 0x00000039
		pgs[2] = 0x00000039
		pgs[3] = 0x00000082
		pgs[4] = 0x00000029
		pgs[6] = 0x00000019
		pgs[7] = 0x00000072
		pgs[8] = 0x00000050
		pgs[9] = 0x00000008
		pgs[10] = "common/shape.wdb"
	elseif pg == "蟠龙_桃夭夭_普通" then
		pgs[1] = 0x00000035
		pgs[2] = 0x00000035
		pgs[3] = 0x00000078
		pgs[4] = 0x00000025
		pgs[6] = 0x00000046
		pgs[7] = 0x00000068
		pgs[8] = 0x00000046
		pgs[9] = 0x00000004
		pgs[10] = "common/shape.wdb"
	elseif pg == "云鹤_桃夭夭_普通" then
		pgs[1] = 0x00000041
		pgs[2] = 0x00000041
		pgs[3] = 0x00000084
		pgs[4] = 0x00000031
		pgs[6] = 0x00000021
		pgs[7] = 0x00000073
		pgs[8] = 0x00000052
		pgs[9] = 0x00000010
		pgs[10] = "common/shape.wdb"
	elseif pg == "风荷_桃夭夭_普通" then
		pgs[1] = 0x00000032
		pgs[2] = 0x00000032
		pgs[3] = 0x00000074
		pgs[4] = 0x00000022
		pgs[6] = 0x00000011
		pgs[7] = 0x00000064
		pgs[8] = 0x00000042
		pgs[9] = 0x00000001
		pgs[10] = "common/shape.wdb"
	elseif pg == "金风玉露_桃夭夭_普通" then
		pgs[1] = 0x00000033
		pgs[2] = 0x00000033
		pgs[3] = 0x00000077
		pgs[4] = 0x00000029
		pgs[6] = 0x00000054
		pgs[7] = 0x00000067
		pgs[8] = 0x00000014
		pgs[9] = 0x00000107
		pgs[10] = "common/shape.wdb"
	elseif pg == "凰火燎原_桃夭夭_普通" then
		pgs[1] = 0x00000034
		pgs[2] = 0x00000034
		pgs[3] = 0x00000076
		pgs[4] = 0x00000024
		pgs[6] = 0x00000055
		pgs[7] = 0x00000066
		pgs[8] = 0x00000013
		pgs[9] = 0x00000002
		pgs[10] = "common/shape.wdb"
	elseif pg == "月露清愁_桃夭夭_普通" then
		pgs[1] = 0x00000106
		pgs[2] = 0x00000106
		pgs[3] = 0x00000083
		pgs[4] = 0x00000030
		pgs[6] = 0x00000020
		pgs[7] = 0x00000040
		pgs[8] = 0x00000051
		pgs[9] = 0x00000009
		pgs[10] = "common/shape.wdb"
	elseif pg == "夭桃秾李_桃夭夭_普通" then
		pgs[1] = 0x00000038
		pgs[2] = 0x00000038
		pgs[3] = 0x00000081
		pgs[4] = 0x00000028
		pgs[6] = 0x00000018
		pgs[7] = 0x00000071
		pgs[8] = 0x00000049
		pgs[9] = 0x00000007
		pgs[10] = "common/shape.wdb"
	elseif pg == "荒尘_桃夭夭_普通" then
		pgs[1] = 0x00000108
		pgs[2] = 0x00000108
		pgs[3] = 0x00000075
		pgs[4] = 0x00000023
		pgs[6] = 0x00000012
		pgs[7] = 0x00000065
		pgs[8] = 0x00000043
		pgs[9] = 0x00000003
		pgs[10] = "common/shape.wdb"
	elseif pg == "鬼潇潇_普通" then
		pgs[1] = 0x00000041
		pgs[2] = 0x00000041
		pgs[3] = 0x00000101
		pgs[4] = 0x00000029
		pgs[6] = 0x00000107
		pgs[7] = 0x00000089
		pgs[8] = 0x00000077
		pgs[9] = 0x00000011
		pgs[10] = "common/shape.wdc"
	elseif pg == "鬼潇潇_伞" then
		pgs[1] = 0x00000041
		pgs[2] = 0x00000041
		pgs[3] = 0x00000101
		pgs[4] = 0x00000029
		pgs[6] = 0x00000107
		pgs[7] = 0x00000089
		pgs[8] = 0x00000077
		pgs[9] = 0x00000011
		pgs[10] = "common/shape.wdc"
	elseif pg == "红罗伞_鬼潇潇_普通" then
		pgs[1] = 0x00000034
		pgs[2] = 0x00000034
		pgs[3] = 0x00000094
		pgs[4] = 0x00000022
		pgs[6] = 0x00000108
		pgs[7] = 0x00000082
		pgs[8] = 0x00000046
		pgs[9] = 0x00000004
		pgs[10] = "common/shape.wdc"
	elseif pg == "琳琅盖_鬼潇潇_普通" then
		pgs[1] = 0x00000036
		pgs[2] = 0x00000036
		pgs[3] = 0x00000096
		pgs[4] = 0x00000024
		pgs[6] = 0x00000109
		pgs[7] = 0x00000084
		pgs[8] = 0x00000048
		pgs[9] = 0x00000006
		pgs[10] = "common/shape.wdc"
	elseif pg == "碧火琉璃_鬼潇潇_普通" then
		pgs[1] = 0x00000031
		pgs[2] = 0x00000031
		pgs[3] = 0x00000091
		pgs[4] = 0x00000020
		pgs[6] = 0x00000013
		pgs[7] = 0x00000079
		pgs[8] = 0x00000046
		pgs[9] = 0x00000001
		pgs[10] = "common/shape.wdc"
	elseif pg == "浮生归梦_鬼潇潇_普通" then
		pgs[1] = 0x00000032
		pgs[2] = 0x00000032
		pgs[3] = 0x00000092
		pgs[4] = 0x00000104
		pgs[6] = 0x00000014
		pgs[7] = 0x00000080
		pgs[8] = 0x00000044
		pgs[9] = 0x00000002
		pgs[10] = "common/shape.wdc"
	elseif pg == "鬼骨_鬼潇潇_普通" then
		pgs[1] = 0x00000033
		pgs[2] = 0x00000033
		pgs[3] = 0x00000093
		pgs[4] = 0x00000021
		pgs[6] = 0x00000015
		pgs[7] = 0x00000081
		pgs[8] = 0x00000045
		pgs[9] = 0x00000003
		pgs[10] = "common/shape.wdc"
	elseif pg == "金刚伞_鬼潇潇_普通" then
		pgs[1] = 0x00000035
		pgs[2] = 0x00000035
		pgs[3] = 0x00000095
		pgs[4] = 0x00000023
		pgs[6] = 0x00000111
		pgs[7] = 0x00000083
		pgs[8] = 0x00000047
		pgs[9] = 0x00000005
		pgs[10] = "common/shape.wdc"
	elseif pg == "晴雪_鬼潇潇_普通" then
		pgs[1] = 0x00000037
		pgs[2] = 0x00000037
		pgs[3] = 0x00000097
		pgs[4] = 0x00000025
		pgs[6] = 0x00000016
		pgs[7] = 0x00000085
		pgs[8] = 0x00000070
		pgs[9] = 0x00000007
		pgs[10] = "common/shape.wdc"
	elseif pg == "雪羽穿云_鬼潇潇_普通" then
		pgs[1] = 0x00000038
		pgs[2] = 0x00000038
		pgs[3] = 0x00000098
		pgs[4] = 0x00000026
		pgs[6] = 0x00000017
		pgs[7] = 0x00000086
		pgs[8] = 0x00000075
		pgs[9] = 0x00000008
		pgs[10] = "common/shape.wdc"
	elseif pg == "月影星痕_鬼潇潇_普通" then
		pgs[1] = 0x00000039
		pgs[2] = 0x00000039
		pgs[3] = 0x00000099
		pgs[4] = 0x00000027
		pgs[6] = 0x00000018
		pgs[7] = 0x00000087
		pgs[8] = 0x00000076
		pgs[9] = 0x00000009
		pgs[10] = "common/shape.wdc"
	elseif pg == "云梦_鬼潇潇_普通" then
		pgs[1] = 0x00000040
		pgs[2] = 0x00000040
		pgs[3] = 0x00000100
		pgs[4] = 0x00000028
		pgs[6] = 0x00000114
		pgs[7] = 0x00000088
		pgs[8] = 0x00000052
		pgs[9] = 0x00000010
		pgs[10] = "common/shape.wdc"
	elseif pg == "枕霞_鬼潇潇_普通" then
		pgs[1] = 0x00000042
		pgs[2] = 0x00000042
		pgs[3] = 0x00000102
		pgs[4] = 0x00000030
		pgs[6] = 0x00000115
		pgs[7] = 0x00000090
		pgs[8] = 0x00000116
		pgs[9] = 0x00000012
		pgs[10] = "common/shape.wdc"
	elseif pg == "进阶小毛头_普通" then
		pgs[1] = 0179221513
		pgs[2] = 1698489970
		pgs[3] = 0470913936
		pgs[4] = 1915078690
		pgs[6] = 0971500000
		pgs[7] = 0772024396
		pgs[8] = 1215424071
		pgs[9] = 3278329933
		pgs[10] = "shape.dll"
	elseif pg == "进阶小丫丫_普通" then
		pgs[1] = 2793842787
		pgs[2] = 2389923758
		pgs[3] = 2134660405
		pgs[4] = 2149284387
		pgs[6] = 2208239081
		pgs[7] = 3839456479
		pgs[8] = 3704578162
		pgs[9] = 2756670279
		pgs[10] = "shape.dll"
	elseif pg == "进阶小仙灵_普通" then
		pgs[1] = 3528533994
		pgs[2] = 1748126394
		pgs[3] = 3314608514
		pgs[4] = 0555153309
		pgs[6] = 3365226905
		pgs[7] = 2983479980
		pgs[8] = 1559486586
		pgs[9] = 0604452233
		pgs[10] = "shape.dll"
	elseif pg == "进阶小仙女_普通" then
		pgs[1] = 1740089337
		pgs[2] = 3117386574
		pgs[3] = 1262446888
		pgs[4] = 2711756302
		pgs[6] = 0486722787
		pgs[7] = 1781277591
		pgs[8] = 4027936138
		pgs[9] = 0604252314
		pgs[10] = "shape.dll"
	elseif pg == "进阶小精灵_普通" then
		pgs[1] = 2914903717
		pgs[2] = 3322076526
		pgs[3] = 3825990536
		pgs[4] = 2480664885
		pgs[6] = 2840565140
		pgs[7] = 2404330347
		pgs[8] = 4224681295
		pgs[9] = 2599965715
		pgs[10] = "shape.dll"
	elseif pg == "进阶小魔头_普通" then
		pgs[1] = 2084642762
		pgs[2] = 3514114961
		pgs[3] = 3055273026
		pgs[4] = 2628373509
		pgs[6] = 1765746818
		pgs[7] = 3396990566
		pgs[8] = 2351147435
		pgs[9] = 3555153940
		pgs[10] = "shape.dll"
	-- elseif pg == "超级玉兔_普通" then
	-- 	pgs[1] = 0xB9EB5837
	-- 	pgs[2] = 0xB9EB5837
	-- 	pgs[3] = 0x6C8E114F
	-- 	pgs[4] = 0xFBF07F14
	-- 	pgs[6] = 0x42C85368
	-- 	pgs[7] = 0xDA0F4915
	-- 	pgs[8] = 0x254E8F14
	-- 	pgs[9] = 0xA0EBB5DA
	-- 	pgs[10] = "common/shape.wd1"
	-- elseif pg == "超级玉兔_饰品_普通" then
	-- 	pgs[1] = 0xFB9CB18B
	-- 	pgs[2] = 0xFB9CB18B
	-- 	pgs[3] = 0xC076D1B9
	-- 	pgs[4] = 0x9A113FAE
	-- 	pgs[6] = 0x5D5BC343
	-- 	pgs[7] = 0xF8009E32
	-- 	pgs[8] = 0x82907F23
	-- 	pgs[9] = 0xFC108242
	-- 	pgs[10] = "common/shape.wd1"
	elseif pg == "哮天犬_普通" then
		pgs[1] = 0xAA0683ED
		pgs[2] = 0xEBB6057C
		pgs[3] = 0xFB7E93DE
		pgs[4] = 0x80599206
		pgs[6] = 0xDE1355D4
		pgs[7] = 0xE06F5D8A
		pgs[8] = 0x603FCBF9
		pgs[9] = 0x9856C8FF
		pgs[10] = "shape.wdf"
	elseif pg == "帮派妖兽_普通" then
		pgs[1] = 0x0001957A
		pgs[2] = 0x0001957A
		pgs[3] = 0x00017EBD
		pgs[4] = 0x00018A35
		pgs[6] = 0x0001738D
		pgs[7] = 0x0001C235
		pgs[8] = 0x0001ABEB
		pgs[9] = 0x00016815
		pgs[10] = "shape.dll"
	-- 普通召唤兽
	elseif pg == "进阶毗舍童子_普通" then
		pgs[1] = 0x1A04C90E
		pgs[2] = 0x1A04C90E
		pgs[3] = 0xCCDDD94C
		pgs[4] = 0x42A2E9E0
		pgs[6] = 0x7C15F7DE
        pgs[7] = 0x1CB769CA
        pgs[8] = 0x1C29D8BC
        pgs[9] = 0x40D008F4
        pgs[10] = "shape.dll"
	elseif pg == "狂豹_普通" then
	    pgs[1] = 0x19900128
		pgs[2] = 0x19900128
		pgs[3] = 0x19900126
		pgs[4] = 0x19900127
		pgs[6] = 0x19900125
        pgs[7] = 0x19900132
        pgs[8] = 0x19900131
        pgs[9] = 0x19900124
        pgs[10] = "shape.dll"
	elseif pg == "毗舍童子_普通" then
	    pgs[1] = 0xF449F7B5
		pgs[2] = 0xF449F7B5
		pgs[3] = 0x3976A73D
		pgs[4] = 0xFC2044B9
		pgs[6] = 0x60D45B9C
        pgs[7] = 0x371990E9
        pgs[8] = 0x3AEB838B
        pgs[9] = 0xF63A1857
        pgs[10] = "shape.dll"
	elseif pg == "流浪剑客_普通" then
	    pgs[1] = 0xAB3F493A
		pgs[2] = 0xAB3F493A
		pgs[3] = 0x6DED77DA
		pgs[4] = 0x4286FB27
		pgs[6] = 0xA9DD17BC
        pgs[7] = 0x0D6E6F43
        pgs[8] = 0x4BC4A592
        pgs[9] = 0xA1C77A74
        pgs[10] = "shape.dll"
	elseif pg == "超级小仙女_普通" then
	    pgs[1] = 0x67B7A7F9
		pgs[2] = 0x67B7A7F9
		pgs[3] = 0x4B3F6928
		pgs[4] = 0xA1A21E0E
		pgs[6] = 0x1D02CCE3
        pgs[7] = 0x6A2C2397
        pgs[8] = 0xF0156D8A
        pgs[9] = 0x2404289A
        pgs[10] = "shape.dll"
	elseif pg == "白熊_普通" then
	    pgs[1] = 0x0000DC30
		pgs[2] = 0x0000DC30
		pgs[3] = 0x0000CEB9
		pgs[4] = 0x0000D58E
		pgs[6] = 0x0000C82C
        pgs[7] = 0x0000EFFA
        pgs[8] = 0x0000E996
        pgs[9] = 0x0000C157
        pgs[10] = "shape.dll"
	elseif pg == "大蝙蝠_普通" then
	    pgs[1] = 0x000A1DC2
		pgs[2] = 0x000A1DC2
		pgs[3] = 0x000A0BC9
		pgs[4] = 0x000A14DF
		pgs[6] = 0x000A02FB
        pgs[7] = 0x000A384F
        pgs[8] = 0x000A2FAA
        pgs[9] = 0x0009F9E5
        pgs[10] = "shape.dll"
	elseif pg == "大海龟_普通" then
	    pgs[1] = 0x000AC177
		pgs[2] = 0x000AC177
		pgs[3] = 0x000AB118
		pgs[4] = 0x000AB961
		pgs[6] = 0x000AA917
        pgs[7] = 0x000AD99D
        pgs[8] = 0x000AD1C5
        pgs[9] = 0x000AA0CE
        pgs[10] = "shape.dll"
    elseif pg == "海星_普通" then
		pgs[1] = 2925295348
		pgs[2] = 1438262125
		pgs[3] = 1252052338
		pgs[4] = 2984429886
		pgs[6] = 435482985
		pgs[7] = 821840372
		pgs[8] = 2533401592
		pgs[9] = 1325924528
		pgs[10] = "shape.dll"
	elseif pg == "浣熊_普通" then
		pgs[1] = 3067845835
		pgs[2] = 3067845835
		pgs[3] = 4280797854
		pgs[4] = 4037864245
		pgs[6] = 2856658178
		pgs[7] = 2306495634
		pgs[8] = 3507827561
		pgs[9] = 554890743
		pgs[10] = "shape.dll"
	elseif pg == "地狱战神_普通" then
	    pgs[1] = 0x000C4123
		pgs[2] = 0x000C4123
		pgs[3] = 0x000C2CC2
		pgs[4] = 0x000C370C
		pgs[6] = 0x000C22C0
        pgs[7] = 0x000C5F4C
        pgs[8] = 0x000C5573
        pgs[9] = 0x000C1876
        pgs[10] = "shape.dll"
	elseif pg == "赌徒_普通" then
	    pgs[1] = 0x000C9C40
		pgs[2] = 0x000C9C40
		pgs[3] = 0x000C8F27
		pgs[4] = 0x000C95CD
		pgs[6] = 0x000C88C9
        pgs[7] = 0x000CAF7D
        pgs[8] = 0x000CA948
        pgs[9] = 0x000C8223
        pgs[10] = "shape.dll"
	elseif pg == "风伯_普通" then
	    pgs[1] = 0x000CF67A
		pgs[2] = 0x000CF67A
		pgs[3] = 0x000CE96D
		pgs[4] = 0x000CF00D
		pgs[6] = 0x000CE315
        pgs[7] = 0x000D09A5
        pgs[8] = 0x000D0376
        pgs[9] = 0x000CDC75
        pgs[10] = "shape.dll"
	elseif pg == "凤凰_普通" then
	    pgs[1] = 0x000D3364
		pgs[2] = 0x000D3364
		pgs[3] = 0x000D25FB
		pgs[4] = 0x000D2CC9
		pgs[6] = 0x000D1F75
        pgs[7] = 0x000D4719
        pgs[8] = 0x000D40BC
        pgs[9] = 0x000D18A7
        pgs[10] = "shape.dll"
	elseif pg == "芙蓉仙子_普通" then
	    pgs[1] = 0x000D8191
		pgs[2] = 0x000D8191
		pgs[3] = 0x000D6D8A
		pgs[4] = 0x000D77A7
		pgs[6] = 0x000D63B5
        pgs[7] = 0x000D9F33
        pgs[8] = 0x000D9587
        pgs[9] = 0x000D5998
        pgs[10] = "shape.dll"
	elseif pg == "蛤蟆精_普通" then
	    pgs[1] = 0x000DE731
		pgs[2] = 0x000DE731
		pgs[3] = 0x000DD6D2
		pgs[4] = 0x000DDF1B
		pgs[6] = 0x000DCED1
        pgs[7] = 0x000DFF57
        pgs[8] = 0x000DF77F
        pgs[9] = 0x000DC688
        pgs[10] = "shape.dll"
	elseif pg == "九头精怪_普通" then
	    pgs[1] = 0x00165BB8
		pgs[2] = 0x00165BB8
		pgs[3] = 0x001648A9
		pgs[4] = 0x0016524A
		pgs[6] = 0x00163F50
        pgs[7] = 0x00168117
        pgs[8] = 0x001677E7
        pgs[9] = 0x001635AF
        pgs[10] = "shape.dll"
	elseif pg == "猪八戒_普通" then
	    pgs[1] = 0x00315EE9
		pgs[2] = 0x00315EE9
		pgs[3] = 0x00314E1A
		pgs[4] = 0x0031569B
		pgs[6] = 0x003145E1
        pgs[7] = 0x00317FC8
        pgs[8] = 0x003177B8
        pgs[9] = 0x00313D60
        pgs[10] = "shape.dll"
	elseif pg == "老虎_普通" then
	    pgs[1] = 0x0018E295
		pgs[2] = 0x0018E295
		pgs[3] = 0x0018D5AC
		pgs[4] = 0x0018DC3A
		pgs[6] = 0x0018CF66
        pgs[7] = 0x0018F58A
        pgs[8] = 0x0018EF6D
        pgs[9] = 0x0018C8D8
        pgs[10] = "shape.dll"
	elseif pg == "蛟龙_普通" then
	    pgs[1] = 0x001500E9
		pgs[2] = 0x001500E9
		pgs[3] = 0x0014F2D6
		pgs[4] = 0x0014F9F9
		pgs[6] = 0x0014EBFB
        pgs[7] = 0x0015159D
        pgs[8] = 0x00150EEB
        pgs[9] = 0x0014E4D8
        pgs[10] = "shape.dll"
	elseif pg =="天将_普通"then
	    pgs[1] = 0x0024789F
	    pgs[2] = 0x0024789F
	    pgs[3] = 0x00246B4E
	    pgs[4] = 0x00247210
	    pgs[6] = 0x002464D4
	    pgs[7] = 0x00248C30
	    pgs[8] = 0x002485DF
	    pgs[9] = 0x00245E12
	    pgs[10] = "shape.dll"
	elseif pg =="如意仙子_普通"then
		pgs[1] = 0x00202FA9
		pgs[2] = 0x00202FA9
		pgs[3] = 0x00201B4E
		pgs[4] = 0x00202595
		pgs[6] = 0x0020114F
		pgs[7] = 0x00204DC9
		pgs[8] = 0x002043F3
		pgs[9] = 0x00200708
		pgs[10] ="shape.dll"
	elseif pg =="牛头_普通"then
		pgs[1] = 0x001E5837
		pgs[2] = 0x001E5837
		pgs[3] = 0x001E4ABA
		pgs[4] = 0x001E5192
		pgs[6] = 0x001E442A
		pgs[7] = 0x001E6C0A
		pgs[8] = 0x001E65A3
		pgs[9] = 0x001E3D52
		pgs[10] ="shape.dll"
	elseif pg =="黑熊_普通"then
		pgs[1] = 0x00105310
		pgs[2] = 0x00105310
		pgs[3] = 0x0010457F
		pgs[4] = 0x0010457F
		pgs[6] = 0x00103EE5
		pgs[7] = 0x00106701
		pgs[8] = 0x00106090
		pgs[9] = 0x00103803
		pgs[10] ="shape.dll"
	elseif pg =="小龙女_普通"then
		pgs[1] = 0x002851A5
		pgs[2] = 0x002851A5
		pgs[3] = 0x00284156
		pgs[4] = 0x00284997
		pgs[6] = 0x0028395D
		pgs[7] = 0x002869B3
		pgs[8] = 0x002861E3
		pgs[9] = 0x0028311C
		pgs[10] ="shape.dll"
	elseif pg =="花妖_普通"then
		pgs[1] = 0x0012A79D
		pgs[2] = 0x0012A79D
		pgs[3] = 0x00129A2A
		pgs[4] = 0x0012A0FD
		pgs[6] = 0x0012939F
		pgs[7] = 0x0012BB61
		pgs[8] = 0x0012B4FF
		pgs[9] = 0x00128CCC
		pgs[10] ="shape.dll"
	elseif pg =="雨师_普通"then
		pgs[1] = 0x002F0D7C
		pgs[2] = 0x002F0D7C
		pgs[3] = 0x002F0011
		pgs[4] = 0x002F06E0
		pgs[6] = 0x002EF98A
		pgs[7] = 0x002F2134
		pgs[8] = 0x002F1AD6
		pgs[9] = 0x002EF2BB
		pgs[10] ="shape.dll"
	elseif pg =="牛妖_普通"then
	    pgs[1] = 0x001DC992
		pgs[2] = 0x001DC992
		pgs[3] = 0x001DB926
		pgs[4] = 0x001DC15D
		pgs[6] = 0x001DB137
		pgs[7] = 0x001DF14D
		pgs[8] = 0x001DE987
		pgs[9] = 0x001DA900
		pgs[10] ="shape.dll"
	elseif pg =="山贼_普通"then
	    pgs[1] = 0x0020CEE2
		pgs[2] = 0x0020CEE2
		pgs[3] = 0x0020C135
		pgs[4] = 0x0020C825
		pgs[6] = 0x0020BA8D
		pgs[7] = 0x0020E2FD
		pgs[8] = 0x0020DC7E
		pgs[9] = 0x0020B39D
		pgs[10] ="shape.dll"
	elseif pg =="护卫_普通"then
	    pgs[1] = 0x00126ADE
		pgs[2] = 0x00126ADE
		pgs[3] = 0x00125DF3
		pgs[4] = 0x00126482
		pgs[6] = 0x001257AC
		pgs[7] = 0x00127DD6
		pgs[8] = 0x001277B8
		pgs[9] = 0x0012511D
		pgs[10] ="shape.dll"
	elseif pg =="兔子怪_普通"then
	    pgs[1]=0x0024F9AA
		pgs[2]=0x0024F9AA
		pgs[3]=0x0024E907
		pgs[4]=0x0024F172
		pgs[6]=0x0024E0E4
		pgs[7]=0x00251236
		pgs[8]=0x00250A3C
		pgs[9]=0x0024D879
		pgs[10] ="shape.dll"
	elseif pg =="沙僧_普通"then
        pgs[1]=0x00208B55
		pgs[2]=0x00208B55
		pgs[3]=0x00207E5E
		pgs[4]=0x002084F3
		pgs[6]=0x00207811
		pgs[7]=0x0020A484
		pgs[8]=0x00209E60
		pgs[9]=0x0020717C
		pgs[10] ="shape.dll"
	elseif pg =="孙悟空_普通"then
        pgs[1]=0x00235589
		pgs[2]=0x00235589
		pgs[3]=0x0023445C
		pgs[4]=0x00234D0C
		pgs[6]=0x00233BF4
		pgs[7]=0x00237724
		pgs[8]=0x00236EE5
		pgs[9]=0x00233344
		pgs[10] ="shape.dll"
	elseif pg =="骷髅怪_普通"then
        pgs[1]=0x0017A644
		pgs[2]=0x0017A644
		pgs[3]=0x0017953B
		pgs[4]=0x00179DD9
		pgs[6]=0x00178CE5
		pgs[7]=0x0017BF69
		pgs[8]=0x0017B73C
		pgs[9]=0x00178447
		pgs[10] ="shape.dll"
	elseif pg =="黑山老妖_普通"then
        pgs[1]=0x000FEE22
		pgs[2]=0x000FEE22
		pgs[3]=0x000FDA23
		pgs[4]=0x000FE43C
		pgs[6]=0x000FF7CB
		pgs[7]=0x00101561
		pgs[8]=0x00100BB9
		pgs[9]=0x000FD052
		pgs[10] ="shape.dll"
	elseif pg =="僵尸_普通"then
        pgs[1]=0x0014B2EB
		pgs[2]=0x0014B2EB
		pgs[3]=0x0014A622
		pgs[4]=0x002084F3
		pgs[6]=0x00149FEC
		pgs[7]=0x0014C5B0
		pgs[8]=0x0014BFA3
		pgs[9]=0x0014996E
		pgs[10] ="shape.dll"
	elseif pg =="马面_普通"then
        pgs[1]=0x001CE7BC
		pgs[2]=0x001CE7BC
		pgs[3]=0x001CD9FB
		pgs[4]=0x001CE0F5
		pgs[6]=0x001CD349
		pgs[7]=0x001CFBF5
		pgs[8]=0x001CF56C
		pgs[9]=0x001CCC4F
		pgs[10] ="shape.dll"
	elseif pg =="黑熊精_普通"then
        pgs[1]=0x00109873
		pgs[2]=0x00109873
		pgs[3]=0x00108810
		pgs[4]=0x0010905B
		pgs[6]=0x0010800D
		pgs[7]=0x0010B09F
		pgs[8]=0x0010A8C5
		pgs[9]=0x001077C2
		pgs[10] ="shape.dll"
	elseif pg =="龟丞相_普通"then
        pgs[1]=0x000F0278
		pgs[2]=0x000F0278
		pgs[3]=0x000EF1C1
		pgs[4]=0x000EFA36
		pgs[6]=0x000F0A7D
		pgs[7]=0x000F2327
		pgs[8]=0x000F1B23
		pgs[9]=0x000EE994
		pgs[10] ="shape.dll"
	elseif pg =="蜘蛛精_普通"then
        pgs[1]=0x00309776
		pgs[2]=0x00309776
		pgs[3]=0x00308713
		pgs[4]=0x00308F5E
		pgs[6]=0x00307F10
		pgs[7]=0x0030AFA2
		pgs[8]=0x0030A7C8
		pgs[9]=0x003076C5
		pgs[10] ="shape.dll"
	elseif pg =="雷鸟人_普通"then
        pgs[1]=0x001947EE
		pgs[2]=0x001947EE
		pgs[3]=0x0019371F
		pgs[4]=0x00193FA0
		pgs[6]=0x00192EE6
		pgs[7]=0x001960BC
		pgs[8]=0x001958AC
		pgs[9]=0x00192665
		pgs[10] ="shape.dll"
	elseif pg =="巡游天神_普通"then
        pgs[1]=0x002B3656
		pgs[2]=0x002B3656
		pgs[3]=0x002B2219
		pgs[4]=0x002B2C51
		pgs[6]=0x002B1829
		pgs[7]=0x002B5449
		pgs[8]=0x002B4A82
		pgs[9]=0x002B0DF1
		pgs[10] ="shape.dll"
	elseif pg =="羊头怪_普通"then
        pgs[1]=0x002C3A48
		pgs[2]=0x002C3A48
		pgs[3]=0x002C298B
		pgs[4]=0x002C3203
		pgs[6]=0x002C215B
		pgs[7]=0x002C52FB
		pgs[8]=0x002C4AF4
		pgs[9]=0x002C18E3
		pgs[10] ="shape.dll"
	elseif pg =="虾兵_普通"then
        pgs[1]=0x00278343
		pgs[2]=0x00278343
		pgs[3]=0x002775CE
		pgs[4]=0x00277CA2
		pgs[6]=0x00276F42
		pgs[7]=0x0027970A
		pgs[8]=0x002790A7
		pgs[9]=0x0027686E
		pgs[10] ="shape.dll"
	elseif pg =="巨蛙_普通"then
        pgs[1]=0x0017244B
		pgs[2]=0x0017244B
		pgs[3]=0x001716B0
		pgs[4]=0x00171D97
		pgs[6]=0x00171011
		pgs[7]=0x0017384B
		pgs[8]=0x001731D5
		pgs[9]=0x0017092A
		pgs[10] ="shape.dll"
	elseif pg =="树怪_普通"then
        pgs[1]=0x00226192
		pgs[2]=0x00226192
		pgs[3]=0x002253E1
		pgs[4]=0x00225AD3
		pgs[6]=0x00224D37
		pgs[7]=0x002275B3
		pgs[8]=0x00226F32
		pgs[9]=0x00224645
		pgs[10] ="shape.dll"
	elseif pg =="星灵仙子_普通"then
        pgs[1]=0x002ACC73
		pgs[2]=0x002ACC73
		pgs[3]=0x002AB85C
		pgs[4]=0x002AC281
		pgs[6]=0x002AAE7F
		pgs[7]=0x002AEA2D
		pgs[8]=0x002AE079
		pgs[9]=0x002AA45A
		pgs[10] ="shape.dll"
	elseif pg =="海毛虫_普通"then
        pgs[1]=0x000FA542
		pgs[2]=0x000FA542
		pgs[3]=0x000F9569
		pgs[4]=0x000F9D6F
		pgs[6]=0x000F8DAB
		pgs[7]=0x000FBC9F
		pgs[8]=0x000FB50A
		pgs[9]=0x000F85A5
		pgs[10] ="shape.dll"
	elseif pg == "章鱼_普通" then
		pgs[1] = 282213114
		pgs[2] = 282213114
		pgs[3] = 401761475
		pgs[4] = 234560788
		pgs[6] = 840147070
		pgs[7] = 3714181760
		pgs[8] = 3714181760
		pgs[9] = 3317165969
		pgs[10] = "shape.dll"
	elseif pg =="野鬼_普通"then
        pgs[1]=0x002C9F78
		pgs[2]=0x002C9F78
		pgs[3]=0x002C9217
		pgs[4]=0x002C98E1
		pgs[6]=0x002C8B95
		pgs[7]=0x002CB321
		pgs[8]=0x002CACC8
		pgs[9]=0x002C84CB
		pgs[10] ="shape.dll"
	elseif pg =="天兵_普通"then
        pgs[1]=0x00243A65
		pgs[2]=0x00243A65
		pgs[3]=0x00242C92
		pgs[4]=0x00243395
		pgs[6]=0x002425D7
		pgs[7]=0x00244EB9
		pgs[8]=0x00244827
		pgs[9]=0x00241ED4
		pgs[10] ="shape.dll"
	elseif pg =="蝴蝶仙子_普通"then
        pgs[1]=0x0012208B
		pgs[2]=0x0012208B
		pgs[3]=0x00120C2C
		pgs[4]=0x00121675
		pgs[6]=0x0012022B
		pgs[7]=0x00123EB1
		pgs[8]=0x001234D9
		pgs[9]=0x0011F7E2
		pgs[10] ="shape.dll"
	elseif pg =="蟹将_普通"then
        pgs[1]=0x002A7F12
		pgs[2]=0x002A7F12
		pgs[3]=0x002A7223
		pgs[4]=0x002A78B4
		pgs[6]=0x002A6BDA
		pgs[7]=0x002A9210
		pgs[8]=0x002A8BF0
		pgs[9]=0x002A6549
		pgs[10] ="shape.dll"
	elseif pg =="狐狸精_普通"then
        pgs[1]=0x001162B2
		pgs[2]=0x001162B2
		pgs[3]=0x0011520F
		pgs[4]=0x00115A7A
		pgs[6]=0x001149EC
		pgs[7]=0x00117B3E
		pgs[8]=0x00116B0E
		pgs[9]=0x00114181
		pgs[10] ="shape.dll"
	elseif pg =="古代瑞兽_普通"then
        pgs[1]=0x000E3B9F
		pgs[2]=0x000E3B9F
		pgs[3]=0x000E2776
		pgs[4]=0x000E31A4
		pgs[6]=0x000E1D90
		pgs[7]=0x000E5974
		pgs[8]=0x000E4FB7
		pgs[9]=0x000E1362
		pgs[10] ="shape.dll"
	elseif pg =="泡泡_普通"then
        pgs[1]=0x001EAD7B
		pgs[2]=0x001EAD7B
		pgs[3]=0x001E9FE2
		pgs[4]=0x001EA6C8
		pgs[6]=0x001E9944
		pgs[7]=0x001EC178
		pgs[8]=0x001EBB03
		pgs[9]=0x001E925E
		pgs[10] ="shape.dll"
	elseif pg =="强盗_普通"then
        pgs[1]=0x001FC6A4
		pgs[2]=0x001FC6A4
		pgs[3]=0x001FB99B
		pgs[4]=0x001FC039
		pgs[6]=0x001FB345
		pgs[7]=0x001FD9C9
		pgs[8]=0x001FD39C
		pgs[9]=0x001FACA7
		pgs[10] ="shape.dll"
	elseif pg =="野猪_普通"then
        pgs[1]=0x002CDD87
		pgs[2]=0x002CDD87
		pgs[3]=0x002CCFEC
		pgs[4]=0x002CD6D3
		pgs[6]=0x002CC94D
		pgs[7]=0x002CF187
		pgs[8]=0x002CEB11
		pgs[9]=0x002CC266
		pgs[10] ="shape.dll"
	elseif pg =="狼_普通"then
        pgs[1]=0x0018ACC7
		pgs[2]=0x0018ACC7
		pgs[3]=0x0018A2A8
		pgs[4]=0x0018A7D1
		pgs[6]=0x00189DC7
		pgs[7]=0x0018BB8D
		pgs[8]=0x0018B6D5
		pgs[9]=0x0018989E
		pgs[10] ="shape.dll"
	elseif pg =="小魔头_普通"then
        pgs[1]=0x0028E391
		pgs[2]=0x0028E391
		pgs[3]=0x0028D3B4
		pgs[4]=0x0028EB60
		pgs[6]=0x0028F2F2
		pgs[7]=0x0028DB91
		pgs[8]=0x0028FAB7
		pgs[9]=0x0028CBFA
		pgs[10] ="shape.dll"
	elseif pg =="小精灵_普通"then
        pgs[1]=0x0027FF70
		pgs[2]=0x0027FF70
		pgs[3]=0x0027E725
		pgs[4]=0x0027F74C
		pgs[6]=0x00280F19
		pgs[7]=0x00280763
		pgs[8]=0x00281F21
		pgs[9]=0x0027DF47
		pgs[10] ="shape.dll"
	elseif pg =="小丫丫_普通"then
        pgs[1]=0x0029DB14
		pgs[2]=0x0029DB14
		pgs[3]=0x0029C2A8
		pgs[4]=0x0029D2E5
		pgs[6]=0x0029EAD3
		pgs[7]=0x0029E312
		pgs[8]=0x0029FAF1
		pgs[9]=0x0029BABF
		pgs[10] ="shape.dll"
	elseif pg =="小仙女_普通"then
        pgs[1]=0x297911
		pgs[2]=0x297911
		pgs[3]=0x297118
		pgs[4]=0x29812f
		pgs[6]=0x2998e4
		pgs[7]=0x29894b
		pgs[8]=0x29a8dc
		pgs[9]=0x296942
		pgs[10] ="shape.dll"
	elseif pg =="小神灵_普通"then
        pgs[1]=0x00293624
		pgs[2]=0x00293624
		pgs[3]=0x00291CE6
		pgs[4]=0x00292DAF
		pgs[6]=0x0029466F
		pgs[7]=0x00292538
		pgs[8]=0x00295719
		pgs[9]=0x002914B7
		pgs[10] ="shape.dll"
	elseif pg =="小毛头_普通"then
        pgs[1]=0x00289B32
		pgs[2]=0x00289B32
		pgs[3]=0x0028834A
		pgs[4]=0x0028932F
		pgs[6]=0x0028AA99
		pgs[7]=0x00288B2A
		pgs[8]=0x0028BA5F
		pgs[9]=0x00287B8D
		pgs[10] ="shape.dll"
	elseif pg =="幽灵_普通"then
        pgs[1]=0x002E55C8
		pgs[2]=0x002E55C8
		pgs[3]=0x002E4804
		pgs[4]=0x00171D97
		pgs[6]=0x002E62EB
		pgs[7]=0x002E76DF
		pgs[8]=0x002E706D
		pgs[9]=0x002E4169
		pgs[10] ="shape.dll"
	elseif pg =="龙龟_普通"then
        pgs[1]=0x001B9C97
		pgs[2]=0x001B9C97
		pgs[3]=0x001B8E99
		pgs[4]=0x001B9599
		pgs[6]=0x001B87E1
		pgs[7]=0x001BBE3F
		pgs[8]=0x001BB7B0
		pgs[9]=0x001B80E1
		pgs[10] ="shape.dll"
	elseif pg =="灵符女娲_普通"then
	    pgs[1] = 0x001A411D
		pgs[2] = 0x001A411D
		pgs[3] = 0x001A2D09
		pgs[4] = 0x001A3714
		pgs[6] = 0x001A5490
		pgs[7] = 0x001A71FC
		pgs[8] = 0x001A6862
		pgs[9] = 0x001A2346
		pgs[10] ="shape.dll"
	elseif pg =="净瓶女娲_普通"then
	    pgs[1] = 0x0015FB01
		pgs[2] = 0x0015FB01
		pgs[3] = 0x0015E7A9
		pgs[4] = 0x0015F156
		pgs[6] = 0x0015DE44
		pgs[7] = 0x001620CD
		pgs[8] = 0x00161791
		pgs[9] = 0x0015D497
		pgs[10] ="shape.dll"
	elseif pg =="鬼将_普通"then
	    pgs[1] = 0x000F54D3
		pgs[2] = 0x000F54D3
		pgs[3] = 0x000F40F8
		pgs[4] = 0x000F47A8
		pgs[6] = 0x000F3A90
		pgs[7] = 0x000F682E
		pgs[8] = 0x000F61EF
		pgs[9] = 0x000F33E0
		pgs[10] ="shape.dll"
	elseif pg =="律法女娲_普通"then
	    pgs[1] = 0x001C59F4
		pgs[2] = 0x001C59F4
		pgs[3] = 0x001C46C4
		pgs[4] = 0x001C505D
		pgs[6] = 0x001C6C83
		pgs[7] = 0x001C8899
		pgs[8] = 0x001C7F71
		pgs[9] = 0x001C3D73
		pgs[10] ="shape.dll"
	elseif pg =="蚩尤_普通"then
	    pgs[1] = 0x001D2E08
		pgs[2] = 0x001D2E08
		pgs[3] = 0x001D1923
		pgs[4] = 0x001D201B
		pgs[6] = 0x001D1273
		pgs[7] = 0x001D48C3
		pgs[8] = 0x001D423C
		pgs[9] = 0x001D0B7B
		pgs[10] ="shape.dll"
	elseif pg =="吸血鬼_普通"then
	    pgs[1] = 0x00264D52
		pgs[2] = 0x00264D52
		pgs[3] = 0x002633E0
		pgs[4] = 0x00263C6D
		pgs[6] = 0x0026556F
		pgs[7] = 0x00266E61
		pgs[8] = 0x00266645
		pgs[9] = 0x00262B9B
		pgs[10] ="shape.dll"
	elseif pg =="雾中仙_普通"then
	    pgs[1] = 0x0025D769
		pgs[2] = 0x0025D769
		pgs[3] = 0x0025C666
		pgs[4] = 0x0025CF01
		pgs[6] = 0x0025BE13
		pgs[7] = 0x0025F085
		pgs[8] = 0x0025E85B
		pgs[9] = 0x0025B578
		pgs[10] ="shape.dll"
	elseif pg =="大力金刚_普通"then
	    pgs[1] = 0x000B1491
		pgs[2] = 0x000B1491
		pgs[3] = 0x000B00F0
		pgs[4] = 0x000B0ADA
		pgs[6] = 0x000AF74E
		pgs[7] = 0x000B319A
		pgs[8] = 0x000B2821
		pgs[9] = 0x000AED64
		pgs[10] ="shape.dll"
	elseif pg =="炎魔神_普通"then
	    pgs[1] = 0x002B972E
		pgs[2] = 0x002B972E
		pgs[3] = 0x002B8683
		pgs[4] = 0x002B8EF2
		pgs[6] = 0x002B7E5C
		pgs[7] = 0x002BAFC6
		pgs[8] = 0x002BA7C8
		pgs[9] = 0x002B75ED
		pgs[10] ="shape.dll"
	elseif pg =="夜罗刹_普通"then
	    pgs[1] = 0x002D7603
		pgs[2] = 0x002D7603
		pgs[3] = 0x002D65A6
		pgs[4] = 0x002D6DEE
		pgs[6] = 0x002D5DA6
		pgs[7] = 0x002D8E26
		pgs[8] = 0x002D864F
		pgs[9] = 0x002D555E
		pgs[10] ="shape.dll"
	elseif pg =="灵鹤_普通"then
	    pgs[1] = 0x001A9F71
		pgs[2] = 0x001A9F71
		pgs[3] = 0x001A91EA
		pgs[4] = 0x001A98C7
		pgs[6] = 0x001A8B55
		pgs[7] = 0x001AB353
		pgs[8] = 0x001AACE7
		pgs[9] = 0x001A8478
		pgs[10] ="shape.dll"
	elseif pg =="噬天虎_普通"then
	    pgs[1] = 0x0021AC82
		pgs[2] = 0x0021AC82
		pgs[3] = 0x00219C21
		pgs[4] = 0x0021A46B
		pgs[6] = 0x0021941F
		pgs[7] = 0x0021C4AB
		pgs[8] = 0x0021BCD2
		pgs[9] = 0x00218BD5
		pgs[10] ="shape.dll"
	elseif pg =="狸_普通"then
	    pgs[1] = 0x897A5492
		pgs[2] = 0x897A5492
		pgs[3] = 0xFF27CA9E
		pgs[4] = 0xF0ACEB35
		pgs[6] = 0x3CDBAFB2
		pgs[7] = 0xB6DB9CCB
		pgs[8] = 0x0E6210D6
		pgs[9] = 0x2112F5F7
		pgs[10] ="shape.dll"
	elseif pg =="蜃气妖_普通"then
	    pgs[1] = 0xCC95E5AB
		pgs[2] = 0xCC95E5AB
		pgs[3] = 0xC3968B7E
		pgs[4] = 0x2BBB9C11
		pgs[6] = 0xA3F8CD7E
		pgs[7] = 0x00C49F8D
		pgs[8] = 0x5E9E8FEE
		pgs[9] = 0xC110AF0A
		pgs[10] ="shape.dll"
	elseif pg =="蔓藤妖花_普通"then
	    pgs[1] = 0xC1611D6D
		pgs[2] = 0xC1611D6D
		pgs[3] = 0x17B4A850
		pgs[4] = 0xE2B2445B
		pgs[6] = 0x6C4BB701
		pgs[7] = 0xAB486FA3
		pgs[8] = 0x07F93745
		pgs[9] = 0x0983D50D
		pgs[10] ="shape.dll"
	elseif pg =="曼珠沙华_普通"then
	    pgs[1] = 0x9798EC46
		pgs[2] = 0x9798EC46
		pgs[3] = 0xBD77FD79
		pgs[4] = 0xE8EF1966
		pgs[6] = 0x45ACDEDF
		pgs[7] = 0x1036684B
		pgs[8] = 0x727FCE05
		pgs[9] = 0x3BDD0DBF
		pgs[10] ="shape.dll"
	elseif pg =="修罗傀儡鬼_普通"then
	    pgs[1] = 0x2D8299C3
		pgs[2] = 0x2D8299C3
		pgs[3] = 0x73729299
		pgs[4] = 0x28E437E2
		pgs[6] = 0xD70E1A23
		pgs[7] = 0x13910678
		pgs[8] = 0x4C5B945B
		pgs[9] = 0xBAEBEAEA
		pgs[10] ="shape.dll"
	elseif pg =="金身罗汉_普通"then
	    pgs[1] = 0x9C711EDD
		pgs[2] = 0x9C711EDD
		pgs[3] = 0x15FBF580
		pgs[4] = 0x784F490F
		pgs[6] = 0x7B1F88D8
		pgs[7] = 0xD49CA003
		pgs[8] = 0xD2B03C99
		pgs[9] = 0xEC96354B
		pgs[10] ="shape.dll"
	elseif pg =="修罗傀儡妖_普通"then
	    pgs[1] = 0x33C182E9
		pgs[2] = 0x33C182E9
		pgs[3] = 0xB9A4F860
		pgs[4] = 0x22CAE42D
		pgs[6] = 0x32FC3B00
		pgs[7] = 0x4C07FFA1
		pgs[8] = 0x658404D2
		pgs[9] = 0xF712F34F
		pgs[10] ="shape.dll"
	elseif pg =="巴蛇_普通"then
	    pgs[1] = 0x000033FB
		pgs[2] = 0x000033FB
		pgs[3] = 0x0000266F
		pgs[4] = 0x00002D36
		pgs[6] = 0x000040E6
		pgs[7] = 0x00005486
		pgs[8] = 0x00004E30
		pgs[9] = 0x00001FF0
		pgs[10] ="shape.dll"
	elseif pg =="百足将军_普通"then
	    pgs[1] = 0x00012A0B
		pgs[2] = 0x00012A0B
		pgs[3] = 0x00011630
		pgs[4] = 0x00012037
		pgs[6] = 0x00010C71
		pgs[7] = 0x00015102
		pgs[8] = 0x0001476C
		pgs[9] = 0x0001026A
		pgs[10] ="shape.dll"
	elseif pg =="蚌精_普通"then
	    pgs[1] = 0x0001F06C
		pgs[2] = 0x0001F06C
		pgs[3] = 0x0001E30C
		pgs[4] = 0x0001E9BD
		pgs[6] = 0x0001DCA3
		pgs[7] = 0x00021089
		pgs[8] = 0x00020A49
		pgs[9] = 0x0001D5F2
		pgs[10] ="shape.dll"
	elseif pg =="碧水夜叉_普通"then
	    pgs[1] = 0x00023FB8
		pgs[2] = 0x00023FB8
		pgs[3] = 0x00026F82
		pgs[4] = 0x000235FF
		pgs[6] = 0x00022C44
		pgs[7] = 0x000265BC
		pgs[8] = 0x00025C72
		pgs[9] = 0x00022289
		pgs[10] ="shape.dll"
	elseif pg =="长眉灵猴_普通"then
	    pgs[1] = 0x0002CEDF
		pgs[2] = 0x0002CEDF
		pgs[3] = 0x0002BB7C
		pgs[4] = 0x0002C547
		pgs[6] = 0x0002B1F9
		pgs[7] = 0x0002F4E6
		pgs[8] = 0x0002EB8C
		pgs[9] = 0x0002A82E
		pgs[10] ="shape.dll"
	elseif pg =="红萼仙子_普通"then
	    pgs[1] = 0x0010ED97
		pgs[2] = 0x0010ED97
		pgs[3] = 0x0010D90B
		pgs[4] = 0x0010E352
		pgs[6] = 0x0010CF0C
		pgs[7] = 0x00111FA2
		pgs[8] = 0x001115CC
		pgs[9] = 0x0010C4C5
		pgs[10] ="shape.dll"
	elseif pg =="葫芦宝贝_普通"then
	    pgs[1] = 0x0011BDB4
		pgs[2] = 0x0011BDB4
		pgs[3] = 0x0011A16F
		pgs[4] = 0x0011AAED
		pgs[6] = 0x00119839
		pgs[7] = 0x0011E287
		pgs[8] = 0x0011D97A
		pgs[9] = 0x00118EBB
		pgs[10] ="shape.dll"
	elseif pg =="画魂_普通"then
	    pgs[1] = 0x0012E99B
		pgs[2] = 0x0012E99B
		pgs[3] = 0x0012D5C3
		pgs[4] = 0x0012DC72
		pgs[6] = 0x0012CF5C
		pgs[7] = 0x0012FCF3
		pgs[8] = 0x0012F03B
		pgs[9] = 0x0012C8AD
		pgs[10] ="shape.dll"
	elseif pg =="知了王_普通"then
	    pgs[1] = 0x00132DB4
		pgs[2] = 0x00132DB4
		pgs[3] = 0x00133D69
		pgs[4] = 0x001325B6
		pgs[6] = 0x00131598
		pgs[7] = 0x00135547
		pgs[8] = 0x00134D87
		pgs[9] = 0x00130D67
		pgs[10] ="shape.dll"
	elseif pg =="混沌兽_普通"then
	    pgs[1] = 0x00138A69
		pgs[2] = 0x00138A69
		pgs[3] = 0x001378F5
		pgs[4] = 0x001381B0
		pgs[6] = 0x00137082
		pgs[7] = 0x0013B4B8
		pgs[8] = 0x0001476C
		pgs[9] = 0x001367C7
		pgs[10] ="shape.dll"
	elseif pg =="机关鸟_普通"then
	    pgs[1] = 0x0013E9CE
		pgs[2] = 0x0013E9CE
		pgs[3] = 0x0013D896
		pgs[4] = 0x0013E133
		pgs[6] = 0x0013D041
		pgs[7] = 0x00140B5A
		pgs[8] = 0x0014032E
		pgs[9] = 0x0013C7A4
		pgs[10] ="shape.dll"
	elseif pg =="机关兽_普通"then
	    pgs[1] = 0x0014486E
		pgs[2] = 0x0014486E
		pgs[3] = 0x00142EF3
		pgs[4] = 0x00143783
		pgs[6] = 0x001426AB
		pgs[7] = 0x00146169
		pgs[8] = 0x0014594A
		pgs[9] = 0x00141E1B
		pgs[10] ="shape.dll"
	elseif pg =="鲛人_普通"then
	    pgs[1] = 0x00153A76
		pgs[2] = 0x00153A76
		pgs[3] = 0x00155CC6
		pgs[4] = 0x0015336F
		pgs[6] = 0x00152C66
		pgs[7] = 0x001555B2
		pgs[8] = 0x00154F1A
		pgs[9] = 0x0015255D
		pgs[10] ="shape.dll"
	elseif pg =="锦毛貂精_普通"then
	    pgs[1] = 0x00159797
		pgs[2] = 0x00159797
		pgs[3] = 0x0015BF41
		pgs[4] = 0x001583A2
		pgs[6] = 0x0015798D
		pgs[7] = 0x0015B521
		pgs[8] = 0x0015AB7D
		pgs[9] = 0x00156F78
		pgs[10] ="shape.dll"
	elseif pg =="巨力神猿_普通"then
	    pgs[1] = 0x0016D056
		pgs[2] = 0x0016D056
		pgs[3] = 0x0016BCBD
		pgs[4] = 0x0016C6A3
		pgs[6] = 0x0016B31F
		pgs[7] = 0x0016F6C9
		pgs[8] = 0x0016ED54
		pgs[9] = 0x0016A939
		pgs[10] ="shape.dll"
	elseif pg =="狂豹人形_普通"then
	    pgs[1] = 0x0017F426
		pgs[2] = 0x0017F426
		pgs[3] = 0x0017E306
		pgs[4] = 0x0017EB97
		pgs[6] = 0x0017DABD
		pgs[7] = 0x00181DA3
		pgs[8] = 0x00181583
		pgs[9] = 0x0017D22C
		pgs[10] ="shape.dll"
	elseif pg =="狂豹兽形_普通"then
	    pgs[1] = 0x001852BC
		pgs[2] = 0x001852BC
		pgs[3] = 0x00184172
		pgs[4] = 0x00184A18
		pgs[6] = 0x00183914
		pgs[7] = 0x00187CA2
		pgs[8] = 0x0018746D
		pgs[9] = 0x0018306E
		pgs[10] ="shape.dll"
	elseif pg =="连弩车_普通"then
	    pgs[1] = 0x0019EF41
		pgs[2] = 0x0019EF41
		pgs[3] = 0x0019D689
		pgs[4] = 0x0019DED8
		pgs[6] = 0x0019CE82
		pgs[7] = 0x001A0F58
		pgs[8] = 0x0018746D
		pgs[9] = 0x0019C633
		pgs[10] ="shape.dll"
	elseif pg == "进阶连弩车_普通" then
		pgs[1] = 0503978483
		pgs[2] = 3056826094
		pgs[3] = 2192302971
	    pgs[4] = 3781090329
		pgs[6] = 3991379227
	    pgs[7] = 3367116698
	    pgs[8] = 2460772584
		pgs[9] = 3285179327
		pgs[10] = "shape.dll"
	elseif pg =="猫灵人形_普通"then
	    pgs[1] = 0x001AE681
		pgs[2] = 0x001AE681
		pgs[3] = 0x001AD54D
		pgs[4] = 0x001ADDE8
		pgs[6] = 0x001ACCFA
		pgs[7] = 0x001B1030
		pgs[8] = 0x001B0806
		pgs[9] = 0x001AC45F
		pgs[10] ="shape.dll"
	elseif pg =="猫灵兽形_普通"then
	    pgs[1] = 0x001B4E02
		pgs[2] = 0x001B4E02
		pgs[3] = 0x001B3427
		pgs[4] = 0x001B3CD7
		pgs[6] = 0x001B2BBF
		pgs[7] = 0x001B6F9D
		pgs[8] = 0x001B675E
		pgs[9] = 0x001B230F
		pgs[10] ="shape.dll"
	elseif pg =="千年蛇魅_普通"then
	    pgs[1] = 0x001F5F41
		pgs[2] = 0x001F5F41
		pgs[3] = 0x001F872B
		pgs[4] = 0x001F554F
		pgs[6] = 0x001F4B2A
		pgs[7] = 0x001F7CFB
		pgs[8] = 0x001F7347
		pgs[9] = 0x001F4105
		pgs[10] ="shape.dll"
	elseif pg =="远古神魔_普通"then
	    pgs[1] = 0x002130BB
		pgs[2] = 0x002130BB
		pgs[3] = 0x00211CDF
		pgs[4] = 0x002126CE
		pgs[6] = 0x00211338
		pgs[7] = 0x002143F5
		pgs[8] = 0x00213A77
		pgs[9] = 0x00210949
		pgs[10] ="shape.dll"
	elseif pg =="鼠先锋_普通"then
	    pgs[1] = 0x00221405
		pgs[2] = 0x00221405
		pgs[3] = 0x00220312
		pgs[4] = 0x00220BA5
		pgs[6] = 0x0021FAC7
		pgs[7] = 0x0022352C
		pgs[8] = 0x00222D0A
		pgs[9] = 0x0021F234
		pgs[10] ="shape.dll"
	elseif pg =="踏云兽_普通"then
	    pgs[1] = 0x0023AAC2
		pgs[2] = 0x0023AAC2
		pgs[3] = 0x00239A1C
		pgs[4] = 0x0023A270
		pgs[6] = 0x00239210
		pgs[7] = 0x0023D30E
		pgs[8] = 0x0023CB2B
		pgs[9] = 0x002389BC
		pgs[10] ="shape.dll"
	elseif pg =="犀牛将军人形_普通"then
	    pgs[1] = 0x0026A6AC
		pgs[2] = 0x0026A6AC
		pgs[3] = 0x0026DF86
		pgs[4] = 0x00269B23
		pgs[6] = 0x00268F98
		pgs[7] = 0x0026D3F0
		pgs[8] = 0x0026C8D6
		pgs[9] = 0x0026840D
		pgs[10] ="shape.dll"
	elseif pg =="犀牛将军兽形_普通"then
	    pgs[1] = 0x00272690
		pgs[2] = 0x00272690
		pgs[3] = 0x00275466
		pgs[4] = 0x00270F85
		pgs[6] = 0x002703E5
		pgs[7] = 0x002748BB
		pgs[8] = 0x00273D8C
		pgs[9] = 0x0026F845
		pgs[10] ="shape.dll"
	elseif pg =="蝎子精_普通"then
	    pgs[1] = 0x002A2D5C
		pgs[2] = 0x002A2D5C
		pgs[3] = 0x002A1CFE
		pgs[4] = 0x002A252E
		pgs[6] = 0x002A1516
		pgs[7] = 0x002A54F4
		pgs[8] = 0x002A4D35
		pgs[9] = 0x002A0CE6
		pgs[10] ="shape.dll"
	elseif pg =="野猪精_普通"then
	    pgs[1] = 0x002D2317
		pgs[2] = 0x002D2317
		pgs[3] = 0x002D12AA
		pgs[4] = 0x002D1AFA
		pgs[6] = 0x002D0AA2
		pgs[7] = 0x002D4332
		pgs[8] = 0x002D3B53
		pgs[9] = 0x002D0252
		pgs[10] ="shape.dll"
	elseif pg =="阴阳伞_普通"then
	    pgs[1] = 0x002DDEFE
		pgs[2] = 0x002DDEFE
		pgs[3] = 0x002DC56B
		pgs[4] = 0x002DCE03
		pgs[6] = 0x002DBD1B
		pgs[7] = 0x002E0039
		pgs[8] = 0x002DF812
		pgs[9] = 0x002DB483
		pgs[10] ="shape.dll"
	elseif pg =="幽萤娃娃_普通"then
	    pgs[1] = 0x002EAF74
		pgs[2] = 0x002EAF74
		pgs[3] = 0x002E9B62
		pgs[4] = 0x002EA56C
		pgs[6] = 0x002E91A0
		pgs[7] = 0x002EE04E
		pgs[8] = 0x002ED6B5
		pgs[9] = 0x002E8796
		pgs[10] ="shape.dll"
	elseif pg =="进阶龙龟_普通"then
	    pgs[1] = 0xA120218F
		pgs[2] = 0xA120218F
		pgs[3] = 0xD82E5536
		pgs[4] = 0x02DC061B
		pgs[6] = 0x2933FC41
		pgs[7] = 0x0707FAF0
		pgs[8] = 0xE38771B9
		pgs[9] = 0xDE2011E4
		pgs[10] ="shape.dll"
	elseif pg =="进阶修罗傀儡鬼_普通"then
	    pgs[1] = 0x9B7DF1FC
		pgs[2] = 0x9B7DF1FC
		pgs[3] = 0xC9CE3035
		pgs[4] = 0x20E37E1A
		pgs[6] = 0x554EBB15
		pgs[7] = 0x9224DF59
		pgs[8] = 0xA49270BA
		pgs[9] = 0xE2700BF7
		pgs[10] ="shape.dll"
	elseif pg =="进阶灵鹤_普通"then
	    pgs[1] = 0x73AAF3C5
		pgs[2] = 0x73AAF3C5
		pgs[3] = 0x009DC258
		pgs[4] = 0xE6A9C9B1
		pgs[6] = 0xB15E456E
		pgs[7] = 0x812AE416
		pgs[8] = 0xDE8086CE
		pgs[9] = 0x0E98BCB1
		pgs[10] ="shape.dll"
	elseif pg =="进阶芙蓉仙子_普通"then
	    pgs[1] = 0x71C7FAC0
		pgs[2] = 0x71C7FAC0
		pgs[3] = 0x91C59A1F
		pgs[4] = 0x5D9AB3E1
		pgs[6] = 0x2206E612
		pgs[7] = 0x080F22AE
		pgs[8] = 0x96BC94AC
		pgs[9] = 0x4F65A668
		pgs[10] ="shape.dll"
	elseif pg =="进阶如意仙子_普通"then
	    pgs[1] = 0x01197058
		pgs[2] = 0x01197058
		pgs[3] = 0x132F1FB6
		pgs[4] = 0xF8B7009E
		pgs[6] = 0x2F00B37A
		pgs[7] = 0x81042AE4
		pgs[8] = 0x4198CF0C
		pgs[9] = 0x4EA4E8E0
		pgs[10] ="shape.dll"
	elseif pg =="进阶鲛人_普通"then
	    pgs[1] = 0x4DD6DDDA
		pgs[2] = 0x4DD6DDDA
		pgs[3] = 0x8FE89A5D
		pgs[4] = 0x3692E598
		pgs[6] = 0x78ED4C3F
		pgs[7] = 0x55462CFE
		pgs[8] = 0x01D4B3DC
		pgs[9] = 0x7A35C54B
		pgs[10] ="shape.dll"
	elseif pg =="进阶金身罗汉_普通"then
	    pgs[1] = 0x0F176911
		pgs[2] = 0x0F176911
		pgs[3] = 0x1CE650E4
		pgs[4] = 0xD6CD3ADC
		pgs[6] = 0x2D9806FA
		pgs[7] = 0x704A7CEC
		pgs[8] = 0x73625A2A
		pgs[9] = 0x61C5BCE3
		pgs[10] ="shape.dll"
	elseif pg =="进阶大力金刚_普通"then
	    pgs[1] = 0x12706211
		pgs[2] = 0xE185B5C8
		pgs[3] = 0x233FC460
		pgs[4] = 0x5B9F487A
		pgs[6] = 0xC875C4BE
		pgs[7] = 0x6B659F88
		pgs[8] = 0x02F7CD64
		pgs[9] = 0x5E86E30F
		pgs[10] ="shape.dll"
	elseif pg =="进阶蔓藤妖花_普通"then
	    pgs[1] = 0xBD71D80C
		pgs[2] = 0xBD71D80C
		pgs[3] = 0x21C0D609
		pgs[4] = 0x7DCFA008
		pgs[6] = 0x7118D645
		pgs[7] = 0x170A3BB0
		pgs[8] = 0xDC43CAD3
		pgs[9] = 0xDE1E53D4
		pgs[10] ="shape.dll"
	elseif pg =="进阶巨力神猿_普通"then
	    pgs[1] = 0x1CCCD4F9
		pgs[2] = 0x1CCCD4F9
		pgs[3] = 0x71C43236
		pgs[4] = 0xCD453A51
		pgs[6] = 0x06B8518E
		pgs[7] = 0x3F197B49
		pgs[8] = 0x039BDA0E
		pgs[9] = 0x6CF30E59
		pgs[10] ="shape.dll"
	elseif pg =="进阶巴蛇_普通"then
	    pgs[1] = 0xB5421C20
		pgs[2] = 0xB5421C20
		pgs[3] = 0x6E6B0CD6
		pgs[4] = 0x048A0E39
		pgs[6] = 0x7A7EF4C7
		pgs[7] = 0x08939F8B
		pgs[8] = 0x6E93E040
		pgs[9] = 0x42A25B91
		pgs[10] ="shape.dll"
	elseif pg =="进阶红萼仙子_普通"then
	    pgs[1] = 0xA125C0D9
		pgs[2] = 0xA125C0D9
		pgs[3] = 0xF0DCFC91
		pgs[4] = 0x7D0DD03D
		pgs[6] = 0x0E997872
		pgs[7] = 0x6E9BCD5C
		pgs[8] = 0xC5891CD4
		pgs[9] = 0xBC4D1C53
		pgs[10] ="shape.dll"
	elseif pg =="进阶鼠先锋_普通"then
	   pgs[6] = 0x89A1831C
	   pgs[9] = 0x88D3286C
	   pgs[8] = 0xE0DFA185
	   pgs[5] = 0xB9B7EBDB
	   pgs[4] = 0x0B818F11
	   pgs[1] = 0x078A8E44
	   pgs[2] = 0x98A18E75
	   pgs[7] = 0x3CDD35E9
	   pgs[3] = 0x95ECB854
		pgs[10] ="shape.dll"
	elseif pg =="进阶炎魔神_普通"then
	    pgs[1] = 0x895C18AB
		pgs[2] = 0x895C18AB
		pgs[3] = 0xF6C02A88
		pgs[4] = 0x79E11A39
		pgs[6] = 0x9F3AE035
		pgs[7] = 0x8983AA04
		pgs[8] = 0x32EA9C0B
		pgs[9] = 0x4EAC2194
		pgs[10] ="shape.dll"
	elseif pg =="进阶曼珠沙华_普通"then
	    pgs[1] = 0x25240D95
		pgs[2] = 0x25240D95
		pgs[3] = 0x09B3229A
		pgs[4] = 0xD759BDC3
		pgs[6] = 0x886801BB
		pgs[7] = 0x72B459C4
		pgs[8] = 0xD8E30A74
		pgs[9] = 0x8EBF1E45
		pgs[10] ="shape.dll"
	elseif pg =="进阶地狱战神_普通"then
	    pgs[1] = 0x72A69AC3
		pgs[2] = 0x72A69AC3
		pgs[3] = 0x602C6BA1
		pgs[4] = 0x28533A4E
		pgs[6] = 0x6B19D682
		pgs[7] = 0x958AC02C
		pgs[8] = 0x0A0351C4
		pgs[9] = 0x0A0351C4
		pgs[10] ="shape.dll"
	elseif pg =="进阶蚌精_普通"then
	    pgs[1] = 0x34E9C79F
		pgs[2] = 0x34E9C79F
		pgs[3] = 0x42900F8B
		pgs[4] = 0x0A8B52DB
		pgs[6] = 0x31454554
		pgs[7] = 0x34E9C79F
		pgs[8] = 0x50DB2F65
		pgs[9] = 0x7A78E890
		pgs[10] ="shape.dll"
	elseif pg =="进阶风伯_普通"then
	    pgs[1] = 0x1C3519F4
		pgs[2] = 0x1C3519F4
		pgs[3] = 0x0B4D5B60
		pgs[4] = 0xDD0ABC12
		pgs[6] = 0x21E83685
		pgs[7] = 0x421CDC1C
		pgs[8] = 0x5D4A0DA2
		pgs[9] = 0xE91519F9
		pgs[10] ="shape.dll"
	elseif pg =="进阶葫芦宝贝_普通"then
	    pgs[1] = 0xA7F1FBD6
		pgs[2] = 0xA7F1FBD6
		pgs[3] = 0x6D8A1791
		pgs[4] = 0x3C255AE9
		pgs[6] = 0x586B462C
		pgs[7] = 0x78C89358
		pgs[8] = 0x36A02292
		pgs[9] = 0xB06E3A58
		pgs[10] ="shape.dll"
	elseif pg =="进阶修罗傀儡妖_普通"then
	    pgs[1] = 0xEADFBA86
		pgs[2] = 0xEADFBA86
		pgs[3] = 0xEC3103E4
		pgs[4] = 0xB87C4198
		pgs[6] = 0x9ADB6CAC
		pgs[7] = 0x0BA257CC
		pgs[8] = 0x6783BDA7
		pgs[9] = 0xF361F1D2
		pgs[10] ="shape.dll"
	elseif pg =="进阶凤凰_普通"then
	    pgs[1] = 0x531998EA
		pgs[2] = 0x531998EA
		pgs[3] = 0x2FC72F35
		pgs[4] = 0xBED32A52
		pgs[6] = 0x8AE90761
		pgs[7] = 0x441E6903
		pgs[8] = 0xE441F928
		pgs[9] = 0x0CF889CA
		pgs[10] ="shape.dll"
	elseif pg =="进阶长眉灵猴_普通"then
	    pgs[1] = 0xCC76F2F8
		pgs[2] = 0xCC76F2F8
		pgs[3] = 0x2BD4447D
		pgs[4] = 0xD7CC08FF
		pgs[6] = 0x4D9B1187
		pgs[7] = 0xF74A6D83
		pgs[8] = 0xC14B977D
		pgs[9] = 0xA7EF454A
		pgs[10] ="shape.dll"
	elseif pg =="进阶幽萤娃娃_普通"then
	    pgs[1] = 0xDEE2BA96
		pgs[2] = 0xDEE2BA96
		pgs[3] = 0xAA744C4F
		pgs[4] = 0xDEEF16AF
		pgs[6] = 0x11FF6780
		pgs[7] = 0x2D71552F
		pgs[8] = 0x3A093FAF
		pgs[9] = 0x307C8AB4
		pgs[10] ="shape.dll"
	elseif pg =="进阶巡游天神_普通"then
	    pgs[1] = 0x61626CF7
		pgs[2] = 0x61626CF7
		pgs[3] = 0x38DDF499
		pgs[4] = 0xB40DB275
		pgs[6] = 0x0F27607E
		pgs[7] = 0xD019B465
		pgs[8] = 0x447F4F60
		pgs[9] = 0x96C9C11E
		pgs[10] ="shape.dll"
	elseif pg =="进阶混沌兽_普通"then
	    pgs[1] = 0x9749DC26
		pgs[2] = 0x9749DC26
		pgs[3] = 0x11D32EF5
		pgs[4] = 0x44EC58A8
		pgs[6] = 0x87E78098
		pgs[7] = 0x9F328A5A
		pgs[8] = 0x2E8D1286
		pgs[9] = 0xCEA78367
		pgs[10] ="shape.dll"
	elseif pg =="进阶野猪精_普通"then
	    pgs[1] = 0x1FAF1415
		pgs[2] = 0x1FAF1415
		pgs[3] = 0x17A99AF2
		pgs[4] = 0x2CC0C44E
		pgs[6] = 0x91BB8E60
		pgs[7] = 0x14835218
		pgs[8] = 0x977F1043
		pgs[9] = 0x69308A69
		pgs[10] ="shape.dll"
	elseif pg =="进阶犀牛将军兽形_普通"then
	    pgs[1] = 0xF3B7CF02
		pgs[2] = 0xF3B7CF02
		pgs[3] = 0x162C35E1
		pgs[4] = 0xE43DCAE8
		pgs[6] = 0x48D01363
		pgs[7] = 0x14B17887
		pgs[8] = 0x605E3B33
		pgs[9] = 0xD5D87FC7
		pgs[10] ="shape.dll"
	elseif pg =="进阶机关人_普通"then
	    pgs[1] = 0x14DE8746
		pgs[2] = 0x14DE8746
		pgs[3] = 0xDB2916BF
		pgs[4] = 0x5026BD9F
		pgs[6] = 0xE05C3F97
		pgs[7] = 0x9864B2F1
		pgs[8] = 0xE3E7268D
		pgs[9] = 0xD3EAE52F
		pgs[10] ="shape.dll"
		elseif pg =="机关人_普通"then
	    pgs[1] = 0x14DE8746
		pgs[2] = 0x14DE8746
		pgs[3] = 0xDB2916BF
		pgs[4] = 0x5026BD9F
		pgs[6] = 0xE05C3F97
		pgs[7] = 0x9864B2F1
		pgs[8] = 0xE3E7268D
		pgs[9] = 0xD3EAE52F
		pgs[10] ="shape.dll"
	elseif pg =="进阶古代瑞兽_普通"then
	    pgs[1] = 0x7291F291
		pgs[2] = 0x7291F291
		pgs[3] = 0xE04C80B3
		pgs[4] = 0xB4613104
		pgs[6] = 0x1798EA00
		pgs[7] = 0xC658307A
		pgs[8] = 0x2C2FA1CA
		pgs[9] = 0xCC7353FA
		pgs[10] ="shape.dll"
	elseif pg =="进阶碧水夜叉_普通"then
	    pgs[1] = 0x41B0D9DE
		pgs[2] = 0x41B0D9DE
		pgs[3] = 0x1B8CB1C7
		pgs[4] = 0x240C4935
		pgs[6] = 0x1EDA1CD8
		pgs[7] = 0x185A3FA7
		pgs[8] = 0xC2B09D04
		pgs[9] = 0xC7080258
		pgs[10] ="shape.dll"
	elseif pg =="进阶黑山老妖_普通"then
	    pgs[1] = 0x18B4A333
		pgs[2] = 0x18B4A333
		pgs[3] = 0xE5768F24
		pgs[4] = 0x3655BA0F
		pgs[6] = 0x94258F07
		pgs[7] = 0x20E38EFD
		pgs[8] = 0xFA5075B4
		pgs[9] = 0x6F9C7D69
		pgs[10] ="shape.dll"
	elseif pg =="进阶雨师_普通"then
	    pgs[1] = 0xADCAF1D3
		pgs[2] = 0xADCAF1D3
		pgs[3] = 0xBF6028A3
		pgs[4] = 0xC3C6CB3F
		pgs[6] = 0x7D912078
		pgs[7] = 0xFC49420C
		pgs[8] = 0x18EF6634
		pgs[9] = 0xC1476207
		pgs[10] ="shape.dll"
	elseif pg =="进阶龙龟_普通"then
	    pgs[1] = 0xA120218F
		pgs[2] = 0xA120218F
		pgs[3] = 0xD82E5536
		pgs[4] = 0x02DC061B
		pgs[6] = 0x2933FC41
		pgs[7] = 0x0707FAF0
		pgs[8] = 0xE38771B9
		pgs[9] = 0xDE2011E4
		pgs[10] ="shape.dll"
	elseif pg =="真陀护法_普通"then
	    pgs[1] = 0x2DDCB61A
		pgs[2] = 0x2DDCB61A
		pgs[3] = 0x2070E3B1
		pgs[4] = 0x281836EE
		pgs[6] = 0x06B907B8
		pgs[7] = 0x5AB8D8B7
		pgs[8] = 0x2D2984EB
		pgs[9] = 0x31ABF075
		pgs[10] ="shape.dll"
	elseif pg =="进阶阴阳伞_普通"then
	    pgs[1] = 0x84312A1F
		pgs[2] = 0x84312A1F
		pgs[3] = 0xE27750EF
		pgs[4] = 0x38396F6C
		pgs[6] = 0x1AFDC3F6
		pgs[7] = 0xDED79EF9
		pgs[8] = 0x45F9345B
		pgs[9] = 0x57DF88DF
		pgs[10] ="shape.dll"
	elseif pg =="进阶净瓶女娲_普通"then
	    pgs[1] = 0x2856C7A1
		pgs[2] = 0x2856C7A1
		pgs[3] = 0xFECD9387
		pgs[4] = 0xCD97E37C
		pgs[6] = 0x1B5425E6
		pgs[7] = 0x1EF2E640
		pgs[8] = 0xE6E208F4
		pgs[9] = 0x658ECFB8
		pgs[10] ="shape.dll"
	elseif pg =="进阶机关鸟_普通"then
	    pgs[1] = 0x3030BC6E
		pgs[2] = 0x3030BC6E
		pgs[3] = 0xFFB5760E
		pgs[4] = 0x32AC0E25
		pgs[6] = 0x7FBF3FBC
		pgs[7] = 0x3D0B6105
		pgs[8] = 0x557E8420
		pgs[9] = 0x444DC98A
		pgs[10] ="shape.dll"
	elseif pg =="进阶天兵_普通"then
	    pgs[1] = 0x35D94E14
		pgs[2] = 0xE8E36824
		pgs[3] = 0xAF1B4B61
		pgs[4] = 0x1F48EF9F
		pgs[6] = 0x263409F7
		pgs[7] = 0x941C1119
		pgs[8] = 0x5F4DDF7F
		pgs[9] = 0xCF984CBD
		pgs[10] ="shape.dll"
	elseif pg =="新手召唤兽_普通"then
	    pgs[1]=0x000F0278
		pgs[2]=0x000F0278
		pgs[3]=0x000EF1C1
		pgs[4]=0x000EFA36
		pgs[6]=0x000F0A7D
		pgs[7]=0x000F2327
		pgs[8]=0x000F1B23
		pgs[9]=0x000EE994
		pgs[10] ="shape.dll"
	elseif pg =="进阶噬天虎_普通"then
	    pgs[1] = 0x43D13A6E
		pgs[2] = 0x43D13A6E
		pgs[3] = 0x934DB2E8
		pgs[4] = 0x8605C3B4
		pgs[6] = 0x4B31B9DB
		pgs[7] = 0x5AE86B6D
		pgs[8] = 0x88628ABC
		pgs[9] = 0x21F41A63
		pgs[10] ="shape.dll"
	elseif pg =="进阶百足将军_普通"then
	    pgs[1] = 2719324290
		pgs[2] = 0x23087F63
		pgs[3] = 0x40C65332
		pgs[4] = 0x7E435160
		pgs[6] = 0x358DCB43
		pgs[7] = 0xA2159882
		pgs[8] = 0x6F6B53A9
		pgs[9] = 0x78DC8F28
		pgs[10] ="shape.dll"
	elseif pg =="进阶天将_普通"then
	    pgs[1] = 0xAF5E9D11
		pgs[2] = 0xAF5E9D11
		pgs[3] = 0xF8941B27
		pgs[4] = 0xB90ED478
		pgs[6] = 0x236C7E78
		pgs[7] = 0x38A3BA7A
		pgs[8] = 0x2F969199
		pgs[9] = 0x666FA5FF
		pgs[10] ="shape.dll"
	elseif pg =="进阶星灵仙子_普通"then
	    pgs[1] = 0xB2A69A57
		pgs[2] = 0xB2A69A57
		pgs[3] = 0xC50D683C
		pgs[4] = 0x68B373FD
		pgs[6] = 0x75E24AAD
		pgs[7] = 0xCD464FE7
		pgs[8] = 0x9DB4E74E
		pgs[9] = 0x2D167267
		pgs[10] ="shape.dll"
	elseif pg =="进阶蜃气妖_普通"then
	    pgs[1] = 0x481691FA
		pgs[2] = 0x481691FA
		pgs[3] = 0x92234C89
		pgs[4] = 0x887522C9
		pgs[6] = 0x304CE44C
		pgs[7] = 0x244C4F16
		pgs[8] = 0xF4DD7911
		pgs[9] = 0x61A67852
		pgs[10] ="shape.dll"
	elseif pg =="进阶鬼将_普通"then
	    pgs[1] = 0xE16C41AF
		pgs[2] = 0xE16C41AF
		pgs[3] = 0x890EFD9F
		pgs[4] = 0xE7E5E555
		pgs[6] = 0x275E43D0
		pgs[7] = 0xFAB026B1
		pgs[8] = 0xBD7075E0
		pgs[9] = 0x8609FB4C
		pgs[10] ="shape.dll"
	elseif pg =="进阶狂豹人形_普通"then
	    pgs[1] = 0x3DC7DB59
		pgs[2] = 0x3DC7DB59
		pgs[3] = 0x5D2CDD31
		pgs[4] = 0xA960269A
		pgs[6] = 0xE9E47BF8
		pgs[7] = 0xC04E7031
		pgs[8] = 0xEA42D997
		pgs[9] = 0x4D2FA042
		pgs[10] ="shape.dll"
	elseif pg =="进阶踏云兽_普通"then
	    pgs[1] = 0xD04BFDC1
		pgs[2] = 0xD04BFDC1
		pgs[3] = 0xB01111D9
		pgs[4] = 0xFA3ED116
		pgs[6] = 0x4B1AAA96
		pgs[7] = 0xB73151F2
		pgs[8] = 0x4194B6ED
		pgs[9] = 0xB73151F2
		pgs[10] ="shape.dll"
	elseif pg =="进阶白熊_普通"then
	    pgs[1] = 0x36221458
		pgs[2] = 0x36221458
		pgs[3] = 0x9D440DE2
		pgs[4] = 0x87074A6D
		pgs[6] = 0x456ED9AE
		pgs[7] = 0x8F754AB3
		pgs[8] = 0xC2E91BB6
		pgs[9] = 0x67374C54
		pgs[10] ="shape.dll"
	elseif pg =="进阶机关兽_普通"then
	    pgs[1] = 0xF16E2546
		pgs[2] = 0xF16E2546
		pgs[3] = 0x3076BA30
		pgs[4] = 0xF65B08C3
		pgs[6] = 0x3C4007F5
		pgs[7] = 0x92117A35
		pgs[8] = 0x729B428B
		pgs[9] = 0x414CCFB2
		pgs[10] ="shape.dll"
	elseif pg =="进阶蝎子精_普通"then
	    pgs[1] = 0xBB5D5C67
		pgs[2] = 0xBB5D5C67
		pgs[3] = 0x80535B44
		pgs[4] = 0x8007428F
		pgs[6] = 0xC433446F
		pgs[7] = 0xD5FDDCC6
		pgs[8] = 0x3295E9E7
		pgs[9] = 0x33DE7412
		pgs[10] ="shape.dll"
	elseif pg =="进阶蛟龙_普通"then
	    pgs[1] = 0xA815AA97
		pgs[2] = 0xA815AA97
		pgs[3] = 0x79423CC9
		pgs[4] = 0x644C7AD6
		pgs[6] = 0x48915E95
		pgs[7] = 0x77FAB65D
		pgs[8] = 0x768EC51E
		pgs[9] = 0x48971844
		pgs[10] ="shape.dll"
	elseif pg =="进阶千年蛇魅_普通"then
	    pgs[1] = 0xC0B4DE3E
		pgs[2] = 0xC0B4DE3E
		pgs[3] = 0x7AC3FD14
		pgs[4] = 0x8C0E8FD0
		pgs[6] = 0xA14F4A62
		pgs[7] = 0xB4F3EE56
		pgs[8] = 0xA4AC72C1
		pgs[9] = 0x6E54D4E3
		pgs[10] ="shape.dll"
	elseif pg =="进阶犀牛将军人形_普通"then
	    pgs[1] = 0x9D7F2AD0
		pgs[2] = 3270659590
		pgs[3] = 0xB56C293E
		pgs[4] = 0x968FE790
		pgs[6] = 0xB1156F73
		pgs[7] = 0xC2F24E06
		pgs[8] = 0xCFFE9FB9
		pgs[9] = 0xCE559EB3
		pgs[10] ="shape.dll"
	elseif pg =="进阶锦毛貂精_普通"then
	    pgs[1] = 0x5AC32BC4
		pgs[2] = 0x5AC32BC4
		pgs[3] = 0xADEAB1FE
		pgs[4] = 0x75E66AF1
		pgs[6] = 0x99544991
		pgs[7] = 0x5AC32BC4
		pgs[8] = 0x8CFB251C
		pgs[9] = 0x4DC8DCA5
		pgs[10] ="shape.dll"
	elseif pg =="进阶夜罗刹_普通"then
	    pgs[1] = 0xF8E3BC67
		pgs[2] = 0xF8E3BC67
		pgs[3] = 0x64EDA875
		pgs[4] = 0xB4575348
		pgs[6] = 0x9FB38604
		pgs[7] = 0x3B1B850E
		pgs[8] = 0xC5A45B35
		pgs[9] = 0xF8BEAF49
		pgs[10] ="shape.dll"
	elseif pg =="进阶幽灵_普通"then
	    pgs[1] = 0x4C3A025E
		pgs[2] = 0x4C3A025E
		pgs[3] = 0x5DD590DF
		pgs[4] = 0x46F3A9D8
		pgs[6] = 0x5990A7C9
		pgs[7] = 0x2039517D
		pgs[8] = 0x3D0C212C
		pgs[9] = 0x7406D186
		pgs[10] ="shape.dll"
	elseif pg =="进阶雷鸟人_普通"then
	    pgs[1] = 0x6C7DE28C
		pgs[2] = 0x6C7DE28C
		pgs[3] = 0x3AA0420A
		pgs[4] = 0xA8E9E56A
		pgs[6] = 0x20393E62
		pgs[7] = 0x9F6B6DCE
		pgs[8] = 0x1281D163
		pgs[9] = 0x5B455BAB
		pgs[10] ="shape.dll"
	elseif pg =="进阶律法女娲_普通"then
	    pgs[1] = 0x63A7D355
		pgs[2] = 0x63A7D355
		pgs[3] = 0x790FEFD1
		pgs[4] = 0x8FC7C545
		pgs[6] = 0x6275654E
		pgs[7] = 0x19BBEFC4
		pgs[8] = 0x1CB46D32
		pgs[9] = 0x1B8CD1D4
		pgs[10] ="shape.dll"
	elseif pg =="进阶吸血鬼_普通"then
	    pgs[1] = 0x267C5264
		pgs[2] = 0x267C5264
		pgs[3] = 0xAA1D0068
		pgs[4] = 0xFA455F90
		pgs[6] = 0x573B321A
		pgs[7] = 0xAB400A93
		pgs[8] = 0xCE5EB1D9
		pgs[9] = 0x73C8493D
		pgs[10] ="shape.dll"
	elseif pg =="进阶蝴蝶仙子_普通"then
	    pgs[1] = 0x1E9603F8
		pgs[2] = 0x1E9603F8
		pgs[3] = 0x924D044A
		pgs[4] = 0xB092EA64
		pgs[6] = 0x40267F4C
		pgs[7] = 0x61AC2D26
		pgs[8] = 0xA07F8533
		pgs[9] = 0x067A5102
		pgs[10] ="shape.dll"
	elseif pg =="进阶画魂_普通"then
	    pgs[1] = 0x20CA6389
		pgs[2] = 0x20CA6389
		pgs[3] = 0x9C793FC3
		pgs[4] = 0x710D687A
		pgs[6] = 0xBAEE2ABE
		pgs[7] = 0x0F2B0078
		pgs[8] = 0x42260944
		pgs[9] = 0x9E3606F9
		pgs[10] ="shape.dll"
	elseif pg =="进阶雾中仙_普通"then
	    pgs[1] = 0x8F04916C
		pgs[2] = 0x8F04916C
		pgs[3] = 0x0CC89F7F
		pgs[4] = 0x064F72E1
		pgs[6] = 0x2D88FD84
		pgs[7] = 0xACD59062
		pgs[8] = 0x83538E76
		pgs[9] = 0xAAD6F9F0
		pgs[10] ="shape.dll"
	elseif pg =="进阶灵符女娲_普通"then
	    pgs[1] = 0xD6E49319
		pgs[2] = 0xD6E49319
		pgs[3] = 0x35642349
		pgs[4] = 0x6E281AD5
		pgs[6] = 0xC07F9136
		pgs[7] = 0x545C89D4
		pgs[8] = 0xB0A1E3E5
		pgs[9] = 0x07454B56
		pgs[10] ="shape.dll"
	elseif pg =="进阶金饶僧_普通"then
	    pgs[1] = 0x1AD25609
		pgs[2] = 0x1AD25609
		pgs[3] = 0x76CF52C3
		pgs[4] = 0xCDBE73B1
		pgs[6] = 0x8D076633
		pgs[7] = 0x4E6467C0
		pgs[8] = 0x3418E55B
		pgs[9] = 0xFA5D3745
		pgs[10] ="shape.dll"
	elseif pg =="镜妖_普通"then
	    pgs[1] = 0x65510E4C
		pgs[2] = 0x65510E4C
		pgs[3] = 0xDC463BAE
		pgs[4] = 0x17FED580
		pgs[6] = 0x41CADB40
		pgs[7] = 0x864E1613
		pgs[8] = 0x218810C3
		pgs[9] = 0x90E88043
		pgs[10] ="shape.dll"
	elseif pg =="进阶镜妖_普通"then
	    pgs[1] = 0x5213F252
		pgs[2] = 0x5213F252
		pgs[3] = 0xF7A9EE96
		pgs[4] = 0x7246C3FB
		pgs[6] = 0xB57EB974
		pgs[7] = 0x8E0A91B0
		pgs[8] = 0xDCAF8298
		pgs[9] = 0xE98705C8
		pgs[10] ="shape.dll"
	elseif pg =="金饶僧_普通"then
	    pgs[1] = 0x38E014D7
		pgs[2] = 0x38E014D7
		pgs[3] = 0x48AD22ED
		pgs[4] = 0x15A79F28
		pgs[6] = 0x8631C2B1
		pgs[7] = 0x2248AA45
		pgs[8] = 0x9B3CF0EA
		pgs[9] = 0x62CD189A
		pgs[10] ="shape.dll"
	elseif pg =="泪妖_普通"then
	    pgs[1] = 0x6F0B153D
		pgs[2] = 0x6F0B153D
		pgs[3] = 0xBB6C68EB
		pgs[4] = 0x17ACFC2C
		pgs[6] = 0x27BECE4E
		pgs[7] = 0x9E599B6C
		pgs[8] = 0x147F84A6
		pgs[9] = 0x6D93F6D8
		pgs[10] ="shape.dll"
	elseif pg =="进阶泪妖_普通"then
	    pgs[1] = 0x52E785F1
		pgs[2] = 0x52E785F1
		pgs[3] = 0x70C439E3
		pgs[4] = 0xEF70986D
		pgs[6] = 0x13F0C5C2
		pgs[7] = 0x840F0720
		pgs[8] = 0x6272607D
		pgs[9] = 0x01C7595D
		pgs[10] ="shape.dll"
	elseif pg =="增长巡守_普通"then
	    pgs[1] = 0x030573CE
		pgs[2] = 0x030573CE
		pgs[3] = 0x2642269B
		pgs[4] = 0xF62FE03D
		pgs[6] = 0x1E06D7E8
		pgs[7] = 0x34FBC7D6
		pgs[8] = 0xC0FCC4AE
		pgs[9] = 0x70884304
		pgs[10] ="shape.dll"
	elseif pg =="持国巡守_普通"then
	    pgs[1] = 0x5CFD0CC0
		pgs[2] = 0x5CFD0CC0
		pgs[3] = 0x5AC5EAC2
		pgs[4] = 0xCF762FBB
		pgs[6] = 0x45763667
		pgs[7] = 0x1FD31FF6
		pgs[8] = 0xCCC693A8
		pgs[9] = 0x6F97964A
		pgs[10] ="shape.dll"
	elseif pg =="般若天女_普通"then
	    pgs[1] = 0x5FCBF9E2
		pgs[2] = 0x5FCBF9E2
		pgs[3] = 0xF0E1008C
		pgs[4] = 0x08C0F8A8
		pgs[6] = 0x3E01B3D0
		pgs[7] = 0x04149886
		pgs[8] = 0x7DFE4872
		pgs[9] = 0xE86E0AA8
		pgs[10] ="shape.dll"
	elseif pg =="进阶般若天女_普通"then
	    pgs[1] = 0x16371442
		pgs[2] = 0x16371442
		pgs[3] = 0x0C8B30E8
		pgs[4] = 0xF04C4E62
		pgs[6] = 0x78B01CF9
		pgs[7] = 0x6C341850
		pgs[8] = 0x6A0FF793
		pgs[9] = 0x184A6609
		pgs[10] ="shape.dll"
	elseif pg =="灵灯侍者_普通"then
	    pgs[1] = 0x2A897C32
		pgs[2] = 0x2A897C32
		pgs[3] = 0x32E364CF
		pgs[4] = 0xD97F5424
		pgs[6] = 0x5723E136
		pgs[7] = 0xACEAD4A9
		pgs[8] = 0xD06B232C
		pgs[9] = 0x23FFF355
		pgs[10] ="shape.dll"
	elseif pg =="进阶灵灯侍者_普通"then
	    pgs[1] = 0x19FAE659
		pgs[2] = 0x19FAE659
		pgs[3] = 0x72BD4045
		pgs[4] = 0x368BCC8A
		pgs[6] = 0x8B46AE73
		pgs[7] = 0x2E4DDED0
		pgs[8] = 0x6C8D5D7F
		pgs[9] = 0x490DAC93
		pgs[10] ="shape.dll"
	elseif pg =="琴仙_普通"then
	    pgs[1] = 0xBAA0035A
		pgs[2] = 0xBAA0035A
		pgs[3] = 0xC4E0425C
		pgs[4] = 0x595067A7
		pgs[6] = 0x23944B4F
		pgs[7] = 0x3262C63D
		pgs[8] = 0x0C1E363C
		pgs[9] = 0xFB047799
		pgs[10] ="shape.dll"
	elseif pg =="进阶琴仙_普通"then
	    pgs[1] = 0xA7374E9F
		pgs[2] = 0xA7374E9F
		pgs[3] = 0x48248008
		pgs[4] = 0x7E11E45C
		pgs[6] = 0x24E7E45C
		pgs[7] = 0x7316DC16
		pgs[8] = 0x5E0B0694
		pgs[9] = 0xB1343D2A
		pgs[10] ="shape.dll"
	--神兽
	elseif pg == "超级腾蛇_普通" then
	    pgs[1] = 0x2D55C711
		pgs[2] = 0x2D55C711
		pgs[3] = 0x194B0A66
		pgs[4] = 0xF4DDF4C7
		pgs[6] = 0x277A9966
        pgs[7] = 0x1BF0086B
        pgs[8] = 0x8CFB271D
        pgs[9] = 0x0ADF554C
        pgs[10] = "shape.dll"
	elseif pg =="超级神鸡_普通"then
	    pgs[1] = 0x15965F51
		pgs[2] = 0x15965F51
		pgs[3] = 0xF918866B
		pgs[4] = 0x0F38B4D9
		pgs[6] = 0x2BDAF419
		pgs[7] = 0x92A411A1
		pgs[8] = 0x82EEF8AD
		pgs[9] = 0x070CB2A1
		pgs[10] ="shape.dll"
	elseif pg =="超级土地公公_普通"then
	    pgs[1] = 0x25AF3DAA
		pgs[2] = 0x25AF3DAA
		pgs[3] = 0x2AF1B450
		pgs[4] = 0xCA94057A
		pgs[6] = 0x97026CE8
		pgs[7] = 0x47A8D01F
		pgs[8] = 0x1871EC74
		pgs[9] = 0x99223ED8
		pgs[10] ="shape.dll"
	-- elseif pg =="超级人参娃娃_普通"then
	--     pgs[1] = 0x000D9783
	-- 	pgs[2] = 0x000D9783
	-- 	pgs[3] = 0xE7A003F1
	-- 	pgs[4] = 0x4CDC6BB6
	-- 	pgs[6] = 0x2BC67A5F
	-- 	pgs[7] = 0x48684A76
	-- 	pgs[8] = 0xB3BE1374
	-- 	pgs[9] = 0x8AF9964F
	-- 	pgs[10] ="shape.dll"
	-- elseif pg =="超级筋斗云_普通"then
	--     pgs[1] = 0x8B2F2F9B
	-- 	pgs[2] = 0x8B2F2F9B
	-- 	pgs[3] = 0x7A8436FD
	-- 	pgs[4] = 0x818FF438
	-- 	pgs[6] = 0x02379071
	-- 	pgs[7] = 0xF509F1E1
	-- 	pgs[8] = 0x256F1AF4
	-- 	pgs[9] = 0x9862F314
	-- 	pgs[10] ="shape.dll"
	-- elseif pg =="超级大鹏_普通"then
	--     pgs[1] = 0x1CE13606
	-- 	pgs[2] = 0x1CE13606
	-- 	pgs[3] = 0x250ACC97
	-- 	pgs[4] = 0x57388E49
	-- 	pgs[6] = 0x3AF99E76
	-- 	pgs[7] = 0xBE426A11
	-- 	pgs[8] = 0x8A6EB7CC
	-- 	pgs[9] = 0xF320C91E
	-- 	pgs[10] ="shape.dll"
	-- elseif pg =="超级麒麟_普通"then
	--     pgs[1] = 0x9CEBC627
	-- 	pgs[2] = 0x9CEBC627
	-- 	pgs[3] = 0x6CF41D88
	-- 	pgs[4] = 0xFE90C7E8
	-- 	pgs[6] = 0xFF1A400D
	-- 	pgs[7] = 0x51E4D7C2
	-- 	pgs[8] = 0x3F2F2665
	-- 	pgs[9] = 0x04B94943
	-- 	pgs[10] ="shape.dll"
	-- elseif pg =="超级孔雀_普通"then
	--     pgs[1] = 0x0504A51B
	-- 	pgs[2] = 0x0504A51B
	-- 	pgs[3] = 0x8378F293
	-- 	pgs[4] = 0xB553702F
	-- 	pgs[6] = 0x6A788030
	-- 	pgs[7] = 0xD05DC9EB
	-- 	pgs[8] = 0xDD1B6B4A
	-- 	pgs[9] = 0x6B62E486
	-- 	pgs[10] ="shape.dll"
	-- elseif pg =="超级大熊猫_普通"then
	--     pgs[1] = 0xEEA8BA73
	-- 	pgs[2] = 0xEEA8BA73
	-- 	pgs[3] = 0x28F2D85A
	-- 	pgs[4] = 0x4517E097
	-- 	pgs[6] = 0x24EAC80D
	-- 	pgs[7] = 0x479EB55A
	-- 	pgs[8] = 0xD1BDA75F
	-- 	pgs[9] = 0x3380E107
	-- 	pgs[10] ="shape.dll"
	-- elseif pg =="超级神马_普通"then
	--     pgs[1] = 0x54E2C4FC
	-- 	pgs[2] = 0x54E2C4FC
	-- 	pgs[3] = 0x815821B5
	-- 	pgs[4] = 0xCDEE504D
	-- 	pgs[6] = 0x7F354CC7
	-- 	pgs[7] = 0xBB81A407
	-- 	pgs[8] = 0xC198AE91
	-- 	pgs[9] = 0x2803B38C
	-- 	pgs[10] ="shape.dll"
	-- elseif pg =="超级六耳猕猴_普通"then
	--     pgs[1] = 0xBFB3306A
	-- 	pgs[2] = 0xBFB3306A
	-- 	pgs[3] = 0xF45D1F93
	-- 	pgs[4] = 0xDE8FCD95
	-- 	pgs[6] = 0x0D9EBABC
	-- 	pgs[7] = 0x68108E38
	-- 	pgs[8] = 0xDE8F6E5A
	-- 	pgs[9] = 0xE93C3E81
	-- 	pgs[10] ="shape.dll"
	-- elseif pg =="超级神龙_普通"then
	--     pgs[1] = 0x83D92AE3
	-- 	pgs[2] = 0x83D92AE3
	-- 	pgs[3] = 0x0E167636
	-- 	pgs[4] = 0x97AD4D51
	-- 	pgs[6] = 0x5FF3EEFD
	-- 	pgs[7] = 0xF49E974E
	-- 	pgs[8] = 0x3B42F8B4
	-- 	pgs[9] = 0x4A238044
	-- 	pgs[10] ="shape.dll"
	-- elseif pg =="超级大象_普通"then
	--     pgs[1] = 0x1752A15D
	-- 	pgs[2] = 0x1752A15D
	-- 	pgs[3] = 0x6B012F02
	-- 	pgs[4] = 0x73C54B13
	-- 	pgs[6] = 0x8E5B6E48
	-- 	pgs[7] = 0xBE5CDC49
	-- 	pgs[8] = 0xD26F85A4
	-- 	pgs[9] = 0x0EB91A8D
	-- 	pgs[10] ="shape.dll"
	-- elseif pg =="超级金猴_普通"then
	--     pgs[1] = 0x12BF6FC0
	-- 	pgs[2] = 0x12BF6FC0
	-- 	pgs[3] = 0x2E6F465E
	-- 	pgs[4] = 0xBAF219BA
	-- 	pgs[6] = 0x5CFB35A4
	-- 	pgs[7] = 0x3F2F6B47
	-- 	pgs[8] = 0x2A76AF8E
	-- 	pgs[9] = 0x818B17F7
	-- 	pgs[10] ="shape.dll"
	-- elseif pg =="超级泡泡_普通"then
	--     pgs[1] = 0xEA07D23E
	-- 	pgs[2] = 0xEA07D23E
	-- 	pgs[3] = 0xC1F40330
	-- 	pgs[4] = 0x1025669C
	-- 	pgs[6] = 0xE2D684A7
	-- 	pgs[7] = 0x31FE8589
	-- 	pgs[8] = 0xAFEE30DC
	-- 	pgs[9] = 0x3413F529
	-- 	pgs[10] ="shape.dll"
	-- elseif pg =="超级神羊_普通"then
	--     pgs[1] = 0x7E60BB6C
	-- 	pgs[2] = 0x7E60BB6C
	-- 	pgs[3] = 0xC162B3F3
	-- 	pgs[4] = 0x4312B448
	-- 	pgs[6] = 0x2296B535
	-- 	pgs[7] = 0x26A9EF1F
	-- 	pgs[8] = 0xBF961C95
	-- 	pgs[9] = 0x139C8FF3
	-- 	pgs[10] ="shape.dll"
	-- elseif pg =="超级神虎_普通"then
	--     pgs[1] = 0x8452D27F
	-- 	pgs[2] = 0x8452D27F
	-- 	pgs[3] = 0x16F9A3E7
	-- 	pgs[4] = 0x9B50048D
	-- 	pgs[6] = 0x1174DEC2
	-- 	pgs[7] = 0x24F80534
	-- 	pgs[8] = 0xDE5B6EB0
	-- 	pgs[9] = 0xEAFEAE18
	-- 	pgs[10] ="shape.dll"
	-- elseif pg =="超级青鸾_普通"then
	--     pgs[1] = 0xD2494FBC
	-- 	pgs[2] = 0xD2494FBC
	-- 	pgs[3] = 0x136F530A
	-- 	pgs[4] = 0x99A6AED4
	-- 	pgs[6] = 0xC1E9A273
	-- 	pgs[7] = 0x4E372650
	-- 	pgs[8] = 0xC369D5F9
	-- 	pgs[9] = 0x7013F056
	-- 	pgs[10] ="shape.dll"
	elseif pg =="超级赤焰兽_普通"then
	    pgs[1] = 0xD24D54AC
		pgs[2] = 0xD24D54AC
		pgs[3] = 0x8F5C9F7A
		pgs[4] = 0xB4A07130
		pgs[6] = 0x183AB443
		pgs[7] = 0xD4C96E33
		pgs[8] = 0x2B9DCF67
		pgs[9] = 0xADDB702B
		pgs[10] ="shape.dll"
	--elseif pg == "超级周杰伦_普通" or pg == "进阶超级周杰伦_普通"then
	---	pgs[6] = 0xA81EA7D2
		--pgs[9] = 0x31B65A0A
	--	pgs[8] = 0x3EBB092D
	--	pgs[5] = 0xF2AE7F68
	--	pgs[4] = 0xB67D1163
		--pgs[1] = 0x7B6CA3D6
		--pgs[2] = 0xAA5313BB
	--	pgs[7] = 0xAD73D867
	--	pgs[3] = 0xB9C13DAB
	--	pgs[10] = "xzsc.wdf"
	-- elseif pg =="超级白泽_普通"then
	--     pgs[1] = 0x46229E6F
	-- 	pgs[2] = 0x46229E6F
	-- 	pgs[3] = 0x8786565C
	-- 	pgs[4] = 0x920B8D0E
	-- 	pgs[6] = 0xDE06522C
	-- 	pgs[7] = 0xCC60A0B4
	-- 	pgs[8] = 0xA45E50B2
	-- 	pgs[9] = 0xB56BA2DF
	-- 	pgs[10] ="shape.dll"
	-- elseif pg =="超级神蛇_普通"then
	--     pgs[1] = 0xA6BA684D
	-- 	pgs[2] = 0xA6BA684D
	-- 	pgs[3] = 0x7BBEC060
	-- 	pgs[4] = 0x6CDDC04D
	-- 	pgs[6] = 0x6EA5597F
	-- 	pgs[7] = 0xB255F50B
	-- 	pgs[8] = 0x9911DED2
	-- 	pgs[9] = 0x55E342FC
	-- 	pgs[10] ="shape.dll"
	-- elseif pg =="超级海豚_普通"then
	--     pgs[1] = 0x52AB750A
	-- 	pgs[2] = 0x52AB750A
	-- 	pgs[3] = 0xD03C19EF
	-- 	pgs[4] = 0x65BCDD9F
	-- 	pgs[6] = 0x4B592393
	-- 	pgs[7] = 0x66B6EDAD
	-- 	pgs[8] = 0x84D2F6B7
	-- 	pgs[9] = 0xF2142000
	-- 	pgs[10] ="shape.dll"
	-- elseif pg =="超级神兔_普通"then
	--     pgs[1] = 0x0009487B
	-- 	pgs[2] = 0x0009487B
	-- 	pgs[3] = 0x487C29A2
	-- 	pgs[4] = 0x3A52E796
	-- 	pgs[6] = 0xF9777AA1
	-- 	pgs[7] = 0x97F8F299
	-- 	pgs[8] = 0x54370885
	-- 	pgs[9] = 0xAEF12C9A
	-- 	pgs[10] ="shape.dll"
	-- elseif pg =="超级灵鹿_普通"then
	--     pgs[1] = 0x40E44F30
	-- 	pgs[2] = 0x40E44F30
	-- 	pgs[3] = 0x5419AFEC
	-- 	pgs[4] = 0xF776BF6E
	-- 	pgs[6] = 0x49578F89
	-- 	pgs[7] = 0xCD20A9E1
	-- 	pgs[8] = 0xCAC235C1
	-- 	pgs[9] = 0x5D0BA7D9
	-- 	pgs[10] ="shape.dll"
	-- elseif pg =="超级神牛_普通"then
	--     pgs[1] = 0xB97EBFC0
	-- 	pgs[2] = 0xB97EBFC0
	-- 	pgs[3] = 0x64043116
	-- 	pgs[4] = 0x7F00FDBB
	-- 	pgs[6] = 0xA9C5802F
	-- 	pgs[7] = 0xC9B03C6C
	-- 	pgs[8] = 0xB068D594
	-- 	pgs[9] = 0x70327CC1
	-- 	pgs[10] ="shape.dll"
	elseif pg == "超级神猴_普通" then
	    pgs[1] = 0x6C1336EC
		pgs[2] = 0x6C1336EC
		pgs[3] = 0x6FF03AB0
		pgs[4] = 0xB3A2B015
		pgs[6] = 0x14692807
        pgs[7] = 0xE42F3F94
        pgs[8] = 0xCCAC3F69
        pgs[9] = 0x5DE938BA
        pgs[10] = "shape.dll"
	elseif pg =="进阶超级神鸡_普通"then
	    pgs[1] = 0x15965F51
		pgs[2] = 0x15965F51
		pgs[3] = 0xF918866B
		pgs[4] = 0x0F38B4D9
		pgs[6] = 0x2BDAF419
		pgs[7] = 0x92A411A1
		pgs[8] = 0x82EEF8AD
		pgs[9] = 0x070CB2A1
		pgs[10] ="shape.dll"
	elseif pg =="进阶超级土地公公_普通"then
	    pgs[1] = 0x25AF3DAA
		pgs[2] = 0x25AF3DAA
		pgs[3] = 0x2AF1B450
		pgs[4] = 0xCA94057A
		pgs[6] = 0x97026CE8
		pgs[7] = 0x47A8D01F
		pgs[8] = 0x1871EC74
		pgs[9] = 0x99223ED8
		pgs[10] ="shape.dll"
	elseif pg =="进阶超级人参娃娃_普通"then
	    pgs[1] = 0x000D9783
		pgs[2] = 0x000D9783
		pgs[3] = 0xE7A003F1
		pgs[4] = 0x4CDC6BB6
		pgs[6] = 0x2BC67A5F
		pgs[7] = 0x48684A76
		pgs[8] = 0xB3BE1374
		pgs[9] = 0x8AF9964F
		pgs[10] ="shape.dll"
	elseif pg =="进阶超级筋斗云_普通"then
	    pgs[1] = 0x8B2F2F9B
		pgs[2] = 0x8B2F2F9B
		pgs[3] = 0x7A8436FD
		pgs[4] = 0x818FF438
		pgs[6] = 0x02379071
		pgs[7] = 0xF509F1E1
		pgs[8] = 0x256F1AF4
		pgs[9] = 0x9862F314
		pgs[10] ="shape.dll"
	elseif pg =="进阶超级大鹏_普通"then
	    pgs[1] = 0x1CE13606
		pgs[2] = 0x1CE13606
		pgs[3] = 0x250ACC97
		pgs[4] = 0x57388E49
		pgs[6] = 0x3AF99E76
		pgs[7] = 0xBE426A11
		pgs[8] = 0x8A6EB7CC
		pgs[9] = 0xF320C91E
		pgs[10] ="shape.dll"
	elseif pg =="进阶超级麒麟_普通"then
	    pgs[1] = 0x9CEBC627
		pgs[2] = 0x9CEBC627
		pgs[3] = 0x6CF41D88
		pgs[4] = 0xFE90C7E8
		pgs[6] = 0xFF1A400D
		pgs[7] = 0x51E4D7C2
		pgs[8] = 0x3F2F2665
		pgs[9] = 0x04B94943
		pgs[10] ="shape.dll"
	elseif pg =="进阶超级孔雀_普通"then
	    pgs[1] = 0x0504A51B
		pgs[2] = 0x0504A51B
		pgs[3] = 0x8378F293
		pgs[4] = 0xB553702F
		pgs[6] = 0x6A788030
		pgs[7] = 0xD05DC9EB
		pgs[8] = 0xDD1B6B4A
		pgs[9] = 0x6B62E486
		pgs[10] ="shape.dll"
	elseif pg =="进阶超级大熊猫_普通"then
	    pgs[1] = 0xEEA8BA73
		pgs[2] = 0xEEA8BA73
		pgs[3] = 0x28F2D85A
		pgs[4] = 0x4517E097
		pgs[6] = 0x24EAC80D
		pgs[7] = 0x479EB55A
		pgs[8] = 0xD1BDA75F
		pgs[9] = 0x3380E107
		pgs[10] ="shape.dll"
	elseif pg =="进阶超级神马_普通"then
	    pgs[1] = 0x54E2C4FC
		pgs[2] = 0x54E2C4FC
		pgs[3] = 0x815821B5
		pgs[4] = 0xCDEE504D
		pgs[6] = 0x7F354CC7
		pgs[7] = 0xBB81A407
		pgs[8] = 0xC198AE91
		pgs[9] = 0x2803B38C
		pgs[10] ="shape.dll"
	elseif pg =="进阶超级六耳猕猴_普通"then
	    pgs[1] = 0xBFB3306A
		pgs[2] = 0xBFB3306A
		pgs[3] = 0xF45D1F93
		pgs[4] = 0xDE8FCD95
		pgs[6] = 0x0D9EBABC
		pgs[7] = 0x68108E38
		pgs[8] = 0xDE8F6E5A
		pgs[9] = 0xE93C3E81
		pgs[10] ="shape.dll"
	elseif pg =="进阶超级神龙_普通"then
	    pgs[1] = 0x83D92AE3
		pgs[2] = 0x83D92AE3
		pgs[3] = 0x0E167636
		pgs[4] = 0x97AD4D51
		pgs[6] = 0x5FF3EEFD
		pgs[7] = 0xF49E974E
		pgs[8] = 0x3B42F8B4
		pgs[9] = 0x4A238044
		pgs[10] ="shape.dll"
	elseif pg =="进阶超级大象_普通"then
	    pgs[1] = 0x1752A15D
		pgs[2] = 0x1752A15D
		pgs[3] = 0x6B012F02
		pgs[4] = 0x73C54B13
		pgs[6] = 0x8E5B6E48
		pgs[7] = 0xBE5CDC49
		pgs[8] = 0xD26F85A4
		pgs[9] = 0x0EB91A8D
		pgs[10] ="shape.dll"
	elseif pg =="进阶超级金猴_普通"then
	    pgs[1] = 0x12BF6FC0
		pgs[2] = 0x12BF6FC0
		pgs[3] = 0x2E6F465E
		pgs[4] = 0xBAF219BA
		pgs[6] = 0x5CFB35A4
		pgs[7] = 0x3F2F6B47
		pgs[8] = 0x2A76AF8E
		pgs[9] = 0x818B17F7
		pgs[10] ="shape.dll"
	elseif pg =="进阶超级泡泡_普通"then
	    pgs[1] = 0xEA07D23E
		pgs[2] = 0xEA07D23E
		pgs[3] = 0xC1F40330
		pgs[4] = 0x1025669C
		pgs[6] = 0xE2D684A7
		pgs[7] = 0x31FE8589
		pgs[8] = 0xAFEE30DC
		pgs[9] = 0x3413F529
		pgs[10] ="shape.dll"
	elseif pg =="进阶超级神羊_普通"then
	    pgs[1] = 0x7E60BB6C
		pgs[2] = 0x7E60BB6C
		pgs[3] = 0xC162B3F3
		pgs[4] = 0x4312B448
		pgs[6] = 0x2296B535
		pgs[7] = 0x26A9EF1F
		pgs[8] = 0xBF961C95
		pgs[9] = 0x139C8FF3
		pgs[10] ="shape.dll"
	elseif pg =="进阶超级神虎_普通"then
	    pgs[1] = 0x8452D27F
		pgs[2] = 0x8452D27F
		pgs[3] = 0x16F9A3E7
		pgs[4] = 0x9B50048D
		pgs[6] = 0x1174DEC2
		pgs[7] = 0x24F80534
		pgs[8] = 0xDE5B6EB0
		pgs[9] = 0xEAFEAE18
		pgs[10] ="shape.dll"
	elseif pg =="进阶超级青鸾_普通"then
	    pgs[1] = 0xD2494FBC
		pgs[2] = 0xD2494FBC
		pgs[3] = 0x136F530A
		pgs[4] = 0x99A6AED4
		pgs[6] = 0xC1E9A273
		pgs[7] = 0x4E372650
		pgs[8] = 0xC369D5F9
		pgs[9] = 0x7013F056
		pgs[10] ="shape.dll"
	elseif pg =="进阶超级赤焰兽_普通"then
	    pgs[1] = 0xD24D54AC
		pgs[2] = 0xD24D54AC
		pgs[3] = 0x8F5C9F7A
		pgs[4] = 0xB4A07130
		pgs[6] = 0x183AB443
		pgs[7] = 0xD4C96E33
		pgs[8] = 0x2B9DCF67
		pgs[9] = 0xADDB702B
		pgs[10] ="shape.dll"
	elseif pg =="进阶超级白泽_普通"then
	    pgs[1] = 0x46229E6F
		pgs[2] = 0x46229E6F
		pgs[3] = 0x8786565C
		pgs[4] = 0x920B8D0E
		pgs[6] = 0xDE06522C
		pgs[7] = 0xCC60A0B4
		pgs[8] = 0xA45E50B2
		pgs[9] = 0xB56BA2DF
		pgs[10] ="shape.dll"
	elseif pg =="进阶超级神蛇_普通"then
	    pgs[1] = 0xA6BA684D
		pgs[2] = 0xA6BA684D
		pgs[3] = 0x7BBEC060
		pgs[4] = 0x6CDDC04D
		pgs[6] = 0x6EA5597F
		pgs[7] = 0xB255F50B
		pgs[8] = 0x9911DED2
		pgs[9] = 0x55E342FC
		pgs[10] ="shape.dll"
	elseif pg =="进阶超级海豚_普通"then
	    pgs[1] = 0x52AB750A
		pgs[2] = 0x52AB750A
		pgs[3] = 0xD03C19EF
		pgs[4] = 0x65BCDD9F
		pgs[6] = 0x4B592393
		pgs[7] = 0x66B6EDAD
		pgs[8] = 0x84D2F6B7
		pgs[9] = 0xF2142000
		pgs[10] ="shape.dll"
	elseif pg =="进阶超级神兔_普通"then
	    pgs[1] = 0x0009487B
		pgs[2] = 0x0009487B
		pgs[3] = 0x487C29A2
		pgs[4] = 0x3A52E796
		pgs[6] = 0xF9777AA1
		pgs[7] = 0x97F8F299
		pgs[8] = 0x54370885
		pgs[9] = 0xAEF12C9A
		pgs[10] ="shape.dll"
	elseif pg =="进阶超级灵鹿_普通"then
	    pgs[1] = 0x40E44F30
		pgs[2] = 0x40E44F30
		pgs[3] = 0x5419AFEC
		pgs[4] = 0xF776BF6E
		pgs[6] = 0x49578F89
		pgs[7] = 0xCD20A9E1
		pgs[8] = 0xCAC235C1
		pgs[9] = 0x5D0BA7D9
		pgs[10] ="shape.dll"
	elseif pg =="进阶超级神牛_普通"then
	    pgs[1] = 0xB97EBFC0
		pgs[2] = 0xB97EBFC0
		pgs[3] = 0x64043116
		pgs[4] = 0x7F00FDBB
		pgs[6] = 0xA9C5802F
		pgs[7] = 0xC9B03C6C
		pgs[8] = 0xB068D594
		pgs[9] = 0x70327CC1
		pgs[10] ="shape.dll"
	elseif pg == "进阶超级神猴_普通" then
	    pgs[1] = 0x6C1336EC
		pgs[2] = 0x6C1336EC
		pgs[3] = 0x6FF03AB0
		pgs[4] = 0xB3A2B015
		pgs[6] = 0x14692807
        pgs[7] = 0xE42F3F94
        pgs[8] = 0xCCAC3F69
        pgs[9] = 0x5DE938BA
        pgs[10] = "shape.dll"
    elseif pg == "进阶超级腾蛇_普通" then
	    pgs[1] = 0x2D55C711
		pgs[2] = 0x2D55C711
		pgs[3] = 0x194B0A66
		pgs[4] = 0xF4DDF4C7
		pgs[6] = 0x277A9966
        pgs[7] = 0x1BF0086B
        pgs[8] = 0x8CFB271D
        pgs[9] = 0x0ADF554C
        pgs[10] = "shape.dll"
	elseif pg == "进阶超级玉兔_普通" then
	    pgs[1] = 0xAFF97BB0
		pgs[2] = 0xAFF97BB0
		pgs[3] = 0xFD013477
		pgs[4] = 0x00C8DD73
		pgs[6] = 0x046ADE41
        pgs[7] = 0xAFF97BB0
        pgs[8] = 0xDE64A152
        pgs[9] = 0x94C75679
        pgs[10] = "shape.dll"
    ----------新增新宠物-------------------------
    elseif pg =="飞燕女泡泡_普通"then
        pgs[1]=0x01000028
		pgs[2]=0x01000028
		pgs[3]=0x01000027
		pgs[4]=0x01000027
		pgs[6]=0x01000027
		pgs[7]=0x01000029
		pgs[8]=0x01000027
		pgs[9]=0x01000027
		pgs[10] ="wzife.wd5"
	elseif pg =="骨精灵泡泡_普通"then
        pgs[1]=0x01000031
		pgs[2]=0x01000031
		pgs[3]=0x01000030
		pgs[4]=0x01000030
		pgs[6]=0x01000030
		pgs[7]=0x01000032
		pgs[8]=0x01000030
		pgs[9]=0x01000030
		pgs[10] ="wzife.wd5"
	elseif pg =="剑侠客泡泡_普通"then
        pgs[1]=0x01000034
		pgs[2]=0x01000034
		pgs[3]=0x01000033
		pgs[4]=0x01000033
		pgs[6]=0x01000033
		pgs[7]=0x01000035
		pgs[8]=0x01000033
		pgs[9]=0x01000033
		pgs[10] ="wzife.wd5"
	elseif pg =="羽灵神泡泡_普通"then
        pgs[1]=0x01000037
		pgs[2]=0x01000037
		pgs[3]=0x01000036
		pgs[4]=0x01000036
		pgs[6]=0x01000036
		pgs[7]=0x01000038
		pgs[8]=0x01000036
		pgs[9]=0x01000036
		pgs[10] ="wzife.wd5"
	elseif pg == "武器_进阶地狱战神_普通"then
	   pgs[6] = 0xC59FC250
	   pgs[9] = 0xCDD6507A
	   pgs[8] = 0xE3451268
	   pgs[5] = 0x22671C0F
	   pgs[4] = 0xB760E037
	   pgs[1] = 0x637D9C6F
	   pgs[2] = 0x941FC7A4
	   pgs[7] = 0xFBB4FD56
	   pgs[3] = 0x602C6BA1
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶风伯_普通"then
	   pgs[6] = 0x100DC708
	   pgs[9] = 0x314A86A4
	   pgs[8] = 0xA773386B
	   pgs[5] = 0x354E676B
	   pgs[4] = 0x6B01FE15
	   pgs[1] = 0xC9B579C3
	   pgs[2] = 0x29B8E4D0
	   pgs[7] = 0x579292FB
	   pgs[3] = 0x08593D0B
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶天兵_普通"then
	   pgs[6] = 0xEBD9E26C
	   pgs[9] = 0x8A00FC84
	   pgs[8] = 0xFB0B8556
	   pgs[5] = 0xE14247A2
	   pgs[4] = 0x7950EA94
	   pgs[1] = 0x3A438D62
	   pgs[2] = 0x16E3EA8E
	   pgs[7] = 0x2480FBE9
	   pgs[3] = 0x1E69C9C5
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶天将_普通"then
	   pgs[6] = 0xE21D438D
	   pgs[9] = 0xEE404F3B
	   pgs[8] = 0xE4EBC336
	   pgs[5] = 0x7345E462
	   pgs[4] = 0x9E478081
	   pgs[1] = 0x9B5875EE
	   pgs[2] = 0xB46C8172
	   pgs[7] = 0xB45F1A21
	   pgs[3] = 0xA04A8792
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶碧水夜叉_普通"then
	   pgs[6] = 0x024B4816
	   pgs[9] = 0xBFE47349
	   pgs[8] = 0x5D5521EF
	   pgs[5] = 0x3995294F
	   pgs[4] = 0xAF99B5D7
	   pgs[1] = 0xF907D38F
	   pgs[2] = 0x007F3C3C
	   pgs[7] = 0xA2CC594D
	   pgs[3] = 0x23CDF937
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶凤凰_普通"then
	   pgs[6] = 0x6A19B804
	   pgs[9] = 0xDF71ECA7
	   pgs[8] = 0xF55DAC54
	   pgs[5] = 0x2A0AEC73
	   pgs[4] = 0xB9DFCCCA
	   pgs[1] = 0x2B004490
	   pgs[2] = 0x64A74BBD
	   pgs[7] = 0xB282F7D0
	   pgs[3] = 0x6FEE0CDE
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶蛟龙_普通"then
	   pgs[6] = 0x61192DC4
	   pgs[9] = 0x2C3E37A2
	   pgs[8] = 0x8057EF18
	   pgs[5] = 0x59F09DEB
	   pgs[4] = 0xD3F721DD
	   pgs[1] = 0x3541248B
	   pgs[2] = 0x769F42A3
	   pgs[7] = 0xD3CF4F30
	   pgs[3] = 0xA447C9C9
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶鲛人_普通"then
	   pgs[6] = 0xC30E9C64
	   pgs[9] = 0x0E3002E6
	   pgs[8] = 0xD0DF8ED8
	   pgs[5] = 0x210D0B0C
	   pgs[4] = 0x51E67BF4
	   pgs[1] = 0x233E123F
	   pgs[2] = 0xBBF0D5E5
	   pgs[7] = 0xD171ED1C
	   pgs[3] = 0xA7E04BA3
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶锦毛貂精_普通"then
	   pgs[6] = 0xF5452BCE
	   pgs[9] = 0xFB322308
	   pgs[8] = 0x29D2A239
	   pgs[5] = 0x59F66DD6
	   pgs[4] = 0x9893D7B8
	   pgs[1] = 0x566EB6DE
	   pgs[2] = 0x14F072A3
	   pgs[7] = 0xBDDD2CC8
	   pgs[3] = 0x73AB8FF6
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶千年蛇魅_普通"then
	   pgs[6] = 0x2FE148ED
	   pgs[9] = 0xEB0B92FA
	   pgs[8] = 0xD112B947
	   pgs[5] = 0xC51BEDE0
	   pgs[4] = 0x4EE14352
	   pgs[1] = 0x28D4057B
	   pgs[2] = 0x320D7BB6
	   pgs[7] = 0xF2558A57
	   pgs[3] = 0x9221732F
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶星灵仙子_普通"then
	   pgs[6] = 0x66501D93
	   pgs[9] = 0x8BAC6040
	   pgs[8] = 0x3916EE0A
	   pgs[5] = 0xCE9ED092
	   pgs[4] = 0x9E8F265D
	   pgs[1] = 0xA7D22776
	   pgs[2] = 0x37E3E3E1
	   pgs[7] = 0x2F25B66C
	   pgs[3] = 0xE10EA214
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶巡游天神_普通"then
	   pgs[6] = 0xFAEE3F9D
	   pgs[9] = 0x7D645673
	   pgs[8] = 0xFD8AE7A0
	   pgs[5] = 0xC8C13E26
	   pgs[4] = 0x2499EE14
	   pgs[1] = 0x2DBDA2A9
	   pgs[2] = 0x756D402A
	   pgs[7] = 0x17F2991C
	   pgs[3] = 0xAFE6EDA0
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶百足将军_普通"then
	   pgs[6] = 0x8043BC29
	   pgs[9] = 0x1EF5586E
	   pgs[8] = 0x29696F70
	   pgs[5] = 0xCFA4C4B0
	   pgs[4] = 0x0F211C03
	   pgs[1] = 0x494C4595
	   pgs[2] = 0xC62B1385
	   pgs[7] = 0xA1A959E0
	   pgs[3] = 0x4954B2BA
	   pgs[10] = "shape.dll"

	elseif pg == "武器_进阶野猪精_普通"then
	   pgs[6] = 0x6732F04F
	   pgs[9] = 0x272C1EC2
	   pgs[8] = 0x10EB7807
	   pgs[5] = 0xF7DF280A
	   pgs[4] = 0x0FC0C135
	   pgs[1] = 0xA3428DB1
	   pgs[2] = 0xF36AED64
	   pgs[7] = 0xA775FA1D
	   pgs[3] = 0x2BF711C4
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶吸血鬼_普通"then
	   pgs[6] = 0xB7F88174
	   pgs[9] = 0xD7BDA0A1
	   pgs[8] = 0x5E368AFF
	   pgs[5] = 0xB3FE5C26
	   pgs[4] = 0x255C1645
	   pgs[1] = 0x1E89D22D
	   pgs[2] = 0xA030CBD3
	   pgs[7] = 0xBC2F170A
	   pgs[3] = 0xE6DB5633
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶鬼将_普通"then
	   pgs[6] = 0x41225AA1
	   pgs[9] = 0x3E1168D4
	   pgs[8] = 0x0A7AC5E6
	   pgs[5] = 0x3567D770
	   pgs[4] = 0x09194066
	   pgs[1] = 0xA88CA530
	   pgs[2] = 0xCAF17D5B
	   pgs[7] = 0x90EA6D01
	   pgs[3] = 0x16C2B307
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶大力金刚_普通"then
	   pgs[6] = 0x062C6302
	   pgs[9] = 0x081F6EC9
	   pgs[8] = 0xEB60CB0E
	   pgs[5] = 0x24DA5E7C
	   pgs[4] = 0x0F470034
	   pgs[1] = 0xDFC04681
	   pgs[2] = 0x0C5EBE6E
	   pgs[7] = 0x8DA59241
	   pgs[3] = 0x35B27501
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶金饶僧_普通"then
	   pgs[6] = 0x78F9978E
	   pgs[9] = 0x06EF88D2
	   pgs[8] = 0x145C9DCE
	   pgs[5] = 0x815A4A92
	   pgs[4] = 0xDFDFC98F
	   pgs[1] = 0x9C87ABFB
	   pgs[2] = 0xAA2C6332
	   pgs[7] = 0x0FFA19B1
	   pgs[3] = 0x03093FAE
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶炎魔神_普通"then
	   pgs[6] = 0x6CE03673
	   pgs[9] = 0x2863F762
	   pgs[8] = 0x99D4FAFD
	   pgs[5] = 0x2592CDA1
	   pgs[4] = 0x95C37C43
	   pgs[1] = 0x2327B8D6
	   pgs[2] = 0xBB223177
	   pgs[7] = 0x3B13B79D
	   pgs[3] = 0xC21E54AE
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶机关人_普通"then
	   pgs[6] = 0x9AC1969F
	   pgs[9] = 0x70C9065C
	   pgs[8] = 0xEEF86490
	   pgs[5] = 0x33832208
	   pgs[4] = 0xF225CDEF
	   pgs[1] = 0x1B74F66D
	   pgs[2] = 0x9D79966C
	   pgs[7] = 0x87240F3C
	   pgs[3] = 0x6AB996E5
	   pgs[10] = "shape.dll"
	   elseif pg == "武器_机关人_普通"then
	   pgs[6] = 0x9AC1969F
	   pgs[9] = 0x70C9065C
	   pgs[8] = 0xEEF86490
	   pgs[5] = 0x33832208
	   pgs[4] = 0xF225CDEF
	   pgs[1] = 0x1B74F66D
	   pgs[2] = 0x9D79966C
	   pgs[7] = 0x87240F3C
	   pgs[3] = 0x6AB996E5
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶踏云兽_普通"then
	   pgs[6] = 0x5F06113B
	   pgs[9] = 0x12B329D4
	   pgs[8] = 0x9F080530
	   pgs[5] = 0xB2F769A1
	   pgs[4] = 0xC8079911
	   pgs[1] = 0x2D2B73A7
	   pgs[2] = 0xA9729279
	   pgs[7] = 0x8841F709
	   pgs[3] = 0xFBCEB0CF
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶机关鸟_普通"then
	   pgs[6] = 0x006A893A
	   pgs[9] = 0x6FD7F234
	   pgs[8] = 0x6885D06C
	   pgs[5] = 0x79366637
	   pgs[4] = 0xBF06D5B4
	   pgs[1] = 0xF9A2D92F
	   pgs[2] = 0xB00918E0
	   pgs[7] = 0xAD51D1D3
	   pgs[3] = 0xAA6CAFFF
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶连弩车_普通"then
	   pgs[6] = 0x89C32F37
	   pgs[9] = 0x3F5CB06A
	   pgs[8] = 0x2FC03212
	   pgs[5] = 0x7C4582FA
	   pgs[4] = 0xD473C1AE
	   pgs[1] = 0xB3305C85
	   pgs[2] = 0xD64D0170
	   pgs[7] = 0x35E7C606
	   pgs[3] = 0x78E5196B
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶长眉灵猴_普通"then
	   pgs[6] = 0x6A23896E
	   pgs[9] = 0x425AF14F
	   pgs[8] = 0x6E76ACA8
	   pgs[5] = 0x0512386F
	   pgs[4] = 0x27A28AEE
	   pgs[1] = 0xD51F4EC0
	   pgs[2] = 0x879BDDFD
	   pgs[7] = 0x618921C2
	   pgs[3] = 0xDDB553F1
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶巨力神猿_普通"then
	   pgs[6] = 0x9AA419BC
	   pgs[9] = 0x23FD3878
	   pgs[8] = 0x83FA33A7
	   pgs[5] = 0x5A0A2D79
	   pgs[4] = 0x95C22BD5
	   pgs[1] = 0xA8F2C40E
	   pgs[2] = 0x14D63E3B
	   pgs[7] = 0x18F60D89
	   pgs[3] = 0x6240BB61
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶金身罗汉_普通"then
	   pgs[6] = 0x87F218DD
	   pgs[9] = 0x97B03DD9
	   pgs[8] = 0x3C24D4EA
	   pgs[5] = 0x0BFBBE37
	   pgs[4] = 0x34CF819C
	   pgs[1] = 0x9FE8463B
	   pgs[2] = 0xC4C1B226
	   pgs[7] = 0xC75421CE
	   pgs[3] = 0xE0E766CF
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶般若天女_普通"then
	   pgs[6] = 0x7C384B09
	   pgs[9] = 0x2CE8DDB6
	   pgs[8] = 0xD8002F08
	   pgs[5] = 0x83B23110
	   pgs[4] = 0x75E7FFE4
	   pgs[1] = 0x025C4870
	   pgs[2] = 0x8EFA8FA1
	   pgs[7] = 0x0CCD1EC9
	   pgs[3] = 0x4EA6AECC
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶犀牛将军人形_普通"then
	   pgs[6] = 0x55BA7290
	   pgs[9] = 0x6119DD21
	   pgs[8] = 0x10209E45
	   pgs[5] = 0x79082997
	   pgs[4] = 0x16FEE4F8
	   pgs[1] = 0xB0C627DF
	   pgs[2] = 0xBA23FAF3
	   pgs[7] = 0xF03CBB7C
	   pgs[3] = 0x78DAF314
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶毗舍童子_普通"then
	   pgs[6] = 0x2090CD58
	   pgs[9] = 0xD2096B29
	   pgs[8] = 0xF3809653
	   pgs[5] = 0x035D3377
	   pgs[4] = 0xBA313F1D
	   pgs[1] = 0x5EB5809C
	   pgs[2] = 0xEC33FC29
	   pgs[7] = 0xEC27B7C7
	   pgs[3] = 0xB97A1FB7
	   pgs[10] = "shape.dll"
	elseif pg == "武器_进阶真陀护法_普通"then
	   pgs[6] = 0x25CA9002
	   pgs[9] = 0x48182F46
	   pgs[8] = 0xD85DECF6
	   pgs[5] = 0x55BDE154
	   pgs[4] = 0x1F17C455
	   pgs[1] = 0xF7088AA8
	   pgs[2] = 0x696DC25C
	   pgs[7] = 0xB3F86A1F
	   pgs[3] = 0x013EEA44
	   pgs[10] = "shape.dll"
	-- elseif pg == "武器_持国巡守_普通"then
	-- 	pgs[6] = 0x808D7DB0
	-- 	pgs[9] = 0x693B6570
	-- 	pgs[8] = 0x2285D8DA
	-- 	pgs[5] = 0x810AC543
	-- 	pgs[4] = 0x62BBBE35
	-- 	pgs[1] = 0x7062939A
	-- 	pgs[2] = 0x4BDEC579
	-- 	pgs[7] = 0x1CC2CC7F
	-- 	pgs[3] = 0x5F8742D4
	-- 	pgs[10] = "shape.dll"
	elseif pg == "武器_真陀护法_普通"then
		pgs[6] = 0x3AC2C970
		pgs[9] = 0x0B9071A9
		pgs[8] = 0x773C6119
		pgs[5] = 0xFCFA492C
		pgs[4] = 0x8E37564F
		pgs[1] = 0x2E9DD597
		pgs[2] = 0xFAE8742D
		pgs[7] = 0x1E0B54B2
		pgs[3] = 0xA56CC3EF
		pgs[10] = "shape.dll"
	elseif pg == "武器_猫灵兽形_普通"then
		pgs[6] = 0xCEB930FC
		pgs[9] = 0x68185371
		pgs[8] = 0x7F45C7D3
		pgs[5] = 0xBE74942A
		pgs[4] = 0xF2AB6B97
		pgs[1] = 0x9B1E867C
		pgs[2] = 0x7502F4F2
		pgs[7] = 0x3892D237
		pgs[3] = 0x4C69BB5C
		pgs[10] = "shape.dll"
	elseif pg == "武器_蝎子精_普通"then
		pgs[6] = 0xF3ED4E51
		pgs[9] = 0x162812C9
		pgs[8] = 0x8626BE8B
		pgs[5] = 0xA818B79A
		pgs[4] = 0x255D0384
		pgs[1] = 0x7206B355
		pgs[2] = 0xC40B14F2
		pgs[7] = 0xA966C9A6
		pgs[3] = 0x89A61E55
		pgs[10] = "shape.dll"
	elseif pg == "武器_葫芦宝贝_普通"then
		pgs[6] = 0x6C359915
		pgs[9] = 0x451AE40D
		pgs[8] = 0xBEF64509
		pgs[5] = 0xA0960AB1
		pgs[4] = 0x3B66453C
		pgs[1] = 0x1ACA499E
		pgs[2] = 0xFDC292F8
		pgs[7] = 0x96F813AE
		pgs[3] = 0xAF54DB30
		pgs[10] = "shape.dll"
	elseif pg == "武器_狂豹人形_普通"then
		pgs[6] = 0xEA8628BD
		pgs[9] = 0x68E474BF
		pgs[8] = 0xC114D3C8
		pgs[5] = 0x117E5AB0
		pgs[4] = 0xAFD927D8
		pgs[1] = 0x7AB878DD
		pgs[2] = 0x4B54CF50
		pgs[7] = 0xEFA51000
		pgs[3] = 0xCD8A8A52
		pgs[10] = "shape.dll"
	elseif pg == "武器_猫灵人形_普通"then
		pgs[6] = 0x19F7718E
		pgs[9] = 0xD4307215
		pgs[8] = 0x7A9CD33C
		pgs[5] = 0xAFDA4E03
		pgs[4] = 0x63C23C1F
		pgs[1] = 0xDAA5FD71
		pgs[2] = 0x5E90E616
		pgs[7] = 0xB989251D
		pgs[3] = 0x79CDBAB9
		pgs[10] = "shape.dll"
	elseif pg == "武器_金身罗汉_普通"then
		pgs[6] = 0x676E4514
		pgs[9] = 0xE661D1C4
		pgs[8] = 0x4DE355A1
		pgs[5] = 0x1BD399D4
		pgs[4] = 0x5DAA3352
		pgs[1] = 0x025E7649
		pgs[2] = 0xF03453FF
		pgs[7] = 0xA1592F3C
		pgs[3] = 0x1B2DB29F
		pgs[10] = "shape.dll"
	elseif pg == "武器_灵灯侍者_普通"then
		pgs[6] = 0x8F60C146
		pgs[9] = 0x42CC302E
		pgs[8] = 0xD06A9B95
		pgs[5] = 0xE7533DAD
		pgs[4] = 0xB15D88A9
		pgs[1] = 0x24AEF9EB
		pgs[2] = 0xB82D81E6
		pgs[7] = 0x1F9B3F61
		pgs[3] = 0xB3C083A8
		pgs[10] = "shape.dll"
	elseif pg == "武器_般若天女_普通"then
		pgs[6] = 0x0A1059E2
		pgs[9] = 0xE1F2B9CC
		pgs[8] = 0xEDAFCFE8
		pgs[5] = 0x25603438
		pgs[4] = 0x844C5D01
		pgs[1] = 0x9549C17D
		pgs[2] = 0x56C89490
		pgs[7] = 0x79095C13
		pgs[3] = 0xA4574A61
		pgs[10] = "shape.dll"
	elseif pg == "武器_进阶鼠先锋_普通"then---------
	   pgs[6] = 0x81432EEA
	   pgs[9] = 0xF1819C25
	   pgs[8] = 0xE1FED58E
	   pgs[5] = 0xC1186D08
	   pgs[4] = 0x2E396D1F
	   pgs[1] = 0x83B37126
	   pgs[2] = 0x433B070C
	   pgs[7] = 0x1842937F
	   pgs[3] = 0x316180AF
	   pgs[10] = "shape.dll"
elseif pg == "涂山雪_普通"then
	   pgs[1] = 0xABC00086
	   pgs[2] = 0xABC00086
	   pgs[7] = 0xABC00086
	   pgs[3] = 0xABC00087
	   pgs[4] = 0xABC00088
	   pgs[9] = 0xABC00088
	   pgs[6] = 0xABC00089
	   pgs[8] = 0xABC00090
	   pgs[10] = "wpal/121.wpal"

	elseif pg == "进阶涂山雪_普通"then
	   pgs[1] = 0xABC00096
	   pgs[2] = 0xABC00096
	   pgs[7] = 0xABC00096
	   pgs[3] = 0xABC00097
	   pgs[4] = 0xABC00098
	   pgs[9] = 0xABC00098
	   pgs[6] = 0xABC00099
	   pgs[8] = 0xABC00100
	   pgs[10] = "wpal/121.wpal"
	   elseif pg == "狐不归_普通"then
	   pgs[1] = 0xABC00141
	   pgs[2] = 0xABC00141
	   pgs[7] = 0xABC00141
	   pgs[3] = 0xABC00142
	   pgs[4] = 0xABC00143
	   pgs[9] = 0xABC00143
	   pgs[6] = 0xABC00144
	   pgs[8] = 0xABC00145
	   pgs[10] = "wpal/121.wpal"
	elseif pg == "狐不归_饰品_普通"then
	   pgs[1] = 0xABC00146
	   pgs[2] = 0xABC00146
	   pgs[7] = 0xABC00146
	   pgs[3] = 0xABC00147
	   pgs[4] = 0xABC00148
	   pgs[9] = 0xABC00148
	   pgs[6] = 0xABC00149
	   pgs[8] = 0xABC00150
	   pgs[10] = "wpal/121.wpal"
	elseif pg == "进阶狐不归_普通"then
	   pgs[1] = 0xABC00151
	   pgs[2] = 0xABC00151
	   pgs[7] = 0xABC00151
	   pgs[3] = 0xABC00152
	   pgs[4] = 0xABC00153
	   pgs[9] = 0xABC00153
	   pgs[6] = 0xABC00154
	   pgs[8] = 0xABC00155
	   pgs[10] = "wpal/121.wpal"
	elseif pg == "进阶狐不归_饰品_普通"then
	   pgs[1] = 0xABC00156
	   pgs[2] = 0xABC00156
	   pgs[7] = 0xABC00156
	   pgs[3] = 0xABC00157
	   pgs[4] = 0xABC00158
	   pgs[9] = 0xABC00158
	   pgs[6] = 0xABC00159
	   pgs[8] = 0xABC00160
	   pgs[10] = "wpal/121.wpal"

	elseif pg == "超级神狗_普通"then---------
	   pgs[6] = 0xa0000004
	   pgs[9] = 0xa0000003
	   pgs[8] = 0xa0000005
	   pgs[4] = 0xa0000003
	   pgs[1] = 0xa0000001
	   pgs[2] = 0xa0000001
	   pgs[7] = 0xa0000001
	   pgs[3] = 0xa0000002
	   pgs[10] = "5"
	   elseif pg == "进阶超级神狗_普通"then---------
	   pgs[6] = 0xa0000004
	   pgs[9] = 0xa0000003
	   pgs[8] = 0xa0000005
	   pgs[4] = 0xa0000003
	   pgs[1] = 0xa0000001
	   pgs[2] = 0xa0000001
	   pgs[7] = 0xa0000001
	   pgs[3] = 0xa0000002
	   pgs[10] = "5"
	elseif pg == "超级神鼠_普通"then---------
	   pgs[6] = 0xa0000009
	   pgs[9] = 0xa0000008
	   pgs[8] = 0xa0000010
	   pgs[4] = 0xa0000008
	   pgs[1] = 0xa0000006
	   pgs[2] = 0xa0000006
	   pgs[7] = 0xa0000006
	   pgs[3] = 0xa0000007
	   pgs[10] = "5"
	elseif pg == "超级神猪_普通"then---------
	   pgs[6] = 0xa0000014
	   pgs[9] = 0xa0000013
	   pgs[8] = 0xa0000015
	   pgs[4] = 0xa0000013
	   pgs[1] = 0xa0000011
	   pgs[2] = 0xa0000011
	   pgs[7] = 0xa0000011
	   pgs[3] = 0xa0000012
	   pgs[10] = "5"
	   elseif pg == "进阶超级神猪_普通"then---------
	   pgs[6] = 0xa0000014
	   pgs[9] = 0xa0000013
	   pgs[8] = 0xa0000015
	   pgs[4] = 0xa0000013
	   pgs[1] = 0xa0000011
	   pgs[2] = 0xa0000011
	   pgs[7] = 0xa0000011
	   pgs[3] = 0xa0000012
	   pgs[10] = "5"
	elseif pg == "超级小白龙_普通"then---------
	   pgs[6] = 0xa0000019
	   pgs[9] = 0xa0000018
	   pgs[8] = 0xa0000020
	   pgs[4] = 0xa0000018
	   pgs[1] = 0xa0000016
	   pgs[2] = 0xa0000016
	   pgs[7] = 0xa0000016
	   pgs[3] = 0xa0000017
	   pgs[10] = "5"
	elseif pg == "超级猪小戒_普通"then---------
	   pgs[6] = 0xa0000024
	   pgs[9] = 0xa0000023
	   pgs[8] = 0xa0000025
	   pgs[4] = 0xa0000023
	   pgs[1] = 0xa0000021
	   pgs[2] = 0xa0000021
	   pgs[7] = 0xa0000021
	   pgs[3] = 0xa0000022
	   pgs[10] = "5"
	elseif pg == "谛听_普通"then---------
	   pgs[6] = 0xa0000029
	   pgs[9] = 0xa0000028
	   pgs[8] = 0xa0000030
	   pgs[4] = 0xa0000028
	   pgs[1] = 0xa0000026
	   pgs[2] = 0xa0000026
	   pgs[7] = 0xa0000026
	   pgs[3] = 0xa0000027
	   pgs[10] = "5"
	elseif pg == "进阶谛听_普通"then---------
	   pgs[6] = 0xa0000035
	   pgs[9] = 0xa0000034
	   pgs[8] = 0xa0000036
	   pgs[4] = 0xa0000034
	   pgs[1] = 0xa0000031
	   pgs[2] = 0xa0000031
	   pgs[7] = 0xa0000032
	   pgs[3] = 0xa0000033
	   pgs[10] = "5"
	   elseif pg == "月魅_普通"then
	   pgs[1] = 0xABC00181
	   pgs[2] = 0xABC00181
	   pgs[7] = 0xABC00181
	   pgs[3] = 0xABC00182
	   pgs[4] = 0xABC00183
	   pgs[9] = 0xABC00183
	   pgs[6] = 0xABC00184
	   pgs[8] = 0xABC00185
	   pgs[10] = "wpal/121.wpal"
	elseif pg == "月魅_饰品_普通"then
	   pgs[1] = 0xABC00186
	   pgs[2] = 0xABC00186
	   pgs[7] = 0xABCD0186 --0xABC00186
	   pgs[3] = 0xABC00187
	   pgs[4] = 0xABC00188
	   pgs[9] = 0xABC00188
	   pgs[6] = 0xABC00189
	   pgs[8] = 0xABC00190
	   pgs[10] = "wpal/121.wpal"
	elseif pg == "进阶月魅_普通"then
	   pgs[1] = 0xABC00191
	   pgs[2] = 0xABC00191
	   pgs[7] = 0xABC00191
	   pgs[3] = 0xABC00192
	   pgs[4] = 0xABC00193
	   pgs[9] = 0xABC00193
	   pgs[6] = 0xABC00194
	   pgs[8] = 0xABC00195
	   pgs[10] = "wpal/121.wpal"
	elseif pg == "进阶月魅_饰品_普通"then
	   pgs[1] = 0xABC00196
	   pgs[2] = 0xABC00196
	   pgs[7] = 0xABCD0196 --0xABC00196
	   pgs[3] = 0xABC00197
	   pgs[4] = 0xABC00198
	   pgs[9] = 0xABC00198
	   pgs[6] = 0xABC00199
	   pgs[8] = 0xABC00200
	   pgs[10] = "wpal/121.wpal"
	   elseif pg == "超级飞天_普通"then
	   pgs[1] = 0xABC00001
	   pgs[2] = 0xABC00001
	   pgs[7] = 0xABC00001
	   pgs[3] = 0xABC00002
	   pgs[4] = 0xABC00003
	   pgs[9] = 0xABC00003
	   pgs[6] = 0xABC00004
	   pgs[8] = 0xABC00005
	   pgs[10] = "wpal/121.wpal"
	elseif pg == "进阶超级飞天_普通"then
	   pgs[1] = 0xABC00006
	   pgs[2] = 0xABC00006
	   pgs[7] = 0xABC00006
	   pgs[3] = 0xABC00007
	   pgs[4] = 0xABC00008
	   pgs[9] = 0xABC00008
	   pgs[6] = 0xABC00009
	   pgs[8] = 0xABC00010
	   pgs[10] = "wpal/121.wpal"
	elseif pg == "超级飞天_普通"then
	   pgs[1] = 0xABC00001
	   pgs[2] = 0xABC00001
	   pgs[7] = 0xABC00001
	   pgs[3] = 0xABC00002
	   pgs[4] = 0xABC00003
	   pgs[9] = 0xABC00003
	   pgs[6] = 0xABC00004
	   pgs[8] = 0xABC00005
	   pgs[10] = "wpal/121.wpal"
	elseif pg == "进阶超级飞天_普通"then
	   pgs[1] = 0xABC00006
	   pgs[2] = 0xABC00006
	   pgs[7] = 0xABC00006
	   pgs[3] = 0xABC00007
	   pgs[4] = 0xABC00008
	   pgs[9] = 0xABC00008
	   pgs[6] = 0xABC00009
	   pgs[8] = 0xABC00010
	   pgs[10] = "wpal/121.wpal"


	elseif pg =="小飞羽_普通"then
	   pgs[1] = 0x00000231
	   pgs[2] = 0x00000231
	   pgs[3] = 0x00000312
	   pgs[4] = 0x00000234
	   pgs[6] = 0x00000236
	   pgs[7] = 0x00000237
	   pgs[8] = 0x00000238
	   pgs[9] = 0x00000239
	   pgs[10] = "幕神2.rpk"


elseif pg =="无常鬼差(白)小_普通"then
	   pgs[1] = 0x00000301
	   pgs[2] = 0x00000301
	   pgs[3] = 0x00000302
	   pgs[4] = 0x00000303
	   pgs[6] = 0x00000303
	   pgs[7] = 0x00000301
	   pgs[8] = 0x00000304
	   pgs[9] = 0x00000305
	   pgs[10] = "幕神2.rpk"
elseif pg =="进阶无常鬼差(白)小_普通"then
	   pgs[1] = 0x00000306
	   pgs[2] = 0x00000306
	   pgs[3] = 0x00000307
	   pgs[4] = 0x00000308
	   pgs[6] = 0x00000308
	   pgs[7] = 0x00000306
	   pgs[8] = 0x00000309
	   pgs[9] = 0x00000310
	   pgs[10] = "幕神2.rpk"
elseif pg =="小飞羽_普通"then
	   pgs[1] = 0x00000311
	   pgs[2] = 0x00000311
	   pgs[3] = 0x00000312
	   pgs[4] = 0x00000313
	   pgs[6] = 0x00000314
	   pgs[7] = 0x00000315
	   pgs[8] = 0x00000316
	   pgs[9] = 0x00000317
	   pgs[10] = "幕神2.rpk"


elseif pg =="白象王小_普通"then
	   pgs[1] = 0x00000341
	   pgs[2] = 0x00000342
	   pgs[3] = 0x00000343
	   pgs[4] = 0x00000344
	   pgs[6] = 0x00000346
	   pgs[7] = 0x00000347
	   pgs[8] = 0x00000348
	   pgs[9] = 0x00000349
	   pgs[10] = "幕神2.rpk"
elseif pg =="蚩尤王小_普通"then
	   pgs[1] = 0x00000351
	   pgs[2] = 0x00000352
	   pgs[3] = 0x00000353
	   pgs[4] = 0x00000354
	   pgs[6] = 0x00000356
	   pgs[7] = 0x00000357
	   pgs[8] = 0x00000358
	   pgs[9] = 0x00000359
	   pgs[10] = "幕神2.rpk"
elseif pg =="大棚王小_普通"then
	   pgs[1] = 0x00000361
	   pgs[2] = 0x00000362
	   pgs[3] = 0x00000363
	   pgs[4] = 0x00000364
	   pgs[6] = 0x00000366
	   pgs[7] = 0x00000367
	   pgs[8] = 0x00000368
	   pgs[9] = 0x00000369
	   pgs[10] = "幕神2.rpk"
elseif pg =="大妖皇小_普通"then
	   pgs[1] = 0x00000371
	   pgs[2] = 0x00000372
	   pgs[3] = 0x00000373
	   pgs[4] = 0x00000374
	   pgs[6] = 0x00000376
	   pgs[7] = 0x00000377
	   pgs[8] = 0x00000378
	   pgs[9] = 0x00000379
	   pgs[10] = "幕神2.rpk"
elseif pg =="二郎真君小_普通"then
	   pgs[1] = 0x00000381
	   pgs[2] = 0x00000382
	   pgs[3] = 0x00000383
	   pgs[4] = 0x00000384
	   pgs[6] = 0x00000386
	   pgs[7] = 0x00000387
	   pgs[8] = 0x00000388
	   pgs[9] = 0x00000389
	   pgs[10] = "幕神2.rpk"
elseif pg =="伏羲小_普通"then
	   pgs[1] = 0x00000391
	   pgs[2] = 0x00000392
	   pgs[3] = 0x00000393
	   pgs[4] = 0x00000394
	   pgs[6] = 0x00000396
	   pgs[7] = 0x00000397
	   pgs[8] = 0x00000398
	   pgs[9] = 0x00000399
	   pgs[10] = "幕神2.rpk"
elseif pg =="郭靖小_普通"then
	   pgs[1] = 0x00000401
	   pgs[2] = 0x00000402
	   pgs[3] = 0x00000403
	   pgs[4] = 0x00000404
	   pgs[6] = 0x00000406
	   pgs[7] = 0x00000407
	   pgs[8] = 0x00000408
	   pgs[9] = 0x00000409
	   pgs[10] = "幕神2.rpk"
elseif pg =="盘古小_普通"then
	   pgs[1] = 0x00000411
	   pgs[2] = 0x00000412
	   pgs[3] = 0x00000413
	   pgs[4] = 0x00000414
	   pgs[6] = 0x00000416
	   pgs[7] = 0x00000417
	   pgs[8] = 0x00000418
	   pgs[9] = 0x00000419
	   pgs[10] = "幕神2.rpk"
elseif pg =="齐天大圣小_普通"then
	   pgs[1] = 0x00000421
	   pgs[2] = 0x00000422
	   pgs[3] = 0x00000423
	   pgs[4] = 0x00000424
	   pgs[6] = 0x00000426
	   pgs[7] = 0x00000427
	   pgs[8] = 0x00000428
	   pgs[9] = 0x00000429
	   pgs[10] = "幕神2.rpk"
elseif pg =="轩辕小_普通"then
	   pgs[1] = 0x00000431
	   pgs[2] = 0x00000432
	   pgs[3] = 0x00000433
	   pgs[4] = 0x00000434
	   pgs[6] = 0x00000436
	   pgs[7] = 0x00000437
	   pgs[8] = 0x00000438
	   pgs[9] = 0x00000439
	   pgs[10] = "幕神2.rpk"
	   elseif pg =="鲲鹏_普通"then
	   pgs[1] = 0x00000499
	   pgs[2] = 0x00000500
	   pgs[3] = 0x00000501
	   pgs[4] = 0x00000502
	   pgs[6] = 0x00000503
	   pgs[7] = 0x00000504
	   pgs[8] = 0x00000505
	   pgs[9] = 0x00000506
	    pgs[10] = "幕神2.rpk"
	   elseif pg =="进阶鲲鹏_普通"then
	   pgs[1] = 0x00000499
	   pgs[2] = 0x00000500
	   pgs[3] = 0x00000501
	   pgs[4] = 0x00000502
	   pgs[6] = 0x00000503
	   pgs[7] = 0x00000504
	   pgs[8] = 0x00000505
	   pgs[9] = 0x00000506
	    pgs[10] = "幕神2.rpk"
elseif pg =="元始天尊小_普通"then
	   pgs[1] = 0x00000441
	   pgs[2] = 0x00000442
	   pgs[3] = 0x00000443
	   pgs[4] = 0x00000444
	   pgs[6] = 0x00000446
	   pgs[7] = 0x00000447
	   pgs[8] = 0x00000448
	   pgs[9] = 0x00000449
	   pgs[10] = "幕神2.rpk"
elseif pg =="祝融小_普通"then
	   pgs[1] = 0x00000451
	   pgs[2] = 0x00000452
	   pgs[3] = 0x00000453
	   pgs[4] = 0x00000454
	   pgs[6] = 0x00000456
	   pgs[7] = 0x00000457
	   pgs[8] = 0x00000458
	   pgs[9] = 0x00000459
	   pgs[10] = "幕神2.rpk"

elseif pg =="进阶小飞羽_普通"then
	   pgs[1] = 0x00000231
	   pgs[2] = 0x00000231
	   pgs[3] = 0x00000312
	   pgs[4] = 0x00000234
	   pgs[6] = 0x00000236
	   pgs[7] = 0x00000237
	   pgs[8] = 0x00000238
	   pgs[9] = 0x00000239
	   pgs[10] = "幕神2.rpk"


elseif pg =="进阶无常鬼差(白)小_普通"then
	   pgs[1] = 0x00000301
	   pgs[2] = 0x00000301
	   pgs[3] = 0x00000302
	   pgs[4] = 0x00000303
	   pgs[6] = 0x00000303
	   pgs[7] = 0x00000301
	   pgs[8] = 0x00000304
	   pgs[9] = 0x00000305
	   pgs[10] = "幕神2.rpk"
elseif pg =="进阶进阶无常鬼差(白)小_普通"then
	   pgs[1] = 0x00000306
	   pgs[2] = 0x00000306
	   pgs[3] = 0x00000307
	   pgs[4] = 0x00000308
	   pgs[6] = 0x00000308
	   pgs[7] = 0x00000306
	   pgs[8] = 0x00000309
	   pgs[9] = 0x00000310
	   pgs[10] = "幕神2.rpk"
elseif pg =="进阶小飞羽_普通"then
	   pgs[1] = 0x00000311
	   pgs[2] = 0x00000311
	   pgs[3] = 0x00000312
	   pgs[4] = 0x00000313
	   pgs[6] = 0x00000314
	   pgs[7] = 0x00000315
	   pgs[8] = 0x00000316
	   pgs[9] = 0x00000317
	   pgs[10] = "幕神2.rpk"


elseif pg =="进阶白象王小_普通"then
	   pgs[1] = 0x00000341
	   pgs[2] = 0x00000342
	   pgs[3] = 0x00000343
	   pgs[4] = 0x00000344
	   pgs[6] = 0x00000346
	   pgs[7] = 0x00000347
	   pgs[8] = 0x00000348
	   pgs[9] = 0x00000349
	   pgs[10] = "幕神2.rpk"
elseif pg =="进阶蚩尤王小_普通"then
	   pgs[1] = 0x00000351
	   pgs[2] = 0x00000352
	   pgs[3] = 0x00000353
	   pgs[4] = 0x00000354
	   pgs[6] = 0x00000356
	   pgs[7] = 0x00000357
	   pgs[8] = 0x00000358
	   pgs[9] = 0x00000359
	   pgs[10] = "幕神2.rpk"
elseif pg =="进阶大棚王小_普通"then
	   pgs[1] = 0x00000361
	   pgs[2] = 0x00000362
	   pgs[3] = 0x00000363
	   pgs[4] = 0x00000364
	   pgs[6] = 0x00000366
	   pgs[7] = 0x00000367
	   pgs[8] = 0x00000368
	   pgs[9] = 0x00000369
	   pgs[10] = "幕神2.rpk"
elseif pg =="进阶大妖皇小_普通"then
	   pgs[1] = 0x00000371
	   pgs[2] = 0x00000372
	   pgs[3] = 0x00000373
	   pgs[4] = 0x00000374
	   pgs[6] = 0x00000376
	   pgs[7] = 0x00000377
	   pgs[8] = 0x00000378
	   pgs[9] = 0x00000379
	   pgs[10] = "幕神2.rpk"
elseif pg =="进阶二郎真君小_普通"then
	   pgs[1] = 0x00000381
	   pgs[2] = 0x00000382
	   pgs[3] = 0x00000383
	   pgs[4] = 0x00000384
	   pgs[6] = 0x00000386
	   pgs[7] = 0x00000387
	   pgs[8] = 0x00000388
	   pgs[9] = 0x00000389
	   pgs[10] = "幕神2.rpk"
elseif pg =="进阶伏羲小_普通"then
	   pgs[1] = 0x00000391
	   pgs[2] = 0x00000392
	   pgs[3] = 0x00000393
	   pgs[4] = 0x00000394
	   pgs[6] = 0x00000396
	   pgs[7] = 0x00000397
	   pgs[8] = 0x00000398
	   pgs[9] = 0x00000399
	   pgs[10] = "幕神2.rpk"
elseif pg =="进阶郭靖小_普通"then
	   pgs[1] = 0x00000401
	   pgs[2] = 0x00000402
	   pgs[3] = 0x00000403
	   pgs[4] = 0x00000404
	   pgs[6] = 0x00000406
	   pgs[7] = 0x00000407
	   pgs[8] = 0x00000408
	   pgs[9] = 0x00000409
	   pgs[10] = "幕神2.rpk"
elseif pg =="进阶盘古小_普通"then
	   pgs[1] = 0x00000411
	   pgs[2] = 0x00000412
	   pgs[3] = 0x00000413
	   pgs[4] = 0x00000414
	   pgs[6] = 0x00000416
	   pgs[7] = 0x00000417
	   pgs[8] = 0x00000418
	   pgs[9] = 0x00000419
	   pgs[10] = "幕神2.rpk"
elseif pg =="进阶齐天大圣小_普通"then
	   pgs[1] = 0x00000421
	   pgs[2] = 0x00000422
	   pgs[3] = 0x00000423
	   pgs[4] = 0x00000424
	   pgs[6] = 0x00000426
	   pgs[7] = 0x00000427
	   pgs[8] = 0x00000428
	   pgs[9] = 0x00000429
	   pgs[10] = "幕神2.rpk"
elseif pg =="进阶轩辕小_普通"then
	   pgs[1] = 0x00000431
	   pgs[2] = 0x00000432
	   pgs[3] = 0x00000433
	   pgs[4] = 0x00000434
	   pgs[6] = 0x00000436
	   pgs[7] = 0x00000437
	   pgs[8] = 0x00000438
	   pgs[9] = 0x00000439
	   pgs[10] = "幕神2.rpk"
elseif pg =="进阶元始天尊小_普通"then
	   pgs[1] = 0x00000441
	   pgs[2] = 0x00000442
	   pgs[3] = 0x00000443
	   pgs[4] = 0x00000444
	   pgs[6] = 0x00000446
	   pgs[7] = 0x00000447
	   pgs[8] = 0x00000448
	   pgs[9] = 0x00000449
	   pgs[10] = "幕神2.rpk"
elseif pg =="进阶祝融小_普通"then
	   pgs[1] = 0x00000451
	   pgs[2] = 0x00000452
	   pgs[3] = 0x00000453
	   pgs[4] = 0x00000454
	   pgs[6] = 0x00000456
	   pgs[7] = 0x00000457
	   pgs[8] = 0x00000458
	   pgs[9] = 0x00000459
	   pgs[10] = "幕神2.rpk"










           elseif pg == "金枪二郎神_普通"then
		   pgs[6] = 0x00000025
		   pgs[9] = 0x00000023--被攻击
		   pgs[8] = 0x00000024--奔跑
		   pgs[5] = 0x00000024--奔跑
		   pgs[4] = 0x00000023--防御
		   pgs[1] = 0x00000021--攻击
		   pgs[2] = 0x00000021--攻击
		   pgs[7] = 0x00000021--施法
		   pgs[3] = 0x00000022--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "太白星君_普通"then
		   pgs[6] = 0x00000035
		   pgs[9] = 0x00000033--被攻击
		   pgs[8] = 0x00000034--奔跑
		   pgs[5] = 0x00000034--奔跑
		   pgs[4] = 0x00000033--防御
		   pgs[1] = 0x00000031--攻击
		   pgs[2] = 0x00000031--攻击
		   pgs[7] = 0x00000031--施法
		   pgs[3] = 0x00000032--死亡倒地
           pgs[10] = "幕神.rpk"

           elseif pg == "轩辕黄帝_普通"then
		   pgs[6] = 0x00000084
		   pgs[9] = 0x00000082--被攻击
		   pgs[8] = 0x00000083--奔跑
		   pgs[5] = 0x00000083--奔跑
		   pgs[4] = 0x00000082--防御
		   pgs[1] = 0x00000080--攻击
		   pgs[2] = 0x00000080--攻击
		   pgs[7] = 0x00000080--施法
		   pgs[3] = 0x00000081--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶轩辕黄帝_普通"then
		   pgs[6] = 0x00000084
		   pgs[9] = 0x00000082--被攻击
		   pgs[8] = 0x00000083--奔跑
		   pgs[5] = 0x00000083--奔跑
		   pgs[4] = 0x00000082--防御
		   pgs[1] = 0x00000080--攻击
		   pgs[2] = 0x00000080--攻击
		   pgs[7] = 0x00000080--施法
		   pgs[3] = 0x00000081--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "钟馗_普通"then
		   pgs[6] = 0x00000095
		   pgs[9] = 0x00000093--被攻击
		   pgs[8] = 0x00000094--奔跑
		   pgs[5] = 0x00000094--奔跑
		   pgs[4] = 0x00000093--防御
		   pgs[1] = 0x00000090--攻击
		   pgs[2] = 0x00000090--攻击
		   pgs[7] = 0x00000090--施法
		   pgs[3] = 0x00000091--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "辛丑神牛_普通"then
		   pgs[6] = 0xF6001255
		   pgs[9] = 0xF6001249--被攻击
		   pgs[8] = 0xF6001253--奔跑
		   pgs[5] = 0xF6001253--奔跑
		   pgs[4] = 0xF6001249--防御
		   pgs[1] = 0xF6001252--攻击
		   pgs[2] = 0xF6001252--攻击
		   pgs[7] = 0xF6001252--施法
		   pgs[3] = 0xF6001250--死亡倒地
           pgs[10] = "幕神2.rpk"
           elseif pg == "进阶辛丑神牛_普通"then
		   pgs[6] = 0xF6001255
		   pgs[9] = 0xF6001249--被攻击
		   pgs[8] = 0xF6001253--奔跑
		   pgs[5] = 0xF6001253--奔跑
		   pgs[4] = 0xF6001249--防御
		   pgs[1] = 0xF6001252--攻击
		   pgs[2] = 0xF6001252--攻击
		   pgs[7] = 0xF6001252--施法
		   pgs[3] = 0xF6001250--死亡倒地
           pgs[10] = "幕神2.rpk"
           elseif pg == "持法天神_普通"then
		   pgs[6] = 0xF6001265
		   pgs[9] = 0xF6001259--被攻击
		   pgs[8] = 0xF6001263--奔跑
		   pgs[5] = 0xF6001263--奔跑
		   pgs[4] = 0xF6001259--防御
		   pgs[1] = 0xF6001261--攻击
		   pgs[2] = 0xF6001261--攻击
		   pgs[7] = 0xF6001264--施法
		   pgs[3] = 0xF6001257--死亡倒地
           pgs[10] = "幕神2.rpk"
           elseif pg == "进阶持法天神_普通"then
		   pgs[6] = 0xF6001265
		   pgs[9] = 0xF6001259--被攻击
		   pgs[8] = 0xF6001263--奔跑
		   pgs[5] = 0xF6001263--奔跑
		   pgs[4] = 0xF6001259--防御
		   pgs[1] = 0xF6001261--攻击
		   pgs[2] = 0xF6001261--攻击
		   pgs[7] = 0xF6001264--施法
		   pgs[3] = 0xF6001257--死亡倒地
           pgs[10] = "幕神2.rpk"
           elseif pg == "妙华仙子_普通"then
		   pgs[6] = 0xF6001271
		   pgs[9] = 0xF6001267--被攻击
		   pgs[8] = 0xF6001269--奔跑
		   pgs[5] = 0xF6001269--奔跑
		   pgs[4] = 0xF6001267--防御
		   pgs[1] = 0xF6001268--攻击
		   pgs[2] = 0xF6001268--攻击
		   pgs[7] = 0xF6001268--施法
		   pgs[3] = 0xF6001270--死亡倒地
           pgs[10] = "幕神2.rpk"
           elseif pg == "进阶妙华仙子_普通"then
		   pgs[6] = 0xF6001271
		   pgs[9] = 0xF6001267--被攻击
		   pgs[8] = 0xF6001269--奔跑
		   pgs[5] = 0xF6001269--奔跑
		   pgs[4] = 0xF6001267--防御
		   pgs[1] = 0xF6001268--攻击
		   pgs[2] = 0xF6001268--攻击
		   pgs[7] = 0xF6001268--施法
		   pgs[3] = 0xF6001270--死亡倒地
           pgs[10] = "幕神2.rpk"
           elseif pg == "月灵_普通"then
		   pgs[6] = 0xF6001278
		   pgs[9] = 0xF6001272--被攻击
		   pgs[8] = 0xF6001275--奔跑
		   pgs[5] = 0xF6001275--奔跑
		   pgs[4] = 0xF6001272--防御
		   pgs[1] = 0xF6001274--攻击
		   pgs[2] = 0xF6001274--攻击
		   pgs[7] = 0xF6001274--施法
		   pgs[3] = 0xF6001276--死亡倒地
           pgs[10] = "幕神2.rpk"
           elseif pg == "进阶月灵_普通"then
		   pgs[6] = 0xF6001278
		   pgs[9] = 0xF6001272--被攻击
		   pgs[8] = 0xF6001275--奔跑
		   pgs[5] = 0xF6001275--奔跑
		   pgs[4] = 0xF6001272--防御
		   pgs[1] = 0xF6001274--攻击
		   pgs[2] = 0xF6001274--攻击
		   pgs[7] = 0xF6001274--施法
		   pgs[3] = 0xF6001276--死亡倒地
           pgs[10] = "幕神2.rpk"
           elseif pg == "蚩尤战神_普通"then
		   pgs[6] = 0x00000005
		   pgs[9] = 0x00000003--被攻击
		   pgs[8] = 0x00000004--奔跑
		   pgs[5] = 0x00000004--奔跑
		   pgs[4] = 0x00000003--防御
		   pgs[1] = 0x00000001--攻击
		   pgs[2] = 0x00000001--攻击
		   pgs[7] = 0x00000001--施法
		   pgs[3] = 0x00000002--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶蚩尤战神_普通"then
		   pgs[6] = 0x00000005
		   pgs[9] = 0x00000003--被攻击
		   pgs[8] = 0x00000004--奔跑
		   pgs[5] = 0x00000004--奔跑
		   pgs[4] = 0x00000003--防御
		   pgs[1] = 0x00000001--攻击
		   pgs[2] = 0x00000001--攻击
		   pgs[7] = 0x00000001--施法
		   pgs[3] = 0x00000002--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "托塔天王_普通"then
		   pgs[6] = 0x00000010
		   pgs[9] = 0x00000008--被攻击
		   pgs[8] = 0x00000009--奔跑
		   pgs[5] = 0x00000009--奔跑
		   pgs[4] = 0x00000008--防御
		   pgs[1] = 0x00000006--攻击
		   pgs[2] = 0x00000006--攻击
		   pgs[7] = 0x00000006--施法
		   pgs[3] = 0x00000007--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶托塔天王_普通"then
		   pgs[6] = 0x00000010
		   pgs[9] = 0x00000008--被攻击
		   pgs[8] = 0x00000009--奔跑
		   pgs[5] = 0x00000009--奔跑
		   pgs[4] = 0x00000008--防御
		   pgs[1] = 0x00000006--攻击
		   pgs[2] = 0x00000006--攻击
		   pgs[7] = 0x00000006--施法
		   pgs[3] = 0x00000007--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "嫦娥仙子_普通"then
		   pgs[6] = 0x00000014
		   pgs[9] = 0x00000013--被攻击
		   pgs[8] = 0x00000015--奔跑
		   pgs[5] = 0x00000015--奔跑
		   pgs[4] = 0x00000013--防御
		   pgs[1] = 0x00000011--攻击
		   pgs[2] = 0x00000011--攻击
		   pgs[7] = 0x00000011--施法
		   pgs[3] = 0x00000012--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "刑天_普通"then
		   pgs[6] = 0x00000020
		   pgs[9] = 0x00000018--被攻击
		   pgs[8] = 0x00000019--奔跑
		   pgs[5] = 0x00000019--奔跑
		   pgs[4] = 0x00000018--防御
		   pgs[1] = 0x00000016--攻击
		   pgs[2] = 0x00000016--攻击
		   pgs[7] = 0x00000016--施法
		   pgs[3] = 0x00000017--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶刑天_普通"then
		   pgs[6] = 0x00000020
		   pgs[9] = 0x00000018--被攻击
		   pgs[8] = 0x00000019--奔跑
		   pgs[5] = 0x00000019--奔跑
		   pgs[4] = 0x00000018--防御
		   pgs[1] = 0x00000016--攻击
		   pgs[2] = 0x00000016--攻击
		   pgs[7] = 0x00000016--施法
		   pgs[3] = 0x00000017--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "飞羽_普通"then
		   pgs[6] = 0x00000106
		   pgs[9] = 0x00000109--被攻击
		   pgs[8] = 0x00000108--奔跑
		   pgs[5] = 0x00000108--奔跑
		   pgs[4] = 0x00000104--防御
		   pgs[1] = 0x00000107--攻击
		   pgs[2] = 0x00000107--攻击
		   pgs[7] = 0x00000101--施法
		   pgs[3] = 0x00000312--死亡倒地
           pgs[10] = "幕神2.rpk"
           elseif pg == "进阶飞羽_普通"then
		   pgs[6] = 0x00000106
		   pgs[9] = 0x00000109--被攻击
		   pgs[8] = 0x00000108--奔跑
		   pgs[5] = 0x00000108--奔跑
		   pgs[4] = 0x00000104--防御
		   pgs[1] = 0x00000107--攻击
		   pgs[2] = 0x00000107--攻击
		   pgs[7] = 0x00000101--施法
		   pgs[3] = 0x00000312--死亡倒地
           pgs[10] = "幕神2.rpk"
           elseif pg == "明世隐_普通"then
		   pgs[6] = 0x00000246
		   pgs[9] = 0x00000249--被攻击
		   pgs[8] = 0x00000248--奔跑
		   pgs[5] = 0x00000248--奔跑
		   pgs[4] = 0x00000244--防御
		   pgs[1] = 0x00000241--攻击
		   pgs[2] = 0x00000241--攻击
		   pgs[7] = 0x00000247--施法
		   pgs[3] = 0x00000246--死亡倒地
           pgs[10] = "幕神2.rpk"
           elseif pg == "进阶明世隐_普通"then
		   pgs[6] = 0x00000246
		   pgs[9] = 0x00000249--被攻击
		   pgs[8] = 0x00000248--奔跑
		   pgs[5] = 0x00000248--奔跑
		   pgs[4] = 0x00000244--防御
		   pgs[1] = 0x00000241--攻击
		   pgs[2] = 0x00000241--攻击
		   pgs[7] = 0x00000247--施法
		   pgs[3] = 0x00000246--死亡倒地
           pgs[10] = "幕神2.rpk"
           elseif pg == "奶牛_普通"then
		   pgs[6] = 0x00000176
		   pgs[9] = 0x00000174--被攻击
		   pgs[8] = 0x00000178--奔跑
		   pgs[5] = 0x00000178--奔跑
		   pgs[4] = 0x00000174--防御
		   pgs[1] = 0x00000177--攻击
		   pgs[2] = 0x00000177--攻击
		   pgs[7] = 0x00000177--施法
		   pgs[3] = 0x00000179--死亡倒地
           pgs[10] = "幕神2.rpk"
           elseif pg == "进阶奶牛_普通"then
		   pgs[6] = 0x00000176
		   pgs[9] = 0x00000174--被攻击
		   pgs[8] = 0x00000178--奔跑
		   pgs[5] = 0x00000178--奔跑
		   pgs[4] = 0x00000174--防御
		   pgs[1] = 0x00000177--攻击
		   pgs[2] = 0x00000177--攻击
		   pgs[7] = 0x00000177--施法
		   pgs[3] = 0x00000179--死亡倒地
           pgs[10] = "幕神2.rpk"
           elseif pg == "火神祝融_普通"then
		   pgs[6] = 0x00000030
		   pgs[9] = 0x00000028--被攻击
		   pgs[8] = 0x00000029--奔跑
		   pgs[5] = 0x00000029--奔跑
		   pgs[4] = 0x00000028--防御
		   pgs[1] = 0x00000026--攻击
		   pgs[2] = 0x00000026--攻击
		   pgs[7] = 0x00000026--施法
		   pgs[3] = 0x00000027--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "水神共工_普通"then
		   pgs[6] = 0x00000040
		   pgs[9] = 0x00000038--被攻击
		   pgs[8] = 0x00000039--奔跑
		   pgs[5] = 0x00000039--奔跑
		   pgs[4] = 0x00000038--防御
		   pgs[1] = 0x00000036--攻击
		   pgs[2] = 0x00000036--攻击
		   pgs[7] = 0x00000036--施法
		   pgs[3] = 0x00000037--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "北极仙翁_普通"then
		   pgs[6] = 0x00000045
		   pgs[9] = 0x00000043--被攻击
		   pgs[8] = 0x00000044--奔跑
		   pgs[5] = 0x00000044--奔跑
		   pgs[4] = 0x00000043--防御
		   pgs[1] = 0x00000041--攻击
		   pgs[2] = 0x00000041--攻击
		   pgs[7] = 0x00000041--施法
		   pgs[3] = 0x00000042--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "土神后土_普通"then
		   pgs[6] = 0x00000050
		   pgs[9] = 0x00000048--被攻击
		   pgs[8] = 0x00000049--奔跑
		   pgs[5] = 0x00000049--奔跑
		   pgs[4] = 0x00000048--防御
		   pgs[1] = 0x00000046--攻击
		   pgs[2] = 0x00000046--攻击
		   pgs[7] = 0x00000046--施法
		   pgs[3] = 0x00000047--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "盘古_普通"then
		   pgs[6] = 0x00000055
		   pgs[9] = 0x00000053--被攻击
		   pgs[8] = 0x00000054--奔跑
		   pgs[5] = 0x00000054--奔跑
		   pgs[4] = 0x00000053--防御
		   pgs[1] = 0x00000051--攻击
		   pgs[2] = 0x00000051--攻击
		   pgs[7] = 0x00000051--施法
		   pgs[3] = 0x00000052--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶盘古_普通"then
		   pgs[6] = 0x00000055
		   pgs[9] = 0x00000053--被攻击
		   pgs[8] = 0x00000054--奔跑
		   pgs[5] = 0x00000054--奔跑
		   pgs[4] = 0x00000053--防御
		   pgs[1] = 0x00000051--攻击
		   pgs[2] = 0x00000051--攻击
		   pgs[7] = 0x00000051--施法
		   pgs[3] = 0x00000052--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "上古瑞兽_普通"then
		   pgs[6] = 0x00000060
		   pgs[9] = 0x00000058--被攻击
		   pgs[8] = 0x00000059--奔跑
		   pgs[5] = 0x00000059--奔跑
		   pgs[4] = 0x00000058--防御
		   pgs[1] = 0x00000056--攻击
		   pgs[2] = 0x00000056--攻击
		   pgs[7] = 0x00000056--施法
		   pgs[3] = 0x00000057--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "齐天大圣_普通"then
		   pgs[6] = 0x00000065
		   pgs[9] = 0x00000063--被攻击
		   pgs[8] = 0x00000064--奔跑
		   pgs[5] = 0x00000064--奔跑
		   pgs[4] = 0x00000063--防御
		   pgs[1] = 0x00000061--攻击
		   pgs[2] = 0x00000061--攻击
		   pgs[7] = 0x00000061--施法
		   pgs[3] = 0x00000062--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "太上老君_普通"then
		   pgs[6] = 0x00000070
		   pgs[9] = 0x00000068--被攻击
		   pgs[8] = 0x00000069--奔跑
		   pgs[5] = 0x00000069--奔跑
		   pgs[4] = 0x00000068--防御
		   pgs[1] = 0x00000066--攻击
		   pgs[2] = 0x00000066--攻击
		   pgs[7] = 0x00000066--施法
		   pgs[3] = 0x00000067--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "太已真人_普通"then
		   pgs[6] = 0x00000075
		   pgs[9] = 0x00000072--被攻击
		   pgs[8] = 0x00000074--奔跑
		   pgs[5] = 0x00000074--奔跑
		   pgs[4] = 0x00000072--防御
		   pgs[1] = 0x00000071--攻击
		   pgs[2] = 0x00000071--攻击
		   pgs[7] = 0x00000071--施法
		   pgs[3] = 0x00000072--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "上古天兵_普通"then
		   pgs[6] = 0x00000079
		   pgs[9] = 0x00000077--被攻击
		   pgs[8] = 0x00000078--奔跑
		   pgs[5] = 0x00000078--奔跑
		   pgs[4] = 0x00000077--防御
		   pgs[1] = 0x00000076--攻击
		   pgs[2] = 0x00000076--攻击
		   pgs[7] = 0x00000076--施法
		   pgs[3] = 0x00000077--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "判官_普通"then
		   pgs[6] = 0x00000089
		   pgs[9] = 0x00000087--被攻击
		   pgs[8] = 0x00000088--奔跑
		   pgs[5] = 0x00000088--奔跑
		   pgs[4] = 0x00000087--防御
		   pgs[1] = 0x00000085--攻击
		   pgs[2] = 0x00000085--攻击
		   pgs[7] = 0x00000085--施法
		   pgs[3] = 0x00000086--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "白象精_普通"then
		   pgs[6] = 0x00001004
		   pgs[9] = 0x00001002--被攻击
		   pgs[8] = 0x00001003--奔跑
		   pgs[5] = 0x00001003--奔跑
		   pgs[4] = 0x00001002--防御
		   pgs[1] = 0x00001000--攻击
		   pgs[2] = 0x00001000--攻击
		   pgs[7] = 0x00001000--施法
		   pgs[3] = 0x00001001--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "上古精灵_普通"then
		   pgs[6] = 0x00001009
		   pgs[9] = 0x00001006--被攻击
		   pgs[8] = 0x00001008--奔跑
		   pgs[5] = 0x00001008--奔跑
		   pgs[4] = 0x00001006--防御
		   pgs[1] = 0x00001005--攻击
		   pgs[2] = 0x00001005--攻击
		   pgs[7] = 0x00001005--施法
		   pgs[3] = 0x00001006--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "红孩儿_普通"then
		   pgs[6] = 0x00001014
		   pgs[9] = 0x00001011--被攻击
		   pgs[8] = 0x00001013--奔跑
		   pgs[5] = 0x00001013--奔跑
		   pgs[4] = 0x00001011--防御
		   pgs[1] = 0x00001010--攻击
		   pgs[2] = 0x00001010--攻击
		   pgs[7] = 0x00001010--施法
		   pgs[3] = 0x00001011--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "上古蛟龙_普通"then
		   pgs[6] = 0x00001019
		   pgs[9] = 0x00001017--被攻击
		   pgs[8] = 0x00001018--奔跑
		   pgs[5] = 0x00001018--奔跑
		   pgs[4] = 0x00001017--防御
		   pgs[1] = 0x00001015--攻击
		   pgs[2] = 0x00001015--攻击
		   pgs[7] = 0x00001015--施法
		   pgs[3] = 0x00001017--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "大鹏王_普通"then
		   pgs[6] = 0x00001024
		   pgs[9] = 0x00001022--被攻击
		   pgs[8] = 0x00001023--奔跑
		   pgs[5] = 0x00001023--奔跑
		   pgs[4] = 0x00001022--防御
		   pgs[1] = 0x00001020--攻击
		   pgs[2] = 0x00001020--攻击
		   pgs[7] = 0x00001020--施法
		   pgs[3] = 0x00001021--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "达摩_普通"then
		   pgs[6] = 0x00001029
		   pgs[9] = 0x00001027--被攻击
		   pgs[8] = 0x00001028--奔跑
		   pgs[5] = 0x00001028--奔跑
		   pgs[4] = 0x00001027--防御
		   pgs[1] = 0x00001025--攻击
		   pgs[2] = 0x00001025--攻击
		   pgs[7] = 0x00001025--施法
		   pgs[3] = 0x00001026--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "雨神龙王_普通"then
		   pgs[6] = 0x00001034
		   pgs[9] = 0x00001032--被攻击
		   pgs[8] = 0x00001033--奔跑
		   pgs[5] = 0x00001033--奔跑
		   pgs[4] = 0x00001032--防御
		   pgs[1] = 0x00001030--攻击
		   pgs[2] = 0x00001030--攻击
		   pgs[7] = 0x00001030--施法
		   pgs[3] = 0x00001031--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "菩缇老祖_普通"then
		   pgs[6] = 0x00001039
		   pgs[9] = 0x00001036--被攻击
		   pgs[8] = 0x00001038--奔跑
		   pgs[5] = 0x00001038--奔跑
		   pgs[4] = 0x00001036--防御
		   pgs[1] = 0x00001035--攻击
		   pgs[2] = 0x00001035--攻击
		   pgs[7] = 0x00001035--施法
		   pgs[3] = 0x00001036--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "青牛精_普通"then
		   pgs[6] = 0x00001045
		   pgs[9] = 0x00001041--被攻击
		   pgs[8] = 0x00001043--奔跑
		   pgs[5] = 0x00001043--奔跑
		   pgs[4] = 0x00001041--防御
		   pgs[1] = 0x00001040--攻击
		   pgs[2] = 0x00001040--攻击
		   pgs[7] = 0x00001040--施法
		   pgs[3] = 0x00001041--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "青毛狮王_普通"then
		   pgs[6] = 0x00001050
		   pgs[9] = 0x00001048--被攻击
		   pgs[8] = 0x00001049--奔跑
		   pgs[5] = 0x00001049--奔跑
		   pgs[4] = 0x00001048--防御
		   pgs[1] = 0x00001046--攻击
		   pgs[2] = 0x00001046--攻击
		   pgs[7] = 0x00001046--施法
		   pgs[3] = 0x00001047--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "六耳猕猴_普通"then
		   pgs[6] = 0x00001055
		   pgs[9] = 0x00001053--被攻击
		   pgs[8] = 0x00001054--奔跑
		   pgs[5] = 0x00001054--奔跑
		   pgs[4] = 0x00001053--防御
		   pgs[1] = 0x00001051--攻击
		   pgs[2] = 0x00001051--攻击
		   pgs[7] = 0x00001051--施法
		   pgs[3] = 0x00001052--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "如来佛祖_普通"then
		   pgs[6] = 0x00001060
		   pgs[9] = 0x00001058--被攻击
		   pgs[8] = 0x00001059--奔跑
		   pgs[5] = 0x00001059--奔跑
		   pgs[4] = 0x00001058--防御
		   pgs[1] = 0x00001056--攻击
		   pgs[2] = 0x00001056--攻击
		   pgs[7] = 0x00001056--施法
		   pgs[3] = 0x00001057--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "陆压道人_普通"then
		   pgs[6] = 0x00001065
		   pgs[9] = 0x00001063--被攻击
		   pgs[8] = 0x00001064--奔跑
		   pgs[5] = 0x00001064--奔跑
		   pgs[4] = 0x00001063--防御
		   pgs[1] = 0x00001061--攻击
		   pgs[2] = 0x00001061--攻击
		   pgs[7] = 0x00001061--施法
		   pgs[3] = 0x00001062--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "瑭僧_普通"then
		   pgs[6] = 0x00001070
		   pgs[9] = 0x00001068--被攻击
		   pgs[8] = 0x00001069--奔跑
		   pgs[5] = 0x00001069--奔跑
		   pgs[4] = 0x00001068--防御
		   pgs[1] = 0x00001066--攻击
		   pgs[2] = 0x00001066--攻击
		   pgs[7] = 0x00001066--施法
		   pgs[3] = 0x00001068--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "王母娘娘_普通"then
		   pgs[6] = 0x00001075
		   pgs[9] = 0x00001072--被攻击
		   pgs[8] = 0x00001074--奔跑
		   pgs[5] = 0x00001074--奔跑
		   pgs[4] = 0x00001072--防御
		   pgs[1] = 0x00001071--攻击
		   pgs[2] = 0x00001071--攻击
		   pgs[7] = 0x00001071--施法
		   pgs[3] = 0x00001072--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "小白龙_普通"then
		   pgs[6] = 0x00001080
		   pgs[9] = 0x00001078--被攻击
		   pgs[8] = 0x00001079--奔跑
		   pgs[5] = 0x00001079--奔跑
		   pgs[4] = 0x00001078--防御
		   pgs[1] = 0x00001076--攻击
		   pgs[2] = 0x00001076--攻击
		   pgs[7] = 0x00001076--施法
		   pgs[3] = 0x00001077--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "白龙女_普通"then
		   pgs[6] = 0x00001085
		   pgs[9] = 0x00001082--被攻击
		   pgs[8] = 0x00001084--奔跑
		   pgs[5] = 0x00001084--奔跑
		   pgs[4] = 0x00001082--防御
		   pgs[1] = 0x00001081--攻击
		   pgs[2] = 0x00001081--攻击
		   pgs[7] = 0x00001081--施法
		   pgs[3] = 0x00001082--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "青蛟龙_普通"then
		   pgs[6] = 0x00001090
		   pgs[9] = 0x00001088--被攻击
		   pgs[8] = 0x00001089--奔跑
		   pgs[5] = 0x00001089--奔跑
		   pgs[4] = 0x00001088--防御
		   pgs[1] = 0x00001086--攻击
		   pgs[2] = 0x00001086--攻击
		   pgs[7] = 0x00001086--施法
		   pgs[3] = 0x00001088--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "画中仙_普通"then
		   pgs[6] = 0x00001095
		   pgs[9] = 0x00001092--被攻击
		   pgs[8] = 0x00001094--奔跑
		   pgs[5] = 0x00001094--奔跑
		   pgs[4] = 0x00001092--防御
		   pgs[1] = 0x00001091--攻击
		   pgs[2] = 0x00001091--攻击
		   pgs[7] = 0x00001091--施法
		   pgs[3] = 0x00001092--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "玉皇大帝_普通"then
		   pgs[6] = 0x00001100
		   pgs[9] = 0x00001097--被攻击
		   pgs[8] = 0x00001099--奔跑
		   pgs[5] = 0x00001099--奔跑
		   pgs[4] = 0x00001097--防御
		   pgs[1] = 0x00001096--攻击
		   pgs[2] = 0x00001096--攻击
		   pgs[7] = 0x00001096--施法
		   pgs[3] = 0x00001097--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "镇元大仙_普通"then
		   pgs[6] = 0x00001115
		   pgs[9] = 0x00001113--被攻击
		   pgs[8] = 0x00001114--奔跑
		   pgs[5] = 0x00001114--奔跑
		   pgs[4] = 0x00001113--防御
		   pgs[1] = 0x00001111--攻击
		   pgs[2] = 0x00001111--攻击
		   pgs[7] = 0x00001111--施法
		   pgs[3] = 0x00001113--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "火魔女_普通"then
		   pgs[6] = 0x00001120
		   pgs[9] = 0x00001118--被攻击
		   pgs[8] = 0x00001119--奔跑
		   pgs[5] = 0x00001119--奔跑
		   pgs[4] = 0x00001118--防御
		   pgs[1] = 0x00001116--攻击
		   pgs[2] = 0x00001116--攻击
		   pgs[7] = 0x00001116--施法
		   pgs[3] = 0x00001117--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶火神祝融_普通"then
		   pgs[6] = 0x00000030
		   pgs[9] = 0x00000028--被攻击
		   pgs[8] = 0x00000029--奔跑
		   pgs[5] = 0x00000029--奔跑
		   pgs[4] = 0x00000028--防御
		   pgs[1] = 0x00000026--攻击
		   pgs[2] = 0x00000026--攻击
		   pgs[7] = 0x00000026--施法
		   pgs[3] = 0x00000027--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶水神共工_普通"then
		   pgs[6] = 0x00000040
		   pgs[9] = 0x00000038--被攻击
		   pgs[8] = 0x00000039--奔跑
		   pgs[5] = 0x00000039--奔跑
		   pgs[4] = 0x00000038--防御
		   pgs[1] = 0x00000036--攻击
		   pgs[2] = 0x00000036--攻击
		   pgs[7] = 0x00000036--施法
		   pgs[3] = 0x00000037--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶北极仙翁_普通"then
		   pgs[6] = 0x00000045
		   pgs[9] = 0x00000043--被攻击
		   pgs[8] = 0x00000044--奔跑
		   pgs[5] = 0x00000044--奔跑
		   pgs[4] = 0x00000043--防御
		   pgs[1] = 0x00000041--攻击
		   pgs[2] = 0x00000041--攻击
		   pgs[7] = 0x00000041--施法
		   pgs[3] = 0x00000042--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶土神后土_普通"then
		   pgs[6] = 0x00000050
		   pgs[9] = 0x00000048--被攻击
		   pgs[8] = 0x00000049--奔跑
		   pgs[5] = 0x00000049--奔跑
		   pgs[4] = 0x00000048--防御
		   pgs[1] = 0x00000046--攻击
		   pgs[2] = 0x00000046--攻击
		   pgs[7] = 0x00000046--施法
		   pgs[3] = 0x00000047--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶上古瑞兽_普通"then
		   pgs[6] = 0x00000060
		   pgs[9] = 0x00000058--被攻击
		   pgs[8] = 0x00000059--奔跑
		   pgs[5] = 0x00000059--奔跑
		   pgs[4] = 0x00000058--防御
		   pgs[1] = 0x00000056--攻击
		   pgs[2] = 0x00000056--攻击
		   pgs[7] = 0x00000056--施法
		   pgs[3] = 0x00000057--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶齐天大圣_普通"then
		   pgs[6] = 0x00000065
		   pgs[9] = 0x00000063--被攻击
		   pgs[8] = 0x00000064--奔跑
		   pgs[5] = 0x00000064--奔跑
		   pgs[4] = 0x00000063--防御
		   pgs[1] = 0x00000061--攻击
		   pgs[2] = 0x00000061--攻击
		   pgs[7] = 0x00000061--施法
		   pgs[3] = 0x00000062--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶太上老君_普通"then
		   pgs[6] = 0x00000070
		   pgs[9] = 0x00000068--被攻击
		   pgs[8] = 0x00000069--奔跑
		   pgs[5] = 0x00000069--奔跑
		   pgs[4] = 0x00000068--防御
		   pgs[1] = 0x00000066--攻击
		   pgs[2] = 0x00000066--攻击
		   pgs[7] = 0x00000066--施法
		   pgs[3] = 0x00000067--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶太已真人_普通"then
		   pgs[6] = 0x00000075
		   pgs[9] = 0x00000072--被攻击
		   pgs[8] = 0x00000074--奔跑
		   pgs[5] = 0x00000074--奔跑
		   pgs[4] = 0x00000072--防御
		   pgs[1] = 0x00000071--攻击
		   pgs[2] = 0x00000071--攻击
		   pgs[7] = 0x00000071--施法
		   pgs[3] = 0x00000072--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶上古天兵_普通"then
		   pgs[6] = 0x00000079
		   pgs[9] = 0x00000077--被攻击
		   pgs[8] = 0x00000078--奔跑
		   pgs[5] = 0x00000078--奔跑
		   pgs[4] = 0x00000077--防御
		   pgs[1] = 0x00000076--攻击
		   pgs[2] = 0x00000076--攻击
		   pgs[7] = 0x00000076--施法
		   pgs[3] = 0x00000077--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶判官_普通"then
		   pgs[6] = 0x00000089
		   pgs[9] = 0x00000087--被攻击
		   pgs[8] = 0x00000088--奔跑
		   pgs[5] = 0x00000088--奔跑
		   pgs[4] = 0x00000087--防御
		   pgs[1] = 0x00000085--攻击
		   pgs[2] = 0x00000085--攻击
		   pgs[7] = 0x00000085--施法
		   pgs[3] = 0x00000086--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶白象精_普通"then
		   pgs[6] = 0x00001004
		   pgs[9] = 0x00001002--被攻击
		   pgs[8] = 0x00001003--奔跑
		   pgs[5] = 0x00001003--奔跑
		   pgs[4] = 0x00001002--防御
		   pgs[1] = 0x00001000--攻击
		   pgs[2] = 0x00001000--攻击
		   pgs[7] = 0x00001000--施法
		   pgs[3] = 0x00001001--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶上古精灵_普通"then
		   pgs[6] = 0x00001009
		   pgs[9] = 0x00001006--被攻击
		   pgs[8] = 0x00001008--奔跑
		   pgs[5] = 0x00001008--奔跑
		   pgs[4] = 0x00001006--防御
		   pgs[1] = 0x00001005--攻击
		   pgs[2] = 0x00001005--攻击
		   pgs[7] = 0x00001005--施法
		   pgs[3] = 0x00001006--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶红孩儿_普通"then
		   pgs[6] = 0x00001014
		   pgs[9] = 0x00001011--被攻击
		   pgs[8] = 0x00001013--奔跑
		   pgs[5] = 0x00001013--奔跑
		   pgs[4] = 0x00001011--防御
		   pgs[1] = 0x00001010--攻击
		   pgs[2] = 0x00001010--攻击
		   pgs[7] = 0x00001010--施法
		   pgs[3] = 0x00001011--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶上古蛟龙_普通"then
		   pgs[6] = 0x00001019
		   pgs[9] = 0x00001017--被攻击
		   pgs[8] = 0x00001018--奔跑
		   pgs[5] = 0x00001018--奔跑
		   pgs[4] = 0x00001017--防御
		   pgs[1] = 0x00001015--攻击
		   pgs[2] = 0x00001015--攻击
		   pgs[7] = 0x00001015--施法
		   pgs[3] = 0x00001017--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶大鹏王_普通"then
		   pgs[6] = 0x00001024
		   pgs[9] = 0x00001022--被攻击
		   pgs[8] = 0x00001023--奔跑
		   pgs[5] = 0x00001023--奔跑
		   pgs[4] = 0x00001022--防御
		   pgs[1] = 0x00001020--攻击
		   pgs[2] = 0x00001020--攻击
		   pgs[7] = 0x00001020--施法
		   pgs[3] = 0x00001021--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶达摩_普通"then
		   pgs[6] = 0x00001029
		   pgs[9] = 0x00001027--被攻击
		   pgs[8] = 0x00001028--奔跑
		   pgs[5] = 0x00001028--奔跑
		   pgs[4] = 0x00001027--防御
		   pgs[1] = 0x00001025--攻击
		   pgs[2] = 0x00001025--攻击
		   pgs[7] = 0x00001025--施法
		   pgs[3] = 0x00001026--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶雨神龙王_普通"then
		   pgs[6] = 0x00001034
		   pgs[9] = 0x00001032--被攻击
		   pgs[8] = 0x00001033--奔跑
		   pgs[5] = 0x00001033--奔跑
		   pgs[4] = 0x00001032--防御
		   pgs[1] = 0x00001030--攻击
		   pgs[2] = 0x00001030--攻击
		   pgs[7] = 0x00001030--施法
		   pgs[3] = 0x00001031--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶菩缇老祖_普通"then
		   pgs[6] = 0x00001039
		   pgs[9] = 0x00001036--被攻击
		   pgs[8] = 0x00001038--奔跑
		   pgs[5] = 0x00001038--奔跑
		   pgs[4] = 0x00001036--防御
		   pgs[1] = 0x00001035--攻击
		   pgs[2] = 0x00001035--攻击
		   pgs[7] = 0x00001035--施法
		   pgs[3] = 0x00001036--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶青牛精_普通"then
		   pgs[6] = 0x00001045
		   pgs[9] = 0x00001041--被攻击
		   pgs[8] = 0x00001043--奔跑
		   pgs[5] = 0x00001043--奔跑
		   pgs[4] = 0x00001041--防御
		   pgs[1] = 0x00001040--攻击
		   pgs[2] = 0x00001040--攻击
		   pgs[7] = 0x00001040--施法
		   pgs[3] = 0x00001041--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶青毛狮王_普通"then
		   pgs[6] = 0x00001050
		   pgs[9] = 0x00001048--被攻击
		   pgs[8] = 0x00001049--奔跑
		   pgs[5] = 0x00001049--奔跑
		   pgs[4] = 0x00001048--防御
		   pgs[1] = 0x00001046--攻击
		   pgs[2] = 0x00001046--攻击
		   pgs[7] = 0x00001046--施法
		   pgs[3] = 0x00001047--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶六耳猕猴_普通"then
		   pgs[6] = 0x00001055
		   pgs[9] = 0x00001053--被攻击
		   pgs[8] = 0x00001054--奔跑
		   pgs[5] = 0x00001054--奔跑
		   pgs[4] = 0x00001053--防御
		   pgs[1] = 0x00001051--攻击
		   pgs[2] = 0x00001051--攻击
		   pgs[7] = 0x00001051--施法
		   pgs[3] = 0x00001052--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶如来佛祖_普通"then
		   pgs[6] = 0x00001060
		   pgs[9] = 0x00001058--被攻击
		   pgs[8] = 0x00001059--奔跑
		   pgs[5] = 0x00001059--奔跑
		   pgs[4] = 0x00001058--防御
		   pgs[1] = 0x00001056--攻击
		   pgs[2] = 0x00001056--攻击
		   pgs[7] = 0x00001056--施法
		   pgs[3] = 0x00001057--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶陆压道人_普通"then
		   pgs[6] = 0x00001065
		   pgs[9] = 0x00001063--被攻击
		   pgs[8] = 0x00001064--奔跑
		   pgs[5] = 0x00001064--奔跑
		   pgs[4] = 0x00001063--防御
		   pgs[1] = 0x00001061--攻击
		   pgs[2] = 0x00001061--攻击
		   pgs[7] = 0x00001061--施法
		   pgs[3] = 0x00001062--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶瑭僧_普通"then
		   pgs[6] = 0x00001070
		   pgs[9] = 0x00001068--被攻击
		   pgs[8] = 0x00001069--奔跑
		   pgs[5] = 0x00001069--奔跑
		   pgs[4] = 0x00001068--防御
		   pgs[1] = 0x00001066--攻击
		   pgs[2] = 0x00001066--攻击
		   pgs[7] = 0x00001066--施法
		   pgs[3] = 0x00001068--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶王母娘娘_普通"then
		   pgs[6] = 0x00001075
		   pgs[9] = 0x00001072--被攻击
		   pgs[8] = 0x00001074--奔跑
		   pgs[5] = 0x00001074--奔跑
		   pgs[4] = 0x00001072--防御
		   pgs[1] = 0x00001071--攻击
		   pgs[2] = 0x00001071--攻击
		   pgs[7] = 0x00001071--施法
		   pgs[3] = 0x00001072--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶小白龙_普通"then
		   pgs[6] = 0x00001080
		   pgs[9] = 0x00001078--被攻击
		   pgs[8] = 0x00001079--奔跑
		   pgs[5] = 0x00001079--奔跑
		   pgs[4] = 0x00001078--防御
		   pgs[1] = 0x00001076--攻击
		   pgs[2] = 0x00001076--攻击
		   pgs[7] = 0x00001076--施法
		   pgs[3] = 0x00001077--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶白龙女_普通"then
		   pgs[6] = 0x00001085
		   pgs[9] = 0x00001082--被攻击
		   pgs[8] = 0x00001084--奔跑
		   pgs[5] = 0x00001084--奔跑
		   pgs[4] = 0x00001082--防御
		   pgs[1] = 0x00001081--攻击
		   pgs[2] = 0x00001081--攻击
		   pgs[7] = 0x00001081--施法
		   pgs[3] = 0x00001082--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶青蛟龙_普通"then
		   pgs[6] = 0x00001090
		   pgs[9] = 0x00001088--被攻击
		   pgs[8] = 0x00001089--奔跑
		   pgs[5] = 0x00001089--奔跑
		   pgs[4] = 0x00001088--防御
		   pgs[1] = 0x00001086--攻击
		   pgs[2] = 0x00001086--攻击
		   pgs[7] = 0x00001086--施法
		   pgs[3] = 0x00001088--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶画中仙_普通"then
		   pgs[6] = 0x00001095
		   pgs[9] = 0x00001092--被攻击
		   pgs[8] = 0x00001094--奔跑
		   pgs[5] = 0x00001094--奔跑
		   pgs[4] = 0x00001092--防御
		   pgs[1] = 0x00001091--攻击
		   pgs[2] = 0x00001091--攻击
		   pgs[7] = 0x00001091--施法
		   pgs[3] = 0x00001092--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶玉皇大帝_普通"then
		   pgs[6] = 0x00001100
		   pgs[9] = 0x00001097--被攻击
		   pgs[8] = 0x00001099--奔跑
		   pgs[5] = 0x00001099--奔跑
		   pgs[4] = 0x00001097--防御
		   pgs[1] = 0x00001096--攻击
		   pgs[2] = 0x00001096--攻击
		   pgs[7] = 0x00001096--施法
		   pgs[3] = 0x00001097--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶镇元大仙_普通"then
		   pgs[6] = 0x00001115
		   pgs[9] = 0x00001113--被攻击
		   pgs[8] = 0x00001114--奔跑
		   pgs[5] = 0x00001114--奔跑
		   pgs[4] = 0x00001113--防御
		   pgs[1] = 0x00001111--攻击
		   pgs[2] = 0x00001111--攻击
		   pgs[7] = 0x00001111--施法
		   pgs[3] = 0x00001113--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶火魔女_普通"then
		   pgs[6] = 0x00001120
		   pgs[9] = 0x00001118--被攻击
		   pgs[8] = 0x00001119--奔跑
		   pgs[5] = 0x00001119--奔跑
		   pgs[4] = 0x00001118--防御
		   pgs[1] = 0x00001116--攻击
		   pgs[2] = 0x00001116--攻击
		   pgs[7] = 0x00001116--施法
		   pgs[3] = 0x00001117--死亡倒地
           pgs[10] = "幕神.rpk"

           elseif pg == "进阶金枪二郎神_普通"then
		   pgs[6] = 0x00000025
		   pgs[9] = 0x00000023--被攻击
		   pgs[8] = 0x00000024--奔跑
		   pgs[5] = 0x00000024--奔跑
		   pgs[4] = 0x00000023--防御
		   pgs[1] = 0x00000021--攻击
		   pgs[2] = 0x00000021--攻击
		   pgs[7] = 0x00000021--施法
		   pgs[3] = 0x00000022--死亡倒地
           pgs[10] = "幕神.rpk"
           elseif pg == "进阶太白星君_普通"then
		   pgs[6] = 0x00000035
		   pgs[9] = 0x00000033--被攻击
		   pgs[8] = 0x00000034--奔跑
		   pgs[5] = 0x00000034--奔跑
		   pgs[4] = 0x00000033--防御
		   pgs[1] = 0x00000031--攻击
		   pgs[2] = 0x00000031--攻击
		   pgs[7] = 0x00000031--施法
		   pgs[3] = 0x00000032--死亡倒地
           pgs[10] = "幕神.rpk"




	-- 1是攻击 2是第二种形态攻击 3是死亡 4是防御 6是待战 7是施法 8是跑去 9是挨打 10是资源包
--########################################################?自己修改?##########################################
	end
	if pgs[10] == nil then
		local jps0 = 引擎.取所有模型(pg2)
		if jps0~=nil and jps0.待战~=nil then
			pgs[1] = jps0.攻击
			pgs[2] = jps0.攻击B
			pgs[3] = jps0.倒地
			pgs[4] = jps0.防御
			pgs[6] = jps0.待战
			pgs[7] = jps0.施法
			pgs[8] = jps0.跑去
			pgs[9] = jps0.挨打
			if jps0.资源 ~= nil then
				pgs[1] = jps0.攻击+0
				pgs[2] = jps0.攻击B+0
				pgs[3] = jps0.倒地+0
				pgs[4] = jps0.防御+0
				pgs[6] = jps0.待战+0
				pgs[7] = jps0.施法+0
				pgs[8] = jps0.跑去+0
				pgs[9] = jps0.挨打+0
			    pgs[10] = jps0.资源
			else
				pgs[10] = ""
			end
		end
	end
	if  pgs[1.1]  == nil  then
		pgs[1.1]  = pgs[1]

	end

	if  pgs[1.2] == nil  then
	    pgs[1.2] = pgs[7]
	end
	-- 1是攻击 2是第二种形态攻击 3是死亡 4是防御 6是待战 7是施法 8是跑去 9是挨打 10是资源包
	return pgs
end