--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2018-11-13 19:53:16
--======================================================================--
local random = 引擎.取随机整数
local remove = table.remove

function 引擎.自由事件(map)
	local nop = nil
	-- x坐标，y坐标，剧情标识 剧情进度 开关标识 开关状态 等级限制 唯一标识
	if map == 1501 then
		nop = {{25,22,"剧情",0,nil,nil,"初始剧情"}}
	end
	return nop
end
-----------
function 引擎.取自由事件(bs)
	if 引擎.场景.战斗中 then
		return false
	end
	local dj = 引擎.场景.队伍[1].等级
	if bs == "初始剧情" and dj >= 10 then
	end
end
----------
function 引擎.题库(类型,取答案,取题目)
	local 题目组 = {}
	local 题目;
	local 答案;
	local gl = random(1,2)
	if 类型 == "元宵" then
		if gl == 1 then
			题目 = {"元旦元宵捷报频传（打一成语）","正月十五打牙祭（打一成语）","婚期定在元宵后（打一成语）","煤球和元宵一样（打一成语）","元宵（打一成语）","元宵节后捷报多（打一成语）","元宵同返家（打一成语）","元宵之后柳吐芽（打一成语）","十五始展眉（打一成语）"}
			答案 = {"节节胜利","一年一回","喜出望外","混淆黑白","一朝一夕","喜出望外","众望所归","节外生枝","自圆其说"}
		else
			题目 = {"高台对映月分明（打一字）","层云隐去月当头（打一字）","十五日（打一字）","离别四十年，本聚在元宵。（打一字）","元宵节后（打一字）","元宵节后东陵行（打一字）","元宵前后共团圆（打一字）","元宵花灯如星光（打一字）"}
			答案 = {"昙","屑","胖","舞","完","院","期","荧"}
		end
		local zz = random(1,#题目)
		题目组[1] = 题目[zz]
		题目组[6] = 答案[zz]
		remove(答案,zz)
		for n=2,5 do
			local zzs = random(1,#答案)
			题目组[n] = 答案[zzs]
			remove(答案, zzs)
		end
		local bj = 0
		for i=2,5 do
			if 题目组[i] == 题目组[6] then
				bj = 1
				break
			end
		end
		if bj == 0 then
			题目组[random(2,5)] = 题目组[6]
		end
	elseif 类型 == "自由" then
		题目 = {"围棋棋盘一共有多少个交叉","佛教中人所用的“钵”是一种","唐朝的“朝”字由多少笔画组成？","到十级就可以去钓鱼啦，在哪里买鱼竿呢？"}
		答案 = {{"361","365","366","360"},{"餐具","茶具","装饰品","乐器"},{"十一画","九画","十二画","十画"},{"长寿村或傲来国的渔夫","长寿村村长","东海湾的林老汉","东海湾的虾兵蟹将"}}
		if 取答案 == nil then
			local sj = random(1,#题目)
			题目组[1] = 题目[sj]
			题目组[3] = 答案[sj][1]
			local mfs = {}
			for i=1,4 do
				local v = random(1,#答案[sj])
				mfs[i] = 答案[sj][v]
				remove(答案[sj], v)
			end
			题目组[2] = mfs
		else
			local da = nil
			for n=1,#题目 do
				if 题目[n] == 取题目 then
					da = n
					break
				end
			end
			da = 答案[da][1]
			return da
		end
	end
	return 题目组
end