--======================================================================--
--   梦幻西游
--  梦幻西游
--  梦幻西游
--======================================================================--

场景类_标题说明=[[

#W《梦幻西游》是一款由中国网易公司自行开发并营运的网络游戏。游戏以著名的章回小说 《梦幻西游》是一款由中国网易公司自行开发并营运的网络游戏。梦幻西游游戏以著名的章回小说《西游记》故事为背景，透过Q版的人物，试图营造出浪漫的网络游戏风格。
《梦幻西游》拥有注册用户超过3.1亿，一共开设收费服务器达472组，最高同时在线人数达271万(2012年8月5日14:45)，是当时中国大陆同时在线人数最高的网络游戏。游戏于2013年6月24日改名为《梦幻西游2》 。2016年2月29日正式定名为《梦幻西游》电脑版 。网易公司(NASDAQ:NTES)是国内拥有自主研发、运营、代理能力的顶尖在线游戏开发运营商。网易在国内开发互联网应用、服务及其它技术方面的领先优势，通过高素质的精英团队、先进的网络技术及专业经营网络娱乐的经验。本着打造最符合国内玩家口味的产品，做“最体贴玩家游戏”的理念，在网易互动推出的游戏产品中，一直都深受众多玩家喜爱，在线人数在不断攀升，旗下成功运营的游戏有《梦幻西游》电脑版、《大话西游2经典版》、《大话西游2免费版》、《天下3》、《新倩女幽魂》、《逆水寒》、《梦幻西游》手游、《大话西游》手游、《倩女幽魂》手游、《阴阳师》、《率土之滨》、《楚留香》手游、《荒野行动》、《终结者2：审判日》、《第五人格》、《明日之后》、《神都夜行录》等游戏。
网络游戏市场在不断壮大的同时，网易也希望与业界同行深度合作。网易旗下有众多优质的游戏需要更多的渠道资源来拓展用户，也期望能提升网易在游戏市场上的份额，并给予合作方持续、稳定、高额的成果回报。
]]
