--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2020-10-07 14:57:54
--======================================================================--
local randmon = 引擎.取随机整数
local insert  = table.insert
function 引擎.场景:获取任务对话(任务,编号,编号1)
	local rw = self.队伍[1].名称
	local tx = self.队伍[1].模型
	if 任务 == "枯萎的金莲" then
		if 编号 == 1 then
			self.窗口.对话栏:文本("女人_王大嫂","王大嫂","少侠你想做什么呢？",{"红尘试炼","我只是路过"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 2 then
			self.窗口.对话栏:文本(tx,rw,"大娘，我初来贵地，人生路不熟，请多多关照。")
			self.窗口.对话栏:文本(tx,rw,"唉……(看来她没有听到的样子)")
			self.窗口.对话栏:文本(tx,rw,"这位大娘好像心事重重的样子，待我再问一下",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 3 then
			self.窗口.对话栏:文本("女人_王大嫂","王大嫂","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 4 then
			self.窗口.对话栏:文本(tx,rw,"这位大娘，看你哀声叹气的，是不是有什么事情啊？")
			self.窗口.对话栏:文本("女人_王大嫂","王大嫂","唉……东海湾有不少牲口没了，官府查了阵子就没了下文。有传言说是妖怪在作祟，把牲口抓去吃掉了。搞得大家人心惶惶，都不怎么敢去东海湾了。")
			self.窗口.对话栏:文本("女人_王大嫂","王大嫂","近来不止牲口，连人都有失踪的，城里的虎子不见了好几天了。我们街坊刚提到他。")
			self.窗口.对话栏:文本(tx,rw,"大娘你有虎子的线索吗？")
			self.窗口.对话栏:文本("女人_王大嫂","王大嫂","线索……你可以去问问吹牛王，他跟虎子挺熟的。",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 5 then
			self.窗口.对话栏:文本("男人_苦力","吹牛王","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 6 then
			self.窗口.对话栏:文本("男人_苦力","吹牛王","虎子呀，那家伙喜欢到处乱跑，过几天就会回来吧。")
			self.窗口.对话栏:文本(tx,rw,"近来不是很多牲口失踪么，大家都很担心，会不会出什么意外啊？")
			self.窗口.对话栏:文本("男人_苦力","吹牛王","这个……虎子近来都在帮马全有干活，你问问他也许有线索。",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 7 then
			self.窗口.对话栏:文本("男人_武器店老板","马全有","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 8 then
			self.窗口.对话栏:文本("男人_武器店老板","马全有","虎子啊，确实好几天没看到他了，我也很担心啊。他之前是到东海湾抓海龟去了，少侠可以去那边找找他，希望他平安无事吧。")
			self.窗口.对话栏:文本(tx,rw,"东海湾这么大，我怎么去找一个不认识的人？")
			self.窗口.对话栏:文本("男人_武器店老板","马全有","这里有个虎子寄放的包裹，雷黑子养的狗鼻子挺灵的，你让他闻一闻这个包裹，他应该就会带你去找虎子了。")
			self.窗口.对话栏:文本("男人_武器店老板","马全有","有劳少侠了，希望虎子平安无事吧。",{"好，这事情就包在我身上","我再想想"},{"红尘试炼",nil,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 9 then
			self.窗口.对话栏:文本("小孩_雷黑子","雷黑子","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 10 then
			self.窗口.对话栏:文本("小孩_雷黑子","雷黑子","要借旺财？我的狗狗可不能让你白白带走！你要给我一个、不，两个包子……嗝")
			self.窗口.对话栏:文本("小孩_雷黑子","雷黑子","嗝……吃太多包子了，肚子好饱……算了，这次旺财就免费借给你吧，下次还有什么事情找我帮忙，记得带包子给我哦！")
			self.窗口.对话栏:文本("小孩_雷黑子","雷黑子","谢谢啦，我这就去……啊，这狗怎么一溜烟就跑了？")
			self.窗口.对话栏:文本("小孩_雷黑子","雷黑子","没关系，准是去了小花姐那边，你去看看吧。",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 11 then
			self.窗口.对话栏:文本("普陀山_接引仙女","小花","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 12 then
			self.窗口.对话栏:文本("普陀山_接引仙女","小花","旺财？就在这边吃东西呢。这孩子就是贪吃。每次一被放走，就跑来我这边讨吃的。")
			self.窗口.对话栏:文本(tx,rw,"#35还真是什么样的人养什么样的狗。好啦，吃饱就干活了，这是虎子的包裹，你赶紧嗅一嗅。")
			self.窗口.对话栏:文本("狼",nil,"(旺财嗅了几下，一溜烟地往东海湾跑去了)")
			self.窗口.对话栏:文本(tx,rw,"看来是有发现了？赶紧跟在后面。",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 13 then
			self.窗口.对话栏:文本("男人_村长","云游神医","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 14 then
			self.窗口.对话栏:文本(tx,rw,"这位老人家，我在找一个叫虎子的小伙子，你认识吗？")
			self.窗口.对话栏:文本("男人_村长","云游神医","虎子？我认识。")
			self.窗口.对话栏:文本(tx,rw,"那您最近有见过他吗？")
			self.窗口.对话栏:文本("男人_村长","云游神医","见过，就在你的身后嘛。",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]],[[引擎.场景:剧情场景加入("红尘试炼")]]})
		elseif 编号 == 15 then
			self.窗口.对话栏:文本("男人_村长","云游神医","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 16 then
			self.窗口.对话栏:文本("僵尸",nil,"呜哇！！（僵尸虎子就要扑过来了）",{"发起攻击（战斗）","在准备一下"},{"红尘试炼"})
		elseif 编号 == 17 then
			self.窗口.对话栏:文本("男人_村长","云游神医","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 18 then
			self.窗口.对话栏:文本("男人_村长","云游神医","不用急，虎子虽身中了尸毒，但还有一息尚存，从我身后的小路往北走有位楚恋依姑娘，颇有神通，大侠可把虎子带过去让她看看。")
			self.窗口.对话栏:文本(tx,rw,"您老还真镇定。")
			self.窗口.对话栏:文本("男人_村长","云游神医","等你也活到我这个岁数，什么妖怪啊神仙啊，就都不稀奇了。")
			self.窗口.对话栏:文本(tx,rw,"……事不宜迟，我这就过去找她。",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 19 then
			self.窗口.对话栏:文本("普陀山_接引仙女","楚恋依","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 20 then
			self.窗口.对话栏:文本("普陀山_接引仙女","楚恋依","此人命不该绝，救他并不困难。不过少侠因此事寻找，却也是一份机缘。少侠先同我猜个谜底，之后我再救他")
			self.窗口.对话栏:文本("普陀山_接引仙女","楚恋依","我有一物，不生不灭，不垢不净，无忧无怖，无欲无求，是为何物？")
			self.窗口.对话栏:文本(tx,rw,"这个……")
			self.窗口.对话栏:文本("普陀山_接引仙女","楚恋依","替我找一朵金莲花来，你自然知道谜底了。",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 21 then
			self.窗口.对话栏:文本("小孩_雷黑子","雷黑子","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 22 then
			self.窗口.对话栏:文本("小孩_雷黑子","雷黑子","嘿嘿，我的旺财是不是只聪明能干的好狗呢？")
			self.窗口.对话栏:文本(tx,rw,"嗯，真是帮了大忙了。对了小弟弟，你知道哪里有金莲花么？")
			self.窗口.对话栏:文本("小孩_雷黑子","雷黑子","我见过红莲花粉莲花白莲花，至于金色莲花么……记得我们上次约好的，现在我肚子饿了，我要吃包子哦。")
			self.窗口.对话栏:文本(tx,rw,"……现在的小孩子都是这么馋。",{"这事情很紧急，告诉他情况","我再想想"},{"红尘试炼"})
		elseif 编号 == 23 then
			self.窗口.对话栏:文本("小孩_雷黑子","雷黑子","什么！虎子哥遇到危险了……呜呜，包子我不要了，你赶快把虎子哥救活啊。")
			self.窗口.对话栏:文本(tx,rw,"（馋嘴归馋嘴，这小孩子还是很热心的。）")
			self.窗口.对话栏:文本("小孩_雷黑子","雷黑子","念佛的小花姐姐供养着一朵金莲花，赶紧去问问她吧。",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 24 then
			self.窗口.对话栏:文本("普陀山_接引仙女","小花","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 25 then
			if 取物品数量() < 160 then
				self.提示:写入("#Y/你获得了#G/金莲")
				self.窗口.对话栏:文本("普陀山_接引仙女","小花","金莲花？自从我爹娘说什么感情都比不上钱财来得实在，决定把我嫁给马富少，金莲花就逐渐枯萎了……")
				self.窗口.对话栏:文本(tx,rw,"这位姑娘如此单纯美丽，竟也受了世俗的侵扰……千金易求，真心难得，我劝姑娘三思啊……")
				self.窗口.对话栏:文本("普陀山_接引仙女","小花","其实吴生除了家境贫寒什么都好，如果我能够吃在马家睡在吴家该有多好呢……不管怎样，多谢你劝我一番话，我会仔细想想的。这朵金莲花你要就拿去吧。")
				self.窗口.对话栏:文本(tx,rw,"这……只好这样了……",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]],[[增加物品("枯萎的金莲")]]})
				编号 = 编号 + 1
			else
				self.窗口.对话栏:文本("普陀山_接引仙女","小花","道具行囊至少要有一个空位")
				self:剧情点减少("红尘试炼",1)
			end
		elseif 编号 == 26 then
			self.窗口.对话栏:文本("普陀山_接引仙女","楚恋依","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 27 then
			物品失去("枯萎的金莲",1)
			self.提示:写入("#Y/你失去了#R/金莲")
			self.窗口.对话栏:文本("普陀山_接引仙女","楚恋依","你果真没有辜负我的期望，将金莲找来了！")
			self.窗口.对话栏:文本(tx,rw,"我只找到一朵枯萎的金莲……")
			self.窗口.对话栏:文本("普陀山_接引仙女","楚恋依","没关系，你将金莲拿来给我，唵嘛呢叭咪吽……")
			self.窗口.对话栏:文本(tx,rw,"金莲重生！你，你原来就是传说中的——神仙！")
			self.窗口.对话栏:文本("观音姐姐",nil,"不错，我就是‘落伽山上慈悲主，潮音洞里观世音’。",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]],[[引擎.场景:剧情场景加入("红尘试炼")]]})
			编号 = 编号 + 1
		elseif 编号 ==  28 then
			self.窗口.对话栏:文本("普陀山_接引仙女","楚恋依","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 ==  29 then
			self.窗口.对话栏:文本("普陀山_接引仙女","楚恋依","少侠不必言谢，他已被送回家里，好生休息即可无恙。")
			self.窗口.对话栏:文本(tx,rw,"你……您……真的是观音吗？")
			self.窗口.对话栏:文本("普陀山_接引仙女","楚恋依","观音化生千万，皆为度化众生，是与不是，何须执着。")
			self.窗口.对话栏:文本(tx,rw,"既然如此，您为何不去度化东海湾的亡魂，而任由他们为祸人间？")
			self.窗口.对话栏:文本("普陀山_接引仙女","楚恋依","人间种种，必有因果，需有缘之人方可度化。少侠若有意共赴西游之旅，长安城有不少有学问的人，你可以先找他们了解一下西游的历史。",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 30 then
			self.窗口.对话栏:文本("女人_王大嫂","王大嫂","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 31 then
			self:增加经验(3000,nil,true)
			增加物品("金创药",2)
			self.提示:写入("#Y/你获得了金创药*2")
			self.窗口.任务栏:删除("枯萎的金莲")
			self.红尘试炼 = nil
			self.梦幻指引["枯萎的金莲"] = true
			self.窗口.对话栏:文本("女人_王大嫂","王大嫂","虎子平安无事吗？真是太好了，太感谢少侠了。")
		end
	elseif 任务 == "商人的鬼魂" then
		if 编号 == 1 then
			self.窗口.对话栏:文本("男人_老孙头","老孙头","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 2 then
			self.窗口.对话栏:文本("男人_老孙头","老孙头","近几年哇，临近建邺城的东海湾就有闹鬼的传闻，靠近海边的村子里，不是百姓走失，就是家畜死于非命！李善人为此出资做过好几次法事了，可没想到，这事情一点平息的迹象也没有....竟然有人在建邺城里撞到了鬼！如今大家人心惶惶，说是城里风水不好，要出大事了呢！")
			self.窗口.对话栏:文本(tx,rw,"真的有人撞到鬼了哇#24")
			self.窗口.对话栏:文本("男人_老孙头","老孙头","可不是！撞到鬼的#Y/牛大胆#W/还是个道士呢，你说邪门不邪门！")
			self.窗口.对话栏:文本(tx,rw,"（心想：既然牛大胆撞到鬼了，那一定会有线索。）",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 3 then
			self.窗口.对话栏:文本("男人_道士","牛大胆","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 4 then
			self.窗口.对话栏:文本("男人_道士","牛大胆","小侠客，你找老道我可是有什么事儿吗？")
			self.窗口.对话栏:文本(tx,rw,"我是来调查建邺城闹鬼的事儿的。听说老神仙您撞到鬼了？那是怎么个情形哇")
			self.窗口.对话栏:文本("男人_道士","牛大胆","怎么这么不会说话，怎么撞到鬼了#4老道我那是抓鬼去了，谁承想，那只鬼脚底抹油，竟然让他给跑了！")
			self.窗口.对话栏:文本(tx,rw,"那您可看清楚他长什么样子了？知道他是什么来历吗？")
			self.窗口.对话栏:文本("男人_道士","牛大胆","咳咳咳……这个鬼啊……真是……咳咳咳……有点饿了怎么办#17我最爱吃#Y/王大嫂#W/做的红烧鱼了，现在好想吃哇#80")
			self.窗口.对话栏:文本(tx,rw,"好好好，我这就去给你找！",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 5 then
			self.窗口.对话栏:文本("女人_王大嫂","王大嫂","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 6 then
			self.窗口.对话栏:文本("女人_王大嫂","王大嫂","哎……哎……哎……#14")
			self.窗口.对话栏:文本(tx,rw,"王大嫂您可是有什么为难的事儿？说给我听听，我多少也能帮上些忙#17")
			self.窗口.对话栏:文本("女人_王大嫂","王大嫂","家里的小儿生病了，需要一味#Y/赤叶甘草#W来入药，可这一时间，我怎么凑得齐一百两银子啊！真真儿急死人了")
			self.窗口.对话栏:文本(tx,rw,"您别急，我这就去#G/回春堂分店#W/找#Y/赤叶甘草#W！",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 7 then
			self.窗口.对话栏:文本("男人_药店老板","药店老板","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 8 then
			if 取物品数量() < 160 then
				增加物品("赤叶甘草")
				self.提示:写入("#Y/你获得了一朵#R/赤叶甘草#W/")
				self.窗口.对话栏:文本("男人_药店老板","药店老板","小侠客，你是说王大嫂的小儿子生病了？需要一朵#Y/赤叶甘草#W？")
				self.窗口.对话栏:文本(tx,rw,"是呀是呀，可是这赤叶甘草实在是太贵了，王大嫂一时间也凑不齐这么多钱")
				self.窗口.对话栏:文本("男人_药店老板","药店老板","#113说什么见外的话，救人要紧，你赶紧帮我把这朵#Y/赤叶甘草#W给她送过去吧！",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]]})
				编号 = 编号 + 1
			else
				self.窗口.对话栏:文本("男人_药店老板","药店老板","道具行囊至少要有一个空位")
				self:剧情点减少("红尘试炼",1)
			end
		elseif 编号 == 9 then
			self.窗口.对话栏:文本("女人_王大嫂","王大嫂","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 10 then
			if 取物品数量() < 160 then
				物品失去("赤叶甘草",1)
				增加物品("红烧鱼",1)
				self.提示:写入("#Y/你失去了#R/赤叶甘草")
				self.提示:写入("#Y/你获得了一个#R/红烧鱼#W/")
				self.窗口.对话栏:文本("女人_王大嫂","王大嫂","真是辛苦少侠了。自从先夫去世，大家对我们孤儿寡母一直甚是照顾，我真是无以为报#52")
				self.窗口.对话栏:文本(tx,rw,"其实，我也有事相求。听说，牛大胆说您做的红烧鱼特别好吃，非要让我向您讨一份儿#17")
				self.窗口.对话栏:文本("女人_王大嫂","王大嫂","这个不难！这红烧鱼还热着呢，少侠您快点把它给#Y/牛大胆#W/送去吧！",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]]})
				编号 = 编号 + 1
			else
				self.窗口.对话栏:文本("女人_王大嫂","王大嫂","道具行囊至少要有一个空位")
				self:剧情点减少("红尘试炼",1)
			end
		elseif 编号 == 11 then
			self.窗口.对话栏:文本("男人_道士","牛大胆","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 12 then
			物品失去("红烧鱼",1)
			self.提示:写入("#Y/你失去了#R/红烧鱼#W/")
			self.窗口.对话栏:文本("男人_道士","牛大胆","吧唧吧唧，真好吃，要不是在减肥，真想再吃点啊#80")
			self.窗口.对话栏:文本(tx,rw,"开心了吧，快点告诉我，你撞鬼的情形到底怎样嘛#113")
			self.窗口.对话栏:文本("男人_道士","牛大胆","既然已经吃到了红烧鱼，我就和你说实话吧。我其实根本没有撞到鬼……#17最近找我算命做法的人实在太少，又恰巧想起来东海湾闹鬼的传闻，就撒谎说建邺城也在闹鬼。本想着大家被我这么一吓唬，做法驱邪的人也就多些，可是生意还是那么差#52")
			self.窗口.对话栏:文本(tx,rw,"坏人，骗我#4那也就是说，建邺城闹鬼这事儿，全是您杜撰出来吓唬人的咯！")
			self.窗口.对话栏:文本("男人_道士","牛大胆","其实，也不能完全这么说，至少李善人的病，似乎正是因这闹鬼的传闻而起，少侠不妨去问问他的#Y/管家#W？",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 13 then
			self.窗口.对话栏:文本("男人_店小二","管家","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 14 then
			self.窗口.对话栏:文本("男人_店小二","管家","哎，我们老爷的身体本来就不大好，但每次生病，细心调养下也就好了，没想到这次……就是那个牛大胆说自己撞了鬼之后，老爷的病就愈演愈烈，这几日，眼见着就有些神志不清……大夫说必须要#Y/松风灵芝#W/做药引。我们找遍了建邺城，东海湾还是一无所获，你说这可怎么办呀#52听说城里来了个云游商人叫#Y/马全有#W/，我去找他好几次，都没有见到他的人影。如今老爷病情越来越重，我也走不开，少侠你能不能再去帮我求求他#52",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 15 then
			self.窗口.对话栏:文本("男人_武器店老板","马全有","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 16 then
			if 取物品数量() < 160 then
				增加物品("松风灵芝",1)
				self.提示:写入("#Y/你获得了一个#R/松风灵芝")
				self.窗口.对话栏:文本("男人_武器店老板","马全有","松风灵芝？我倒是有，只是这东西甚是难得，少侠你想要拿它做什么？")
				self.窗口.对话栏:文本(tx,rw,"李善人生了重病，大夫说，须得松风灵芝做药引，方可药到病除。")
				self.窗口.对话栏:文本("男人_武器店老板","马全有","李善人可是个大好人，这松风灵芝给他，也算是物尽其用啦！少侠你赶紧把他拿给管家吧！",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]]})
				编号 = 编号 + 1
			else
				self.窗口.对话栏:文本("男人_武器店老板","马全有","道具行囊至少要有一个空位")
				self:剧情点减少("红尘试炼",1)
			end
		elseif 编号 == 17 then
			self.窗口.对话栏:文本("男人_店小二","管家","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 18 then
			物品失去("松风灵芝",1)
			self.提示:写入("#Y/你失去了#R/松风灵芝#W/")
			self.窗口.对话栏:文本("男人_店小二","管家","这下老爷有救了，谢谢少侠#52请少侠一道和我进去看看老爷吧",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 19 then
			self.窗口.对话栏:文本("男人_老财","李善人","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 20 then
			self.窗口.对话栏:文本("男人_老财","李善人","多谢少侠救命之恩，说起来东海湾闹鬼之事，皆是因为老朽我一人所起……")
			self.窗口.对话栏:文本(tx,rw,"老先生何出此言？")
			self.窗口.对话栏:文本("男人_老财","李善人","七年前，我与一个北俱芦洲的朋友一道前往西牛贺洲收货。回程时我们讲定，先回建邺城卸下我的货物，他也顺便在我这儿小住几日。可是没想到，船开到东海湾，竟遇上一场大风暴，货船也是触了礁。")
			self.窗口.对话栏:文本(tx,rw,"这……")
			self.窗口.对话栏:文本("男人_老财","李善人","当时，我们二人都掉进了海里。幸运的是，我抱住了一个大木桶，尚能浮在海面。风雨里，我听着他呼救着我的名字。可是我想，这木桶怕是承受不了我们两人的重量……于是就眼睁睁地看着他……沉入了海里……")
			self.窗口.对话栏:文本(tx,rw,"然后，东海湾就出现了闹鬼的传闻？")
			self.窗口.对话栏:文本("男人_老财","李善人","是啊，我回到建邺城后不足一月，便有人说在东海湾撞见了鬼……最近，我便是夜夜梦见他对我怒目而视。紧接着，就传出了建邺城闹鬼的事儿。我知道，大错已近铸成，我虽然每年都托人带财物给他的家人，还请道士做法事超度他，但依旧无法减轻我的罪孽。可是，要报仇找老夫便是了，何苦伤害无辜的百姓呢？少侠，我想请你替我去问个明白。")
			self.窗口.对话栏:文本(tx,rw,"那，我该去何处寻找他呢？")
			self.窗口.对话栏:文本("男人_老财","李善人","那艘船是在东海湾沉没的，大家现在都叫他#Y/东海沉船#W/，去哪儿说不定能够找到一些线索，去哪儿要路过#Y/东海湾#W，那么还是有些危险，还请少侠出行之前，点燃一炷#Y/摄妖香吧#W/！",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 21 then
			self.窗口.对话栏:文本("野鬼","商人的鬼魂","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 22 then
			self.窗口.对话栏:文本("野鬼","商人的鬼魂","你就是那个北俱商人的鬼魂？你对李善人怀恨在心就罢了，为何要骚扰临近的百姓呢？",{"呜呜呜哇……（战斗）","唔唔唔。"},{"红尘试炼"})
		elseif 编号 == 23 then
			self.窗口.对话栏:文本("野鬼","商人的鬼魂","少侠，你可要救救我呀#52")
			self.窗口.对话栏:文本(tx,rw,"你……这是怎么了？")
			self.窗口.对话栏:文本("野鬼","商人的鬼魂","七年前我离世之时，未及黑白无常来到，就被一个叫做#Y/妖风#W/的怪物掳走了魂魄。因此，至今入不得轮回，还被他逼着做了许多伤天害理之事。")
			self.窗口.对话栏:文本(tx,rw,"原来如此，这个妖风在哪里？")
			self.窗口.对话栏:文本("野鬼","商人的鬼魂","他此刻正藏再沉船之中，少侠若是能帮我夺回魂魄，在下来世愿做牛作马报答您#52",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 24 then
			self.窗口.对话栏:文本("吸血鬼","妖风","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 25 then
			self.窗口.对话栏:文本(tx,rw,"死妖怪！快点交出你的掠夺的魂魄！",{"看我的厉害(战斗)！","不要烦我。"},{"红尘试炼"})
		elseif 编号 == 26 then
			self.窗口.对话栏:文本("吸血鬼","妖风","咳咳咳……竟然有仙灵相助……莫非你就是……传说中的……")
			self.窗口.对话栏:文本(tx,rw,"我是什么？")
			self.窗口.对话栏:文本("吸血鬼","妖风","即便你是，那又如何……死了我一个，还有别人……来……复苏……大业……呵呵，小家伙……再见！")
			self.窗口.对话栏:文本(tx,rw,"他到底想说说什么？算了算了不乱想了！#Y/商人的鬼魂#W/怕是等急了，我还是先回去找他吧！",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 27 then
			self.窗口.对话栏:文本("野鬼","商人的鬼魂","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 28 then
			self.窗口.对话栏:文本("野鬼","商人的鬼魂","等了七年，我终于可以入三界轮回。寻找我的归宿了。")
			self.窗口.对话栏:文本(tx,rw,"你不再怨恨李善人了？")
			self.窗口.对话栏:文本("野鬼","商人的鬼魂","我从来没有怨恨过他。我心里明白，一个木桶，怎么支撑得了两个人逃出生天？更何况，我死后，他不仅一直照顾我的家人，还年年为我诵经超度#52只是这妖风的力量太过强大，我实在是无法挣脱。如今，我终得解脱，少侠请替我谢谢他。也请您替我转告建邺城的百姓们，再也不会有鬼魂扰民了。")
			self.窗口.对话栏:文本(tx,rw,"这是自然")
			self.窗口.对话栏:文本("野鬼","商人的鬼魂","另外，沉船外有个#Y/虾精#W/，可以带你回到#Y/建邺城#W/，少侠您请多多保重，我也就此前往地府转生了。",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 29 then
			self.窗口.对话栏:文本("男人_老财","李善人","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",{"红尘试炼","我要做其他事情","我点错了"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
		elseif 编号 == 30 then
			self:增加经验(10000,nil,true)
			增加物品("金创药",2)
			if randmon(1,100) <= 30 then
				增加物品("金柳露",2)
				self.提示:写入("#Y/你获得了#G/金柳露")
			end
			self.提示:写入("#Y/你获得了金创药*2")
			self.窗口.任务栏:删除("商人的鬼魂")
			self.红尘试炼 = nil
			self.梦幻指引["商人的鬼魂"] = true
			self.窗口.对话栏:文本("男人_老财","李善人","他根本没有恨过我？我……真是错怪了好人啊。这次多亏是少侠出手相助，为我建邺城解决了一场大麻烦。")
			self.窗口.对话栏:文本(tx,rw,"行侠仗义，这正是我应该做的！说起来此事还没有结束，背后的真凶还没有抓到，我打算回师门为向师傅复命")
		end
	elseif 任务 == "海毛虫剧情" then
		if 编号 == 1 then
			self.窗口.对话栏:文本("蝴蝶仙子","蝴蝶精灵","少侠你想做什么呢？",{"红尘试炼","我只是路过"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 2 then
			self.窗口.对话栏:文本("蝴蝶仙子","蝴蝶精灵","找留经是一只海毛虫，无意中获得上仙的指点，获得了蜕变修行之法，经过艰的修行，终于蜕变成了现在的模样，可以摆脱黑暗的海底，自由飞翔于天际，领略无限风光。你能帮忙将这蜕变之法告诉所有的海毛虫们，让他们有机会和我一样获得蜕变吗？")
			self.窗口.对话栏:文本(tx,rw,"最喜欢做好事了，我这就去。",nil,{[[引擎.场景:删除Npc(1,1506,"蝴蝶仙子","蝴蝶精灵")]],[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 3 then
			local mc
			if 编号1 == "1_小海" then
				mc = "小海"
			elseif 编号1 == "1_小毛" then
				mc = "小毛"
			elseif 编号1 == "1_小虫" then
				mc = "小虫"
			end
			self.窗口.对话栏:文本("海毛虫",mc,"少侠你想做什么呢？",{"红尘试炼","我只是路过"},{"红尘试炼",nil,nil,编号1},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 4 then
			self.红尘试炼[3] = (self.红尘试炼[3] or 0) + 1
			if 编号1 == "1_小海" then
				self.窗口.对话栏:文本(tx,rw,"我受蝴精灵之托来这里转告一个消息，蝴蝶精灵有一蜕变之法，可以让你们获得翅膀，自由飞翔于天空，你们愿意学吗？")
				self.窗口.对话栏:文本("海毛虫","小海","愿意，我愿意！")
				self.窗口.对话栏:文本(tx,rw,"首先你们要勇敢的走出这昏暗的海底，接受阳光的照耀，吸收太阳的能量，然后不断提升自身的实力，这是一个漫长的过程……")
				self.窗口.对话栏:文本("海毛虫","小海","啊，要被太阳曝晒啊，太阳很毒的啊！这蜕变之法太危险了，我还是不学了。",nil,{[[引擎.场景:删除Npc(1,1507,"海毛虫","小海")]]})
			elseif 编号1 == "1_小毛" then
				self.窗口.对话栏:文本(tx,rw,"我受蝴精灵之托来这里转告一个消息，蝴蝶精灵有一蜕变之法，可以让你们获得翅膀，自由飞翔于天空，你们愿意学吗？")
				self.窗口.对话栏:文本("海毛虫","小毛","太好了，我一直都想飞！")
				self.窗口.对话栏:文本(tx,rw,"……当实力到达一定程度后，将会进入关键时期，此时，你们需要停止进食……")
				self.窗口.对话栏:文本("海毛虫","小毛","啊，不能吃东西吗？我们现在每天为了吃的累死累活，就是怕饿啊！这蜕变之法太辛苦了，我还是不学了。",nil,{[[引擎.场景:删除Npc(1,1507,"海毛虫","小毛")]]})
			elseif 编号1 == "1_小虫" then
				self.窗口.对话栏:文本(tx,rw,"我受蝴精灵之托来这里转告一个消息，蝴蝶精灵有一蜕变之法，可以让你们获得翅膀，自由飞翔于天空，你们愿意学吗？")
				self.窗口.对话栏:文本("海毛虫","小虫","我最喜欢蝴蝶了")
				self.窗口.对话栏:文本(tx,rw,"……需要作茧自缚，不能动弹，经过一段时间后，最终积蓄力量突破茧壳，才能大功告成。")
				self.窗口.对话栏:文本("海毛虫","小虫","听起来的方法太难了，我还是放弃好了。",nil,{[[引擎.场景:删除Npc(1,1507,"海毛虫","小虫")]]})
			end
			if self.红尘试炼[3] == 3 then
				self.窗口.对话栏.结束事件 = {[[引擎.场景:获取任务对话("海毛虫剧情",5)]]}
				self:剧情点加入("红尘试炼",1)
				self:剧情点加入("红尘试炼",1)
			end
			self:剧情点减少("红尘试炼",1)
		elseif 编号 == 5 then
			self.窗口.对话栏:文本(tx,rw,"看来他们都还是比较难以接受啊，去问问海毛虫长老的意见吧，他见多识厂，想必考虑得更多。",nil,{[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 6 then
			self.窗口.对话栏:文本("海毛虫","海毛虫长老","少侠你想做什么呢？",{"红尘试炼","我只是路过"},{"红尘试炼",nil,nil,编号1},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 7 then
			self.窗口.对话栏:文本(tx,rw,"我受蝴蝶精灵之托来这里转告一个消息，那蝴蝶精灵以从和你们一样。也是海毛虫。就是通过蜕变后获得了翅膀，自由飞翔于天空。现在她托我来将这方法转告给族人,你们愿意学吗？")
			self.窗口.对话栏:文本("海毛虫","海毛虫长老","有这等好事，不知方法如何？")
			self.窗口.对话栏:文本(tx,rw,"首先要勇敢的走出这昏暗的海底，接受阳光的照耀，吸取太阳的能量，然后不断提升自身的实力，这是一个漫长的过程。当实力到达一定程度后，将会进入关键时期，此时,需更停止进食，并且作茧自缚，不能动弹。经过一段时间后,最终积力量突破茧壳，才能大功告成。")
			self.窗口.对话栏:文本("海毛虫","海毛虫长老","你一定是妖魔的化身，你说的修行之法每一条都是让我们自残，这是邪魔歪道，一定是想来害我们的。我们不相信你，也不欢迎你，你快点离开这里吧。")
			self.窗口.对话栏:文本(tx,rw,"唉，看来都不能接受，还是回去把情况告诉蝴蝶精灵吧。",nil,{[[引擎.场景:删除Npc(1,1507,"海毛虫","海毛虫长老")]],[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 8 then
			self.窗口.对话栏:文本("蝴蝶仙子","蝴蝶精灵","少侠你想做什么呢？",{"红尘试炼","我只是路过"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 9 then
			self.窗口.对话栏:文本(tx,rw,"海毛虫们都不相信你的方法，认为你是想去害他们。")
			self.窗口.对话栏:文本("蝴蝶仙子","蝴蝶精灵","这也不能怪他们，他们和我当初一样……起初我知道这个方法时，也是很怀疑，如果不是看到上仙展示的神通，我可能也不会去修炼的。我决定了，我要再次转生为和他们一样的海毛虫。",nil,{[[引擎.场景:删除Npc(1,1506,"蝴蝶仙子","蝴蝶精灵")]],[[引擎.场景:生成Npc(1,1506,83,65,"海毛虫","转生后的蝴蝶精灵",1)]],[[引擎.场景:播放特效(1506,"海毛虫","转生后的蝴蝶精灵","千里神行",0.78)]],[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 10 then
			self.窗口.对话栏:文本("蝴蝶仙子","蝴蝶精灵","我要用实际的修行之路来让他们相信我，虽然这并不轻松。毕竟,海毛虫是最低形式创造的生命，修行必定遇到很多困难；但是跟海毛虫更美好的未未相比，这种辛苦不算什么。")
			self.窗口.对话栏:文本(tx,rw,"你真伟大啊！佩服佩服，祝你顺利~",nil,{[[引擎.场景:删除Npc(1,1506,"海毛虫","转生后的蝴蝶精灵")]],[[引擎.场景:增加经验(10000,nil,true)]],[[引擎.场景:获取宝宝("海毛虫","海毛虫宝宝","宝宝")]],[[引擎.场景.提示:写入("#Y/你获得了#R/海毛虫宝宝")]],[[引擎.场景.窗口.任务栏:删除("海毛虫剧情")]]})
			self.红尘试炼 = nil
			self.梦幻指引["海毛虫剧情"] = true
			编号 = 编号 + 1
		end
	elseif 任务 == "树怪剧情" then
		if 编号 == 1 then
			self.窗口.对话栏:文本("树怪","树怪","少侠你想做什么呢？",{"红尘试炼","我只是路过"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 2 then
			self.窗口.对话栏:文本("树怪","树怪","你不该来这里。从前不该，现在不该，今后也不该。")
			self.窗口.对话栏:文本(tx,rw,"#24来又如何，不来又如何，还来又如何？！")
			self.窗口.对话栏:文本("树怪","树怪","既然来了，就随我去杀个人。")
			self.窗口.对话栏:文本(tx,rw,"你是一个杀手？")
			self.窗口.对话栏:文本("树怪","树怪","我只杀该杀之人。")
			self.窗口.对话栏:文本(tx,rw,"既然是这样，那我随你去。#74（谁叫师傅让我来帮忙呢）",nil,{[[引擎.场景:删除Npc(1,1193,"树怪","树怪")]],[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 3 then
			self.窗口.对话栏:文本("山贼","伐木之人","少侠你想做什么呢？",{"红尘试炼","我只是路过"},{"红尘试炼"},{编号1,[[引擎.场景:剧情点加入("红尘试炼",1)]]})
			编号 = 编号 + 1
		elseif 编号 == 4 then
			self.窗口.对话栏:文本("山贼","伐木之人","哟，今儿真是巧了#80正想找你弄点柴火煮下午茶呢，你倒自个儿跑来了。")
			self.窗口.对话栏:文本("树怪","树怪","是时候算一算我们的帐了。#36每日受尽你凌迟之苦，今日定要做个了断。")
			self.窗口.对话栏:文本("山贼","伐木之人","我们之间的帐有什么好算的？我要生存，就必须取柴生火。你不过是一棵树，难道还要跟我谈理想谈尊严？")
			self.窗口.对话栏:文本("树怪","树怪","你谈或者不谈理想，我都在恨你；你念或者不念尊严，都免不了一战。")
			self.窗口.对话栏:文本(tx,rw,"#35有事好好说，动手动脚多有辱斯文啊。")
			self.窗口.对话栏:文本("山贼","伐木之人","这树怪以为有人助阵就能胜过我了？#28看来得亮亮拳头，让你们在天上好好飞一会儿！",{"来就来，谁怕谁（战斗）","冷静！冷静一下！"},{"红尘试炼"})
			编号 = 编号 + 1
		elseif 编号 == 5 then
			self:删除Npc(1,1193,"山贼","伐木之人")
			self.窗口.对话栏:文本("山贼","伐木之人","真可笑，我战死的原因，居然是每天砍柴触怒了这颗老树……#64")
			self.窗口.对话栏:文本(tx,rw,"他就这样死了么#66这就是你所说的该杀之人？")
			self.窗口.对话栏:文本("树怪","树怪","从他懂事之日起，就每日对我施行凌迟之刑。我本与他无冤无仇，他凭何如此对我？！")
			self.窗口.对话栏:文本(tx,rw,"可是人为了生存，取柴生火本就是必不可少的啊！#24")
			self.窗口.对话栏:文本("树怪","树怪","天道不公！我修道万年，才有了这一副能随意走动的身躯，人却出生便有手有脚，我沐日月之辉而启灵留，人却伐我枝叶，取我花果，并以为天道既当如此。直是岂有此理！")
			self.窗口.对话栏:文本(tx,rw,"你说的这些我也不是很懂。#17天色不早，我回师父那复命去了。#51")
			self.窗口.对话栏:文本("树怪","树怪","别走，你留下来陪我吧。我孤独了上万年了，难得有个聊得来的#17")
			self.窗口.对话栏:文本(tx,rw,"不，师父在催我了……(这样孤独的活看，上万年又有多少快乐？)",nil,{[[引擎.场景:增加经验(10000,nil,true)]],[[引擎.场景:获取宝宝("树怪","树怪宝宝","宝宝")]],[[引擎.场景.提示:写入("#Y/你获得了#R/树怪宝宝")]],[[引擎.场景.窗口.任务栏:删除("树怪剧情")]]})
			self.红尘试炼 = nil
			self.梦幻指引["树怪剧情"] = true
			编号 = 编号 + 1
		end
	end
	self:领取任务(任务,编号)
end

function 引擎.场景:剧情点加入(剧情,点数)
	if 剧情 == "红尘试炼" then
		self.红尘试炼[2] = self.红尘试炼[2] + 点数
	end
end

function 引擎.场景:剧情点减少(剧情,点数)
	if 剧情 == "红尘试炼" then
		self.红尘试炼[2] = self.红尘试炼[2] - 点数
	end
end

function 引擎.场景:剧情场景加入(剧情)
	if 剧情 == "红尘试炼" then
		local 人物组,事件组 = self:获取任务事件(self.红尘试炼[1],self.红尘试炼[2])
		self.第二场景:载入显示(人物组,事件组)
	end
end

function 引擎.场景:剧情战斗(剧情,分支,编号)
	local 攻击资质;
	local 防御资质;
	local 体力资质;
	local 法力资质;
	local 速度资质;
	local 躲闪资质;
	local 属性表 = {}
	local 平均等级 = 0
	local 数量 = 0
	local 等级 = 0
	local 敌人 = {}
	if 剧情 == "红尘试炼" then
		if 分支 == "枯萎的金莲" then
			if 编号 == 16 then
				属性表 = {}
				属性表[1] = 300
				属性表[2] = 50
				属性表[3] = 70
				属性表[4] = 15
				属性表[5] = 60
				属性表[6] = 60
				敌人[1] = {"僵尸虎子","僵尸",5,2,0,0,0,0,0,0,-1,nil,nil,nil,nil,nil,nil,属性表,1}
				属性表 = {}
				属性表[1] = 300
				属性表[2] = 40
				属性表[3] = 80
				属性表[4] = 20
				属性表[5] = 70
				属性表[6] = 50
				敌人[2] = {"海边恶灵","幽灵",5,2,0,0,0,0,0,0,-1,nil,nil,nil,nil,nil,nil,属性表,1}
				属性表 = {}
				属性表[1] = 250
				属性表[2] = 70
				属性表[3] = 80
				属性表[4] = 20
				属性表[5] = 70
				属性表[6] = 70
				敌人[3] = {"海边妖怪","骷髅怪",5,2,0,0,0,0,0,0,-1,nil,nil,{"高级鬼魂术"},nil,nil,nil,属性表,1}
			end
		elseif 分支 == "商人的鬼魂" then
			if 编号 == 22 then
				属性表 = {}
				属性表[1] = 1200
				属性表[2] = 80
				属性表[3] = 60
				属性表[4] = 20
				属性表[5] = 80
				属性表[6] = 80
				敌人[1] = {"商人的鬼魂","野鬼",5,2,0,0,0,0,0,0,-1,nil,nil,nil,nil,nil,nil,属性表,1}
				属性表 = {}
				属性表[1] = 600
				属性表[2] = 50
				属性表[3] = 80
				属性表[4] = 20
				属性表[5] = 50
				属性表[6] = 80
				敌人[2] = {"恶灵","幽灵",5,2,0,0,0,0,0,0,-1,nil,nil,nil,nil,nil,nil,属性表,1}
				属性表 = {}
				属性表[1] = 600
				属性表[2] = 60
				属性表[3] = 70
				属性表[4] = 25
				属性表[5] = 50
				属性表[6] = 70
				敌人[3] = {"恶鬼","骷髅怪",5,2,0,0,0,0,0,0,-1,nil,nil,{"高级鬼魂术"},nil,nil,nil,属性表,1}
				属性表 = {}
				属性表[1] = 300
				属性表[2] = 60
				属性表[3] = 70
				属性表[4] = 25
				属性表[5] = 50
				属性表[6] = 80
				敌人[4] = {"蟹将喽啰","蟹将",5,2,0,0,0,0,0,0,-1,nil,nil,{"水攻"},nil,nil,nil,属性表,1}
				属性表 = {}
				属性表[1] = 300
				属性表[2] = 60
				属性表[3] = 90
				属性表[4] = 15
				属性表[5] = 40
				属性表[6] = 40
				敌人[5] = {"虾兵喽啰","虾兵",5,2,0,0,0,0,0,0,-1,nil,nil,{"连击"},nil,nil,nil,属性表,1}
			elseif 编号 == 25 then
				属性表 = {}
				属性表[1] = 2000
				属性表[2] = 150
				属性表[3] = 100
				属性表[4] = 40
				属性表[5] = 100
				属性表[6] = 100
				敌人[1] = {"妖风","吸血鬼",5,2,0,0,0,0,0,0,-1,96,{1,1},nil,nil,nil,nil,属性表,1}
			end
		elseif 分支 == "树怪剧情" then
			if 编号 == 4 then
				敌人[1] = {"伐木之人","山贼",5,2,0,0,0,0,0,0,-1,nil,nil,{"连击"},nil,nil,nil,self:战斗数据(0,10,2,20,{"无门派",0,10,{3,1,2,1,4,1}}),1}
			end
		end
	end
	self.场景.战斗:进入战斗(敌人,{"红尘试炼",分支,编号},true)
end