--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2020-10-07 14:57:54
--======================================================================--
function 引擎.场景:获取任务事件(任务,编号)
	local 人物组 = {}
	local 事件组 = {}
	if 任务 == "枯萎的金莲" then
		if 编号 == 15 then
			人物组 = {{名称="云游神医",模型="男人_村长",X=85,Y=108,方向=0,编号=1},{主角=true,X=87.3,Y=110.9,方向=2,编号=2},{名称="僵尸虎子",模型="僵尸",X=93,Y=115.5,方向=2,编号=3,不允许加入=true},{名称="迷惘幽灵",模型="幽灵",X=91,Y=118,方向=2,编号=4,不允许加入=true}}
			事件组 = {
				[1]={[[引擎.场景.第二场景:加入喊话(5,1,"虎子就在你身后嘛",9999)]],[[引擎.场景.第二场景:加入喊话(5,2,"#117",9999)]],[[引擎.场景.第二场景:置人物方向(30,2,0)]],[[引擎.场景.第二场景:置入人物(45,{3,4},{"水遁","水遁"})]],[[引擎.场景.第二场景:加入喊话(65,2,"怎么会这样！",9999)]],[[引擎.场景.第二场景:加进度(70,1)]]},
				[2]={[[引擎.场景.第二场景:加入文本(10,nil,"虎子居然变成僵尸了，糟了，他们要扑上来了！")]]}
			}
		elseif 编号 == 28 then
			人物组 = {{名称="观音姐姐",模型="观音姐姐1",X=56,Y=39,方向=0,编号=1},{主角=true,模型=self.队伍[1].模型.."坐下",X=61.5,Y=37,方向=1,编号=2,最后帧方式=2},{名称="僵尸虎子",模型="僵尸倒地",X=61.3,Y=42.4,方向=0,编号=3,最后帧方式=1}}
			事件组 = {
				[1]={[[引擎.场景.第二场景:加入喊话(5,1,"唵嘛呢叭咪吽！",9999)]],[[引擎.场景.第二场景:加入特效(8,3,"坐莲")]],[[引擎.场景.第二场景:置人物模型(10,3,"僵尸")]],[[引擎.场景.第二场景:置人物帧行为(10,3,0)]],[[引擎.场景.第二场景:加入喊话(11,3,"呜哇！！！！！",50)]],[[引擎.场景.第二场景:置人物模型(40,3,"赌徒倒地")]],[[引擎.场景.第二场景:置人物名称(40,3,"虎子")]],[[引擎.场景.第二场景:置人物帧行为(40,3,2)]],[[引擎.场景.第二场景:加进度(45,1)]]},
				[2]={[[引擎.场景.第二场景:删除喊话()]],[[引擎.场景.第二场景:加入文本(50,"观音姐姐","此人已无大碍。少侠既已金莲结缘，便请听我一言。")]],[[引擎.场景.第二场景:加入文本(50,"观音姐姐","此金莲便是如今的‘人性’。五百年前，孙悟空大闹天宫引发三界混战之后，心魔肆虐，尘世中人性的莲花已经枯萎。")]],[[引擎.场景.第二场景:加入文本(50,"观音姐姐","我佛如来处有三藏真经，可以劝人为善。待要令我送上东土，只怕众生愚言，毁谤真言，故广募与佛有缘之侠者，遍大义于天下，寻找五个天命取经人。")]],[[引擎.场景.第二场景:加入文本(50,"观音姐姐","还希望你今后在四大部洲游历的时候能够留心寻找五人，帮他们拂开尘眼，见性归真，甘愿苦历千山，远经万水，到佛祖处求取真经，劝化众生，化解千年冤戾。")]]}
			}
		end
	end
	return 人物组,事件组
end
