local 场景类_取经图鉴 = class()

local tp
local insert = table.insert
local mouseb = 引擎.鼠标弹起
local 按钮,zt,zt1,资源
local 图鉴列表={"金  箍  儿","锦斓  袈裟","九齿  钉耙","多  心  经","人  参  果","紫金红葫芦","幌  金  绳","金  刚  琢","芭  蕉  扇","金      铙","紫  金  铃","阴阳二气瓶"}
local 真图鉴列表={"金箍儿","锦斓袈裟","九齿钉耙","多心经","人参果","紫金红葫芦","幌金绳","金刚琢","芭蕉扇","金铙","紫金铃","阴阳二气瓶"}
local 图鉴主人={"孙悟空","唐三藏","猪八戒","乌巢禅师","镇元子","太上老君","太上老君","太上老君","铁扇公主","弥勒佛","观音菩萨","大鹏金翅雕"}
local 图片编号={0x00000032,0x00000034,0x00000036,0x00000038,0x00000040,0x00000042,0x00000044,0x00000046,0x00000048,0x00000049,0x00000051,0x00000053}
local 图鉴属性={
金箍儿={"封印抵抗","封印命中"},
锦斓袈裟={"生    命","防    御"},
九齿钉耙={"波动下限","波动上限"},
多心经={"破    邪","静    心"},
人参果={"长    生","道    行"},
紫金红葫芦={"言    灵","言    法"},
幌金绳={"护    身","束    缚"},
金刚琢={"重    击","套    取"},
芭蕉扇={"风    灵","速    度"},
金铙={"坚    牢","自    困"},
紫金铃={"命    中","躲    避"},
阴阳二气瓶={"伤    害","灵    力"}
}
local 真图鉴属性={
金箍儿={"封印抵抗","封印命中",3,2},
锦斓袈裟={"气血","防御",80,30},
九齿钉耙={"波动下限","波动上限",1,2},
多心经={"破邪","静心",3,2},
人参果={"长生","道行",30,0},
紫金红葫芦={"言灵","言法",0,5},
幌金绳={"护身","束缚",2,1},
金刚琢={"重击","套取",2,3},
芭蕉扇={"风灵","速度",3,30},
金铙={"坚牢","自困",1,3},
紫金铃={"命中","躲避",30,20},
阴阳二气瓶={"伤害","灵力",30,30}
}
local 技能编号1={0x000bbb96,0x000bbb98,nil,nil,nil,0x00bbb100,nil,nil,0x00bbb102,nil,0x00bbb104,0x00bbb106}
local 技能编号2={0x000bbb97,0x000bbb99,nil,nil,nil,0x00bbb101,nil,nil,0x00bbb103,nil,0x00bbb105,0x00bbb107}
local 技能介绍1={
	"#R金箍\n\n#G已激活\n对单个目标施加金箍封印,使其无法使用技能,并每回合受到一定伤害\n冷却5回合",
	"#Y水火不侵\n\n#G已激活\n#C被动生效\n受到水系和火系法术伤害时会减免20%",
	"","","",
	"#R言出法随\n\n#G已激活\n对单个目标造成一次最大生命值相关的固定伤害,并附加言出法随效果,若持续回合超过3则会使目标进入禁言状态,无法释放任何法术\n冷却5回合",
	"","",
	"#R狂风大作\n\n#G已激活\n对6个目标造成一次法术伤害,并为自己添加御风状态,此状态下在进行风灵波动时,即便速度低于目标也视作高于\n冷却5回合",
	"",
	"#R摇晃\n\n未激活\n在'出火''生烟''飞沙走石'三种效果中,随机释放一种技能\n出火:单体攻击目标,造成大量法术伤害\n生烟:单体攻击目标,造成少量法术伤害,但会大幅度降低目标的命中属性\n飞砂走石:群体攻击4个目标,造成法术伤害\n冷却5回合",
	"#阴阳二气\n\n#G已激活\n对单个目标添加阴阳二气状态,此状态下释放防御之外的任何指令必定立即受到伤害\n冷却8回合"
}
local 技能介绍2={
	"#R金箍\n\n未激活\n对单个目标施加金箍封印,使其无法使用技能,并每回合受到一定伤害\n冷却5回合","#Y水火不侵\n\n未激活\n#C被动生效\n受到水系和火系法术伤害时会减免20%",
	"","","",
	"#R言出法随\n\n未激活\n对单个目标造成一次最大生命值相关的固定伤害,并附加言出法随效果,若持续回合超过3则会使目标进入禁言状态,无法释放任何法术\n冷却5回合",
	"","",
	"#R狂风大作\n\n未激活\n对6个目标造成一次法术伤害,并为自己添加御风状态,此状态下在进行风灵波动时,即便速度低于目标也视作高于\n冷却5回合",
	"",
	"#R摇晃\n\n未激活\n在'出火''生烟''飞沙走石'三种效果中,随机释放一种技能\n出火:单体攻击目标,造成大量法术伤害\n生烟:单体攻击目标,造成少量法术伤害,但会大幅度降低目标的命中属性\n飞砂走石:群体攻击4个目标,造成法术伤害\n冷却5回合",
	"#R阴阳二气\n\n未激活\n对单个目标添加阴阳二气状态,此状态下释放防御之外的任何指令必定立即受到伤害\n冷却8回合"
}
function 场景类_取经图鉴:初始化(根)
	self.ID = 118
	self.x = 60
	self.y = 60
	self.xx = 0
	self.yy = 0
	self.注释 = "取经图鉴"
	self.可视 = false
	self.鼠标 = false
	self.焦点 = false
	self.可移动 = true
	tp=根
	资源 = 根.资源
	local 自适应 = tp._自适应
	按钮 = 根._按钮

	self.背景=资源:载入('wpal/121.wpal',"网易WDF动画",0x000bbb83)
	self.资源组={}
	local 编号={0x000bbb84,0x000bbb85,0x000bbb86,0x000bbb87,0x000bbb88,0x000bbb89,0x000bbb90,0x000bbb91,0x000bbb92,0x000bbb93,0x000bbb94,0x000bbb95}
	for i=1,12 do
		self.资源组[i]=按钮.创建(资源:载入('wpal/121.wpal',"网易WDF动画",编号[i]),0,0,5,true,true)
	end
	self.资源组[13] = 按钮.创建(自适应.创建(20,4,18,19,4,3),0,0,4,true,true)
	self.资源组[14] = 按钮.创建(自适应.创建(21,4,18,19,4,3),0,0,4,true,true)
	self.升级图鉴=按钮.创建(资源:载入('wpal/121.wpal',"网易WDF动画",0x0000BB33),0,0,3,true,true)
	self.图鉴参战=按钮.创建(资源:载入('wpal/121.wpal',"网易WDF动画",0x0000BB33),0,0,3,true,true)
	self.窗口时间 = 0
	self.选中=0
	zt=tp.字体表.标题字体
	zt1=tp.字体表.小号字体
end

function 场景类_取经图鉴:打开()
	if self.可视 then
		self.可视 = false
		self.选中=0
		self.加入 = 0
	else
		insert(tp.窗口_,self)
		tp.运行时间 = tp.运行时间 + 1
		self.窗口时间 = tp.运行时间
		self.可视 = true
		self.翻页数据 = math.floor(#真图鉴列表/8)
		self.选中=1
		self.加入 = 0
	end
end

function 场景类_取经图鉴:刷新(内容)
	tp.队伍[1].取经之路=内容.取经数据
end

function 场景类_取经图鉴:显示(dt,x,y)
	self.焦点 = false
	self.背景:更新(x,y)
	self.背景:显示(self.x ,self.y )
	if self.选中==0 then
	    self.选中=1
	end
	if self.资源组[13]:事件判断() then
		if self.加入 >0 then
			self.加入 = self.加入 -1
		end
	elseif self.资源组[14]:事件判断() then
		if self.加入 < self.翻页数据 then
			self.加入 = self.加入 + 1
		end
	end
	for i=1,8 do
		if 图鉴列表[i+self.加入*8]~=nil then
			if self.资源组[i+self.加入*8]:事件判断() then
				self.选中=i+self.加入*8
			end
			self.资源组[i+self.加入*8]:更新(x,y,self.选中 ~= i+self.加入*8)
			self.资源组[i+self.加入*8]:显示(self.x+70,self.y+28+i*35)
		end
	end
	if self.选中~=0 then
	    self.资源组[13]:更新(x,y,self.加入>0)
		self.资源组[14]:更新(x,y,self.加入<self.翻页数据)
		self.资源组[13]:显示(self.x+152,self.y+60)
		self.资源组[14]:显示(self.x+152,self.y+314)
		self.升级图鉴:更新(x,y)
		self.图鉴参战:更新(x,y)
		self.预览图=资源:载入('item.wd11',"网易WDF动画",图片编号[self.选中])
		self.预览图:更新(x,y)
	    self.升级图鉴:显示(self.x+205 ,self.y+300 )
		self.升级图鉴:置文字("升级图鉴")
		self.图鉴参战:显示(self.x+300 ,self.y+300 )
		self.图鉴参战:置文字("参    战")
		zts:置颜色(蓝色)
		local 图鉴名称=图鉴列表[self.选中]
		zts:显示(self.x+460,self.y+86,""..图鉴名称.."")
		local 真图鉴名称=真图鉴列表[self.选中]
		local 等级=tp.队伍[1].取经之路.图鉴[真图鉴名称].等级
		if self.选中==1 or self.选中==2 or self.选中==6 or self.选中==9 or self.选中==11 or self.选中==12 then
		    if tp.队伍[1].取经之路.图鉴[真图鉴名称].技能激活 then
		    	self.技能图标=资源:载入('wpal/121.wpal',"网易WDF动画",技能编号1[self.选中])
		    else
		    	self.技能图标=资源:载入('wpal/121.wpal',"网易WDF动画",技能编号2[self.选中])
		    end
		    self.技能图标:更新(x,y)
		    self.技能图标:显示(self.x+340,self.y+78)
		end
		if self.技能图标:是否选中(x,y) then
			if tp.队伍[1].取经之路.图鉴[真图鉴名称].技能激活 then
				tp.提示:自定义(x-42,y+27,""..技能介绍1[self.选中].."")
			else
				tp.提示:自定义(x-42,y+27,""..技能介绍2[self.选中].."")
			end
		end
		zts:置颜色(黑色)
		zts:显示(self.x+498,self.y+123,""..图鉴主人[self.选中].."")
		zts:显示(self.x+515,self.y+164,""..等级.."")
		if self.选中==9 then
			self.预览图:显示(self.x+235,self.y+100)
		elseif self.选中==10 then
			self.预览图:显示(self.x+195,self.y+110)
		else
			self.预览图:显示(self.x+235,self.y+80)
		end
		local 传承数量=等级*2
		local 银两消耗=math.modf((50000+等级*13333-8900)*5)
		local 经验消耗=math.modf((50900+等级*19933-8900)*5)
		zts:显示(self.x+500,self.y+202,""..传承数量.."/"..tp.队伍[1].取经之路.传承碎片.."")
		zts:显示(self.x+500,self.y+240,""..银两消耗.."")
		zts:显示(self.x+500,self.y+278,""..经验消耗.."")
		zts:置颜色(白色)
		zts:显示(self.x+218,self.y+215,""..图鉴属性[真图鉴名称][1].."")
		zts:显示(self.x+218,self.y+253,""..图鉴属性[真图鉴名称][2].."")
		local 图鉴属性1=真图鉴属性[真图鉴名称][1]
		local 图鉴属性2=真图鉴属性[真图鉴名称][2]
		zts:置颜色(绿色)
		if 图鉴属性1=="言灵" then
			if 等级>=9 then
				zts:显示(self.x+306,self.y+215,"3  6  9")
			elseif 等级>=6 then
				zts:显示(self.x+306,self.y+215,"3  6")
			elseif 等级>=3 then
				zts:显示(self.x+306,self.y+215,"3")
			else
				zts:显示(self.x+306,self.y+215,"无")
			end
		else
			zts:显示(self.x+306,self.y+215,""..tp.队伍[1].取经之路.图鉴[真图鉴名称][图鉴属性1].."")
		end

		zts:显示(self.x+306,self.y+253,""..tp.队伍[1].取经之路.图鉴[真图鉴名称][图鉴属性2].."")
		if self.升级图鉴:事件判断() then
		    发送数据(106.60,{名称=真图鉴名称,数量=传承数量,银两=银两消耗,经验=经验消耗,属性1=图鉴属性1,属性2=图鉴属性2,属性数值1=真图鉴属性[真图鉴名称][3],属性数值2=真图鉴属性[真图鉴名称][4]})
		elseif self.图鉴参战:事件判断() then
			发送数据(107.70,{名称=真图鉴名称})
		end
	end
end

function 场景类_取经图鉴:检查点(x,y)
	if self.背景:是否选中(x,y)  then
		return true
	end
end

function 场景类_取经图鉴:初始移动(x,y)
	tp.运行时间 = tp.运行时间 + 1
	if not tp.消息栏焦点 then
		self.窗口时间 = tp.运行时间
	end
	if not self.焦点 then
		tp.移动窗口 = true
	end
	if self.鼠标 and  not self.焦点 then
		self.xx = x - self.x
		self.yy = y - self.y
	end
end

function 场景类_取经图鉴:开始移动(x,y)
	if self.鼠标 then
		self.x = x - self.xx
		self.y = y - self.yy
	end
end

return 场景类_取经图鉴