local 场景类_取经之路 = class()

local tp,zt
local insert = table.insert
local mouseb = 引擎.鼠标弹起
local 按钮
local 劫难提示={
"#G第一劫:陷虎穴金星解厄\n\n击败寅将军、特处士、熊山君以及一众小妖\n\n可获得100000点经验\n可获得10000两银子\n可获得传承碎片*5",
"#G第二劫:心猿归正,六贼无踪\n\n击败孙悟空六意化成的山贼\n\n可获得150000点经验\n可获得20000两银子\n解锁图鉴#S金箍儿#S",
"#G第三劫:鹰愁涧意马收缰\n\n击败吃掉唐僧白马的三太子敖烈\n\n可获得200000点经验\n可获得30000两银子\n可获得传承碎片*5",
"#G第四劫:黑风山怪窃袈裟\n\n击败偷走袈裟的黑熊精以及一众小妖\n\n可获得250000点经验\n可获得40000两银子\n解锁图鉴#S锦斓袈裟#S",
"#G第五劫:云栈洞悟空收八戒\n\n击败猪八戒\n\n可获得300000点经验\n可获得50000两银子\n解锁图鉴#S九齿钉耙#S",
"#G第六劫:浮屠山玄奘受心经\n\n通过乌巢禅师的考验\n\n可获得350000点经验\n可获得60000两银子\n解锁图鉴#S多心经#S",
"#G第七劫:黄风岭唐僧有难\n\n击败黄风怪以及一众小妖\n\n可获得400000点经验\n可获得70000两银子\n可获得传承碎片*5",
"#G第八劫:木叉奉法收悟净\n\n击败沙悟净\n\n可获得450000点经验\n可获得80000两银子\n可获得传承碎片*5",
"#G第九劫:孙行者大闹五庄观\n\n击败镇元大仙以及一众道童\n\n可获得500000点经验\n可获得90000两银子\n解锁图鉴#S人参果#S",
"#G第十劫:尸魔三戏唐三藏\n\n击败白骨精\n白骨精需要先和三个化身战斗,最后才会出现尸魔真身\n\n可获得550000点经验\n可获得100000两银子\n可获得传承碎片*8",
"#G第十一劫:孙行者智降妖怪\n\n击败黄袍怪以及一众小妖\n\n可获得600000点经验\n可获得110000两银子\n可获得传承碎片*8",
"#G第十二劫:莲花洞木母逢灾\n\n击败金角大王、银角大王以及一众小妖\n\n可获得650000点经验\n可获得120000两银子\n随机解锁图鉴#S紫金红葫芦#S、#S幌金绳#S",
"#G第十三劫:悟空神化引婴儿\n\n击败青毛狮子\n\n可获得700000点经验\n可获得130000两银子\n可获得传承碎片*8",
"#G第十四劫:猿马刀归木母空\n\n击败红孩儿以及一众小妖\n\n可获得750000点经验\n可获得140000两银子\n可获得传承碎片*8",
"#G第十五劫:黑河妖孽擒僧去\n\n击败鼍龙以及一众小妖\n\n可获得800000点经验\n可获得150000两银子\n可获得传承碎片*8",
"#G第十六劫:心猿显圣灭诸邪\n\n击败虎力大仙、鹿力大仙、羊力大仙\n\n可获得850000点经验\n可获得160000两银子\n可获得传承碎片*8",
"#G第十七劫:圣僧夜阻通天水\n\n击败灵感大王、斑衣鳜婆以及一众小妖\n\n可获得900000点经验\n可获得170000两银子\n可获得传承碎片*8",
"#G第十八劫:悟空大闹金兜洞\n\n击败独角兕以及一众小妖\n\n可获得950000点经验\n可获得180000两银子\n解锁图鉴#S金刚琢#S",
"#G第十九劫:色邪淫戏唐三藏\n\n击败蝎子精以及一众小妖\n\n可获得1000000点经验\n可获得190000两银子\n可获得传承碎片*12",
"#G第二十劫:唐三藏路阻火焰山\n\n击败牛魔王、铁扇公主、玉面公主\n\n可获得1050000点经验\n可获得200000两银子\n解锁图鉴#S芭蕉扇#S",
"#G第二十一劫:二僧荡怪闹龙宫\n\n击败九头虫以及一众小妖\n\n可获得1100000点经验\n可获得210000两银子\n可获得传承碎片*12",
"#G第二十二劫:木仙庵三藏谈诗\n\n击败十八公、孤直公、凌空子、拂云叟、赤身鬼、杏仙、丹桂精、腊梅精\n\n可获得1150000点经验\n可获得220000两银子\n可获得传承碎片*12",
"#G第二十三劫:妖邪假设小雷音\n\n击败黄眉怪以及一众小妖\n\n可获得1200000点经验\n可获得230000两银子\n解锁图鉴#S金铙#S",
"#G第二十四劫:拯救驼罗禅性稳\n\n击败红鳞大蟒以及一众小妖\n\n可获得1250000点经验\n可获得240000两银子\n可获得传承碎片*12",
"#G第二十五劫:悟空计盗紫金铃\n\n击败赛太岁以及一众小妖\n\n可获得1300000点经验\n可获得250000两银子\n解锁图鉴#S紫金铃#S",
"#G第二十六劫:盘丝洞七情迷本\n\n击败七只蜘蛛精、蜈蚣精\n\n可获得1350000点经验\n可获得260000两银子\n可获得传承碎片*12",
"#G第二十七劫:群魔欺本性,一体拜真如\n\n击败青毛狮子、六牙白象、金翅大鹏以及一众小妖\n\n可获得1400000点经验\n可获得270000两银子\n解锁图鉴#S阴阳二气瓶#S",
"#G第二十八劫:寻洞擒妖逢老寿\n\n击败白鹿精、白面狐狸\n\n可获得1450000点经验\n可获得280000两银子\n可获得传承碎片*12",
"#G第二十九劫:心猿护主识妖邪\n\n击败地涌夫人以及一众小妖\n\n可获得1500000点经验\n可获得290000两银子\n可获得传承碎片*18",
"#G第三十劫:金公施法灭妖邪\n\n击败花皮豹子精以及一众小妖\n\n可获得1550000点经验\n可获得300000两银子\n可获得传承碎片*18",
"#G第三十一劫:师狮授受同归一\n\n击败九灵元圣、黄狮精以及一众小妖\n\n可获得1600000点经验\n可获得310000两银子\n可获得传承碎片*18",
"#G第三十二劫:三僧大战青龙山\n\n击败辟寒大王、辟暑大王、辟尘大王以及一众小妖\n\n可获得1650000点经验\n可获得320000两银子\n可获得传承碎片*18",
"#G第三十三劫:假合真形擒玉兔\n\n击败玉兔精\n\n可获得1700000点经验\n可获得330000两银子\n可获得传承碎片*18",
"#G九九归一,终成正果\n\n可获得5000000点经验\n可获得1000000两银子\n可获得传承碎片*50"
}
function 场景类_取经之路:初始化(根)
	self.ID = 118
	self.x = 60
	self.y = 60
	self.xx = 0
	self.yy = 0
	self.注释 = "取经之路"
	self.可视 = false
	self.鼠标 = false
	self.焦点 = false
	self.可移动 = true
	local 资源 = 根.资源
	local 自适应 = 根._自适应
	按钮 = 根._按钮
	self.背景=资源:载入('wpal/121.wpal',"网易WDF动画",0x000bbb78)
	self.资源组={}
	for i=1,34 do
		self.资源组[i]=按钮.创建(资源:载入('wpal/121.wpal',"网易WDF动画",0x000bbb79),0,0,4,true,true)
	end
	self.图鉴按钮=按钮.创建(资源:载入('wpal/121.wpal',"网易WDF动画",0x000bbb81),0,0,3,true,true)
	self.动画 = 资源:载入('wzife.wdf',"网易WDF动画",0x16CC1B46)
	self.窗口时间 = 0
	tp = 根
	zt=tp.字体表.标题字体
end

function 场景类_取经之路:打开()
	if self.可视 then
		self.可视 = false
	else
		insert(tp.窗口_,self)
		tp.运行时间 = tp.运行时间 + 1
		self.窗口时间 = tp.运行时间
		self.可视 = true
	end
end

function 场景类_取经之路:刷新(内容)
	tp.队伍[1].取经之路.进度=内容.关卡
	for i=1,34 do
		self.资源组[i]:更新(x,y)
	end
end

function 场景类_取经之路:显示(dt,x,y)
	self.背景:更新(x,y)
	self.背景:显示(self.x ,self.y )
	self.图鉴按钮:更新(x,y)
	self.动画:更新(dt)
	for i=1,34 do
		self.资源组[i]:更新(x,y)
		if self.资源组[i]:是否选中(x,y) then
			tp.提示:自定义(x-42,y+27,""..劫难提示[i].."")
		end
		if self.资源组[i]:事件判断() then
			发送数据(104.4,{进程=i})
		end
	end
	if self.图鉴按钮:事件判断() then
		self:打开()
		发送数据(105.5)
		tp.窗口.取经图鉴:打开()
	end
	self.焦点 = false
	self.动画:显示(self.x+450,self.y+330)
	self.图鉴按钮:显示(self.x+220,self.y+310)
	self.图鉴按钮:置文字("打  开  图  鉴")
	zts:显示(self.x+318,self.y+244,"暂无")
	zts:显示(self.x+318,self.y+278,"暂无")
	self.图鉴按钮:置偏移(13,6)
	self.资源组[1]:显示(self.x+142,self.y+55,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 0,4)
	self.资源组[2]:显示(self.x+222,self.y+55,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 1,4)
	self.资源组[3]:显示(self.x+302,self.y+55,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 2,4)
	self.资源组[4]:显示(self.x+373,self.y+55,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 3,4)
	self.资源组[5]:显示(self.x+455,self.y+55,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 4,4)
	self.资源组[6]:显示(self.x+532,self.y+55,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 5,4)
	self.资源组[7]:显示(self.x+606,self.y+55,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 6,4)
	self.资源组[8]:显示(self.x+606,self.y+135,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 7,4)
	self.资源组[9]:显示(self.x+606,self.y+188,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 8,4)
	self.资源组[10]:显示(self.x+606,self.y+265,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 9,4)
	self.资源组[11]:显示(self.x+606,self.y+338,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 10,4)
	self.资源组[12]:显示(self.x+606,self.y+422,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 11,4)
	self.资源组[13]:显示(self.x+486,self.y+425,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 12,4)
	self.资源组[14]:显示(self.x+389,self.y+425,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 13,4)
	self.资源组[15]:显示(self.x+283,self.y+425,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 14,4)
	self.资源组[16]:显示(self.x+180,self.y+425,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 15,4)
	self.资源组[17]:显示(self.x+63,self.y+425,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 16,4)
	self.资源组[18]:显示(self.x+63,self.y+350,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 17,4)
	self.资源组[19]:显示(self.x+63,self.y+256,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 18,4)
	self.资源组[20]:显示(self.x+63,self.y+183,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 19,4)
	self.资源组[21]:显示(self.x+75,self.y+112,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 20,4)
	self.资源组[22]:显示(self.x+197,self.y+108,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 21,4)
	self.资源组[23]:显示(self.x+327,self.y+108,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 22,4)
	self.资源组[24]:显示(self.x+433,self.y+108,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 23,4)
	self.资源组[25]:显示(self.x+518,self.y+108,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 24,4)
	self.资源组[26]:显示(self.x+528,self.y+188,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 25,4)
	self.资源组[27]:显示(self.x+528,self.y+260,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 26,4)
	self.资源组[28]:显示(self.x+528,self.y+348,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 27,4)
	self.资源组[29]:显示(self.x+428,self.y+368,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 28,4)
	self.资源组[30]:显示(self.x+328,self.y+368,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 29,4)
	self.资源组[31]:显示(self.x+230,self.y+368,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 30,4)
	self.资源组[32]:显示(self.x+157,self.y+322,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 31,4)
	self.资源组[33]:显示(self.x+157,self.y+222,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 32,4)
	--self.资源组[34]:显示(self.x+266,self.y+173,true,nil,nil,tp.队伍[1].取经之路.进度 ~= 33,4)
end

function 场景类_取经之路:检查点(x,y)
	if self.背景:是否选中(x,y)  then
		return true
	end
end

function 场景类_取经之路:初始移动(x,y)
	tp.运行时间 = tp.运行时间 + 1
	if not tp.消息栏焦点 then
		self.窗口时间 = tp.运行时间
	end
	if not self.焦点 then
		tp.移动窗口 = true
	end
	if self.鼠标 and  not self.焦点 then
		self.xx = x - self.x
		self.yy = y - self.y
	end
end

function 场景类_取经之路:开始移动(x,y)
	if self.鼠标 then
		self.x = x - self.xx
		self.y = y - self.yy
	end
end

return 场景类_取经之路