--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19//

--======================================================================--
local 场景类_场景 = class()
local ceil = math.ceil
local floor = math.floor
local sort = table.sort
local require = require
local pairs = pairs
local insert = table.insert
local txk = 引擎.特效库
local mousea = 引擎.鼠标按下
local mouseb = 引擎.鼠标弹起
local ARGB = ARGB
local type = type
local remove = table.remove
local xys = 生成XY
local 假人最终库 = require('script/全局/假人')

function 强化技能消耗(等级, 名称)
    local 经验 = 100000000 * (1 + 等级 / 10)
    local 银子 = 50000000 * (1 + 等级 / 10)
    return {经验 = 经验, 金钱 = 银子}
end

function 强化技能消耗1(目标技能等级)
    local cc = 0
    local vv = 0
    local 等级 = 目标技能等级
    if 等级 > 0 and 等级 <= 2 then
        cc = 8 * (目标技能等级 + 1) * 目标技能等级
    elseif 等级 > 2 and 等级 <= 5 then
        cc = 8 * (目标技能等级 + 1) * 目标技能等级 + 2 ^ 目标技能等级
    elseif 等级 > 5 and 等级 <= 11 then
        cc = 目标技能等级 * 目标技能等级 * (目标技能等级 + 5)
    elseif 等级 > 11 and 等级 <= 18 then
        cc = 目标技能等级 * (目标技能等级 + 1) * 10 * (1.625 + (目标技能等级 - 12) * 0.2)
    elseif 等级 > 18 and 等级 <= 25 then
        cc = 目标技能等级 * (目标技能等级 + 10) * 10 * (2.37 + (目标技能等级 - 19) * 0.25)
    elseif 等级 > 25 and 等级 <= 31 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (94.3 + (目标技能等级 - 26) * 5.5)
    elseif 等级 > 25 and 等级 <= 31 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (94.3 + (目标技能等级 - 26) * 5.5)
    elseif 等级 > 31 and 等级 <= 40 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (130.22 + (目标技能等级 - 32) * 8)
    elseif 等级 > 40 and 等级 <= 50 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (207.4 + (目标技能等级 - 41) * 11)
    elseif 等级 > 50 and 等级 <= 60 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (329.41 + (目标技能等级 - 51) * 16)
    elseif 等级 > 60 and 等级 <= 70 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (495.2 + (目标技能等级 - 61) * 21)
    elseif 等级 > 70 and 等级 <= 80 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (710.93 + (目标技能等级 - 71) * 26)
    elseif 等级 > 80 and 等级 <= 90 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (982.9 + (目标技能等级 - 81) * 33)
    elseif 等级 > 90 and 等级 <= 100 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (1317.47 + (目标技能等级 - 91) * 39)
    elseif 等级 > 100 and 等级 <= 110 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (1720.997 + (目标技能等级 - 101) * 47)
    elseif 等级 > 110 and 等级 <= 120 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (2199.87 + (目标技能等级 - 111) * 55)
    elseif 等级 > 120 and 等级 <= 130 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (2760.33 + (目标技能等级 - 121) * 64)
    elseif 等级 > 130 and 等级 <= 140 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (3409.09 + (目标技能等级 - 131) * 73)
    elseif 等级 > 140 and 等级 <= 150 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (4152.37 + (目标技能等级 - 141) * 83)
    elseif 等级 > 150 and 等级 <= 155 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (5152.78 + (目标技能等级 - 151) * 247)
    elseif 等级 > 155 and 等级 <= 160 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (6557.72 + (目标技能等级 - 156) * 417)
    elseif 等级 > 160 and 等级 <= 170 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (8739.79 + (目标技能等级 - 161) * 503)
    elseif 等级 > 170 and 等级 <= 174 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (13980.32 + (目标技能等级 - 171) * 707)
    elseif 等级 > 174 and 等级 <= 179 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (16804.73 + (目标技能等级 - 175) * 918)
    elseif 等级 > 179 then
        cc = 660382434
    end
    if 等级 > 0 and 等级 <= 3 then
        vv = 3 * (目标技能等级 + 1) * 目标技能等级
    elseif 等级 > 3 and 等级 <= 9 then
        vv = (目标技能等级 + 1) * 目标技能等级 * (3.25 + (目标技能等级 - 4) * 0.25)
    elseif 等级 > 9 and 等级 <= 16 then
        vv = (目标技能等级 - 5) * 目标技能等级 * (11.12 + (目标技能等级 - 10) * 0.4)
    elseif 等级 > 16 and 等级 <= 20 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (24.91 + (目标技能等级 - 17) * 0.55)
    elseif 等级 > 20 and 等级 <= 30 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (27.73 + (目标技能等级 - 21) * 1.7)
    elseif 等级 > 30 and 等级 <= 40 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (46.24 + (目标技能等级 - 31) * 3)
    elseif 等级 > 40 and 等级 <= 50 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (77.75 + (目标技能等级 - 41) * 4.4)
    elseif 等级 > 50 and 等级 <= 60 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (123.51 + (目标技能等级 - 51) * 6)
    elseif 等级 > 60 and 等级 <= 70 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (185.69 + (目标技能等级 - 61) * 7.8)
    elseif 等级 > 70 and 等级 <= 80 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (266.59 + (目标技能等级 - 71) * 10)
    elseif 等级 > 80 and 等级 <= 90 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (368.58 + (目标技能等级 - 81) * 12.3)
    elseif 等级 > 90 and 等级 <= 100 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (494.04 + (目标技能等级 - 91) * 14.8)
    elseif 等级 > 100 and 等级 <= 110 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (645.36 + (目标技能等级 - 101) * 17.6)
    elseif 等级 > 110 and 等级 <= 120 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (824.94 + (目标技能等级 - 111) * 20.65)
    elseif 等级 > 120 and 等级 <= 130 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (1035.17 + (目标技能等级 - 121) * 24)
    elseif 等级 > 130 and 等级 <= 140 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (1278.45 + (目标技能等级 - 131) * 27.5)
    elseif 等级 > 140 and 等级 <= 150 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (1557.17 + (目标技能等级 - 141) * 31.3)
    elseif 等级 > 150 and 等级 <= 155 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (1932.32 + (目标技能等级 - 151) * 92.6)
    elseif 等级 > 155 and 等级 <= 160 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (2459.17 + (目标技能等级 - 156) * 156.3)
    elseif 等级 > 160 and 等级 <= 170 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (3231.07 + (目标技能等级 - 161) * 144)
    elseif 等级 > 170 and 等级 <= 175 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (4731.98 + (目标技能等级 - 171) * 205.3)
    elseif 等级 > 175 and 等级 <= 180 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (5825.51 + (目标技能等级 - 176) * 283)
    end
    return {经验 = math.floor(cc * 7.5), 金钱 = math.floor(vv * 7.5)}
end

function 生活技能消耗(目标技能等级)
    local cc = 0
    local vv = 0
    local bg = 0
    local 等级 = 目标技能等级
    if 等级 > 0 and 等级 <= 2 then
        cc = 8 * (目标技能等级 + 1) * 目标技能等级
    elseif 等级 > 2 and 等级 <= 5 then
        cc = 8 * (目标技能等级 + 1) * 目标技能等级 + 2 ^ 目标技能等级
    elseif 等级 > 5 and 等级 <= 11 then
        cc = 目标技能等级 * 目标技能等级 * (目标技能等级 + 5)
    elseif 等级 > 11 and 等级 <= 18 then
        cc = 目标技能等级 * (目标技能等级 + 1) * 10 * (1.625 + (目标技能等级 - 12) * 0.2)
    elseif 等级 > 18 and 等级 <= 25 then
        cc = 目标技能等级 * (目标技能等级 + 10) * 10 * (2.37 + (目标技能等级 - 19) * 0.25)
    elseif 等级 > 25 and 等级 <= 31 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (94.3 + (目标技能等级 - 26) * 5.5)
    elseif 等级 > 25 and 等级 <= 31 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (94.3 + (目标技能等级 - 26) * 5.5)
    elseif 等级 > 31 and 等级 <= 40 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (130.22 + (目标技能等级 - 32) * 8)
    elseif 等级 > 40 and 等级 <= 50 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (207.4 + (目标技能等级 - 41) * 11)
    elseif 等级 > 50 and 等级 <= 60 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (329.41 + (目标技能等级 - 51) * 16)
    elseif 等级 > 60 and 等级 <= 70 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (495.2 + (目标技能等级 - 61) * 21)
    elseif 等级 > 70 and 等级 <= 80 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (710.93 + (目标技能等级 - 71) * 26)
    elseif 等级 > 80 and 等级 <= 90 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (982.9 + (目标技能等级 - 81) * 33)
    elseif 等级 > 90 and 等级 <= 100 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (1317.47 + (目标技能等级 - 91) * 39)
    elseif 等级 > 100 and 等级 <= 110 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (1720.997 + (目标技能等级 - 101) * 47)
    elseif 等级 > 110 and 等级 <= 120 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (2199.87 + (目标技能等级 - 111) * 55)
    elseif 等级 > 120 and 等级 <= 130 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (2760.33 + (目标技能等级 - 121) * 64)
    elseif 等级 > 130 and 等级 <= 140 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (3409.09 + (目标技能等级 - 131) * 73)
    elseif 等级 > 140 and 等级 <= 150 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (4152.37 + (目标技能等级 - 141) * 83)
    elseif 等级 > 150 and 等级 <= 155 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (5152.78 + (目标技能等级 - 151) * 247)
    elseif 等级 > 155 and 等级 <= 160 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (6557.72 + (目标技能等级 - 156) * 417)
    elseif 等级 > 160 and 等级 <= 170 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (8739.79 + (目标技能等级 - 161) * 503)
    elseif 等级 > 170 and 等级 <= 174 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (13980.32 + (目标技能等级 - 171) * 707)
    elseif 等级 > 174 and 等级 <= 179 then
        cc = 目标技能等级 * (目标技能等级 - 10) * (16804.73 + (目标技能等级 - 175) * 918)
    elseif 等级 > 179 then
        cc = 660382434
    end
    if 等级 > 0 and 等级 <= 3 then
        vv = 3 * (目标技能等级 + 1) * 目标技能等级
    elseif 等级 > 3 and 等级 <= 9 then
        vv = (目标技能等级 + 1) * 目标技能等级 * (3.25 + (目标技能等级 - 4) * 0.25)
    elseif 等级 > 9 and 等级 <= 16 then
        vv = (目标技能等级 - 5) * 目标技能等级 * (11.12 + (目标技能等级 - 10) * 0.4)
    elseif 等级 > 16 and 等级 <= 20 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (24.91 + (目标技能等级 - 17) * 0.55)
    elseif 等级 > 20 and 等级 <= 30 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (27.73 + (目标技能等级 - 21) * 1.7)
    elseif 等级 > 30 and 等级 <= 40 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (46.24 + (目标技能等级 - 31) * 3)
    elseif 等级 > 40 and 等级 <= 50 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (77.75 + (目标技能等级 - 41) * 4.4)
    elseif 等级 > 50 and 等级 <= 60 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (123.51 + (目标技能等级 - 51) * 6)
    elseif 等级 > 60 and 等级 <= 70 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (185.69 + (目标技能等级 - 61) * 7.8)
    elseif 等级 > 70 and 等级 <= 80 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (266.59 + (目标技能等级 - 71) * 10)
    elseif 等级 > 80 and 等级 <= 90 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (368.58 + (目标技能等级 - 81) * 12.3)
    elseif 等级 > 90 and 等级 <= 100 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (494.04 + (目标技能等级 - 91) * 14.8)
    elseif 等级 > 100 and 等级 <= 110 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (645.36 + (目标技能等级 - 101) * 17.6)
    elseif 等级 > 110 and 等级 <= 120 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (824.94 + (目标技能等级 - 111) * 20.65)
    elseif 等级 > 120 and 等级 <= 130 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (1035.17 + (目标技能等级 - 121) * 24)
    elseif 等级 > 130 and 等级 <= 140 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (1278.45 + (目标技能等级 - 131) * 27.5)
    elseif 等级 > 140 and 等级 <= 150 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (1557.17 + (目标技能等级 - 141) * 31.3)
    elseif 等级 > 150 and 等级 <= 155 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (1932.32 + (目标技能等级 - 151) * 92.6)
    elseif 等级 > 155 and 等级 <= 160 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (2459.17 + (目标技能等级 - 156) * 156.3)
    elseif 等级 > 160 and 等级 <= 170 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (3231.07 + (目标技能等级 - 161) * 144)
    elseif 等级 > 170 and 等级 <= 175 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (4731.98 + (目标技能等级 - 171) * 205.3)
    elseif 等级 > 175 and 等级 <= 180 then
        vv = (目标技能等级 - 10) * 目标技能等级 * (5825.51 + (目标技能等级 - 176) * 283)
    end
    bg = 目标技能等级
    return {经验 = floor(cc * 5), 金钱 = floor(vv * 5), 帮贡 = bg}
end

local function 绑定等级物品()
    local n = {}
    n[1] = {
        '红缨枪',
        '曲尖枪',
        '锯齿矛',
        '乌金三叉戟',
        '火焰枪',
        '墨杆金钩',
        '玄铁矛',
        '金蛇信',
        '丈八点钢矛',
        '暗夜',
        '梨花',
        '霹雳',
        '刑天之逆',
        '五虎断魂',
        '飞龙在天',
        '天龙破城',
        '弑皇'
    }
    n[2] = {
        '青铜斧',
        '开山斧',
        '双面斧',
        '双弦钺',
        '精钢禅钺',
        '黄金钺',
        '乌金鬼头镰',
        '狂魔镰',
        '恶龙之齿',
        '破魄',
        '肃魂',
        '无敌',
        '五丁开山',
        '元神禁锢',
        '护法灭魔',
        '碧血干戚',
        '裂天'
    }
    n[3] = {
        '青铜短剑',
        '铁齿剑',
        '吴越剑',
        '青锋剑',
        '龙泉剑',
        '黄金剑',
        '游龙剑',
        '北斗七星剑',
        '碧玉剑',
        '鱼肠',
        '倚天',
        '湛卢',
        '魏武青虹',
        '灵犀神剑',
        '四法青云',
        '霜冷九州',
        '擒龙'
    }
    n[4] = {
        '双短剑',
        '镔铁双剑',
        '龙凤双剑',
        '竹节双剑',
        '狼牙双剑',
        '鱼骨双剑',
        '赤焰双剑',
        '墨玉双剑',
        '梅花双剑',
        '阴阳',
        '月光双剑',
        '灵蛇',
        '金龙双剪',
        '连理双树',
        '祖龙对剑',
        '紫电青霜',
        '浮犀'
    }
    n[5] = {
        '五色缎带',
        '幻彩银纱',
        '金丝彩带',
        '无极丝',
        '天蚕丝带',
        '云龙绸带',
        '七彩罗刹',
        '缚神绫',
        '九天仙绫',
        '彩虹',
        '流云',
        '碧波',
        '秋水落霞',
        '晃金仙绳',
        '此最相思',
        '揽月摘星',
        '九霄'
    }
    n[6] = {
        '铁爪',
        '天狼爪',
        '幽冥鬼爪',
        '青龙牙',
        '勾魂爪',
        '玄冰刺',
        '青刚刺',
        '华光刺',
        '龙鳞刺',
        '撕天',
        '毒牙',
        '胭脂',
        '九阴勾魂',
        '雪蚕之刺',
        '贵霜之牙',
        '忘川三途',
        '离钩'
    }
    n[7] = {
        '折扇',
        '铁骨扇',
        '精钢扇',
        '铁面扇',
        '百折扇',
        '劈水扇',
        '神火扇',
        '阴风扇',
        '风云雷电',
        '太极',
        '玉龙',
        '秋风',
        '画龙点睛',
        '秋水人家',
        '逍遥江湖',
        '浩气长舒',
        '星瀚'
    }
    n[8] = {
        '细木棒',
        '金丝魔棒',
        '玉如意',
        '点金棒',
        '云龙棒',
        '幽路引魂',
        '满天星',
        '水晶棒',
        '日月光华',
        '沧海',
        '红莲',
        '盘龙',
        '降魔玉杵',
        '青藤玉树',
        '墨玉骷髅',
        '丝萝乔木',
        '醍醐'
    }
    n[9] = {
        '松木锤',
        '镔铁锤',
        '八棱金瓜',
        '狼牙锤',
        '烈焰锤',
        '破甲战锤',
        '震天锤',
        '巨灵神锤',
        '天崩地裂',
        '八卦',
        '鬼牙',
        '雷神',
        '混元金锤',
        '九瓣莲花',
        '鬼王蚀日',
        '狂澜碎岳',
        '碎寂'
    }
    n[10] = {
        '牛皮鞭',
        '牛筋鞭',
        '乌龙鞭',
        '钢结鞭',
        '蛇骨鞭',
        '玉竹金铃',
        '青藤柳叶鞭',
        '雷鸣嗜血鞭',
        '混元金钩',
        '龙筋',
        '百花',
        '吹雪',
        '游龙惊鸿',
        '仙人指路',
        '血之刺藤',
        '牧云清歌',
        '霜陨'
    }
    n[11] = {
        '黄铜圈',
        '精钢日月圈',
        '离情环',
        '金刺轮',
        '风火圈',
        '赤炎环',
        '蛇形月',
        '子母双月',
        '斜月狼牙',
        '如意',
        '乾坤',
        '月光双环',
        '别情离恨',
        '金玉双环',
        '九天金线',
        '无关风月',
        '朝夕'
    }
    n[12] = {
        '柳叶刀',
        '苗刀',
        '夜魔弯刀',
        '金背大砍刀',
        '雁翅刀',
        '破天宝刀',
        '狼牙刀',
        '龙鳞宝刀',
        '黑炎魔刀',
        '冷月',
        '屠龙',
        '血刃',
        '偃月青龙',
        '晓风残月',
        '斩妖泣血',
        '业火三灾',
        '鸣鸿'
    }
    n[13] = {
        '曲柳杖',
        '红木杖',
        '白椴杖',
        '墨铁拐',
        '玄铁牛角杖',
        '鹰眼法杖',
        '腾云杖',
        '引魂杖',
        '碧玺杖',
        '业焰',
        '玉辉',
        '鹿鸣',
        '庄周梦蝶',
        '凤翼流珠',
        '雪蟒霜寒',
        '碧海潮生',
        '弦月'
    }
    n[14] = {
        '硬木弓',
        '铁胆弓',
        '紫檀弓',
        '宝雕长弓',
        '錾金宝弓',
        '玉腰弯弓',
        '连珠神弓',
        '游鱼戏珠',
        '灵犀望月',
        '非攻',
        '幽篁',
        '百鬼',
        '冥火薄天',
        '龙鸣寒水',
        '太极流光',
        '九霄风雷',
        '若木'
    }
    n[15] = {
        '琉璃珠',
        '水晶珠',
        '珍宝珠',
        '翡翠珠',
        '莲华珠',
        '夜灵珠',
        '如意宝珠',
        '沧海明珠',
        '无量玉璧',
        '离火',
        '飞星',
        '月华',
        '回风舞雪',
        '紫金葫芦',
        '裂云啸日',
        '云雷万里',
        '赤明'
    }
    n[16] = {
        '钝铁重剑',
        '桃印铁刃',
        '赭石巨剑',
        '壁玉长铗',
        '青铜古剑',
        '金错巨刃',
        '惊涛雪',
        '醉浮生',
        '沉戟天戊',
        '鸦九',
        '昆吾',
        '弦歌',
        '墨骨枯麟',
        '腾蛇郁刃',
        '秋水澄流',
        '百辟镇魂',
        '长息'
    }
    n[18] = {
        '素纸灯',
        '竹骨灯',
        '红灯笼',
        '鲤鱼灯',
        '芙蓉花灯',
        '如意宫灯',
        '玲珑盏',
        '玉兔盏',
        '冰心盏',
        '蟠龙',
        '云鹤',
        '风荷',
        '金风玉露',
        '凰火燎原',
        '月露清愁',
        '夭桃秾李',
        '荒尘'
    }
    n[17] = {
        '油纸伞',
        '红罗伞',
        '紫竹伞',
        '锦绣椎',
        '幽兰帐',
        '琳琅盖',
        '孔雀羽',
        '金刚伞',
        '落梅伞',
        '鬼骨',
        '云梦',
        '枕霞',
        '碧火琉璃',
        '雪羽穿云',
        '月影星痕',
        '浮生归梦',
        '晴雪'
    }
    n[19] = {
        {'方巾', '簪子'},
        {'玉钗', '布帽'},
        {'面具', '梅花簪子'},
        {'纶巾', '珍珠头带'},
        {'缨络丝带', '凤头钗'},
        {'羊角盔', '媚狐头饰'},
        {'水晶帽', '玉女发冠'},
        {'乾坤帽', '魔女发冠'},
        {'黑魔冠', '七彩花环'},
        {'白玉龙冠', '凤翅金翎'},
        {'水晶夔帽', '寒雉霜蚕'},
        {'翡翠曜冠', '曜月嵌星'},
        {'金丝黑玉冠', '郁金流苏簪'},
        {'白玉琉璃冠', '玉翼附蝉翎'},
        {'兽鬼珐琅面', '鸾羽九凤冠'},
        {'紫金磐龙冠', '金珰紫焰冠'},
        {'浑天玄火盔', '乾元鸣凤冕'}
    }
    n[20] = {
        '护身符',
        '五色飞石',
        '珍珠链',
        {'骷髅吊坠', '苍魂珠'},
        {'江湖夜雨', '九宫坠'},
        {'荧光坠子', '高速之星'},
        {'风月宝链', '八卦坠'},
        {'碧水青龙', '鬼牙攫魂'},
        {'万里卷云', '疾风之铃'},
        '七彩玲珑',
        '黄玉琉佩',
        '鸾飞凤舞',
        '衔珠金凤佩',
        '七璜珠玉佩',
        '鎏金点翠佩',
        '紫金碧玺佩',
        '落霞陨星坠'
    }
    n[21] = {
        {'布裙', '布衣'},
        {'皮衣', '丝绸长裙'},
        {'五彩裙', '鳞甲'},
        {'龙鳞羽衣', '锁子甲'},
        {'天香披肩', '紧身衣'},
        {'金缕羽衣', '钢甲'},
        {'霓裳羽衣', '夜魔披风'},
        {'流云素裙', '龙骨甲'},
        {'七宝天衣', '死亡斗篷'},
        {'飞天羽衣', '神谕披风'},
        {'穰花翠裙', '珊瑚玉衣'},
        {'金蚕丝裙', '金蚕披风'},
        {'紫香金乌裙', '乾坤护心甲'},
        {'碧霞彩云衣', '蝉翼金丝甲'},
        {'金丝蝉翼衫', '金丝鱼鳞甲'},
        {'五彩凤翅衣', '紫金磐龙甲'},
        {'鎏金浣月衣', '混元一气甲'}
    }
    n[22] = {
        '腰带',
        '缎带',
        '银腰带',
        {'水晶腰带', '玉树腰带'},
        {'琥珀腰链', '白面狼牙'},
        {'乱牙咬', '魔童大牙'},
        {'攫魂铃', '双魂引'},
        {'兽王腰带', '百窜云'},
        {'八卦锻带', '圣王坠'},
        '幻彩玉带',
        '珠翠玉环',
        '金蟾含珠',
        '乾坤紫玉带',
        '琉璃寒玉带',
        '蝉翼鱼佩带',
        '磐龙凤翔带',
        '紫霄云芒带'
    }
    n[23] = {
        '布鞋',
        '牛皮靴',
        '马靴',
        '侠客履',
        '神行靴',
        '绿靴',
        '追星踏月',
        '九州履',
        '万里追云履',
        '踏雪无痕',
        '平步青云',
        '追云逐电',
        '乾坤天罡履',
        '七星逐月靴',
        '碧霞流云履',
        '金丝逐日履',
        '辟尘分光履'
    }
    n[24] = {
        '竹编护腕',
        '皮腕',
        '针腕',
        '骨镯',
        '青铜护腕',
        '玛瑙护腕',
        '琉璃护腕',
        '镂空银镯',
        '笼玉镯',
        '嵌宝金腕',
        '玳瑁护腕',
        '七星宝腕',
        '缚龙筋',
        '凤翎护腕',
        '织锦彩带',
        '冰蚕丝带'
    }
    n[25] = {
        '竹编脖环',
        '钢圈',
        '荆棘环',
        '骨环',
        '青铜颈环',
        '玛瑙石环',
        '琉璃环',
        '九曲环',
        '笼玉环',
        '嵌宝金环',
        '玳瑁环',
        '七星宝环',
        '缚龙圈',
        '鸾尾环',
        '织锦颈圈',
        '冰蚕丝圈'
    }
    n[26] = {
        '竹藤甲',
        '皮甲',
        '刺甲',
        '骨排甲',
        '青铜披甲',
        '玛瑙软甲',
        '琉璃罩甲',
        '连环铠甲',
        '笼玉甲',
        '嵌宝金甲',
        '玳瑁衣',
        '七星宝甲',
        '缚龙甲',
        '凤凰彩衣',
        '织锦软褡',
        '冰蚕织甲'
    }
    return n
end

local 杀星出现计时 = 0
local tp
local fsb = require('script/资源类/FSB')
local function 音效类_(文件号, 资源包, 子类)
    if 文件号 ~= nil and 文件号 ~= 0 and 游戏音效 > 0 and tp.音效开启 then
        fsb(tp.资源:读数据(资源包, 文件号)):播放(false)
    end
end

-- local 临时音乐=引擎.取音效(名称)
-- if 游戏音效>0 and tp.音效开启 and 临时音乐~=nil and 临时音乐.资源 ~= nil then
--   self:音效类(临时音乐.文件,临时音乐.资源)
-- end

function 计算修炼等级经验(等级, 上限)
    if 等级 > 上限 then
        上限 = 20
    end
    local 临时经验 = 110
    if 等级 == 0 then
        return 110
    end
    for n = 1, 上限 + 1 do
        临时经验 = 临时经验 + 20 + n * 20
        if n == 等级 then
            return 临时经验
        end
    end
end

function 场景类_场景:初始化()
    --进入时 40M
    -- 初始化库
    -- if 取jijo(lua读取文本("Galaxy2d.dll"))~="3f3b32b7fe68402be0eee1a84272cd73" then
    --     _ds=false
    --     引擎.关闭()
    -- elseif 取jijo(lua读取文本("astart.dll"))~="2b2be96b834ec7a96f5afae4e10f8e8b" then
    --     _ds=false
    --     引擎.关闭()
    -- elseif 取jijo(lua读取文本("fmod.dll"))~="445125d4dfb3799a497cdfa3d4f503b8" then
    --     _ds=false
    --     引擎.关闭()
    -- elseif 取jijo(lua读取文本("lfs.dll"))~="13cd3d8329ce0dd52282d5c63d4169be" then
    --     _ds=false
    --     引擎.关闭()
    -- elseif 取jijo(lua读取文本("lua51.dll"))~="aaef231564f54e70c8684c06c39b65a9" then
    --     _ds=false
    --     引擎.关闭()
    -- elseif 取jijo(lua读取文本("gsub.dll"))~="4b2378ca832d2714098898b9637f6b41" then
    --     _ds=false
    --     引擎.关闭()
    -- elseif 取jijo(lua读取文本("minizip.dll"))~="ccf0c1b53375da42fa002a8616708855" then
    --     _ds=false
    --     引擎.关闭()
    -- elseif 取jijo(lua读取文本("stop.dll"))~="61f1cada004ab45c3e8aae2842523e75" then
    --     _ds=false
    --     引擎.关闭()
    -- elseif 取jijo(lua读取文本("cjson.dll"))~="a56d07ec57a674d435eae420604fe52b" then
    --     _ds=false
    --     引擎.关闭()
    -- elseif 取jijo(lua读取文本("g2d.dll"))~="3cc1c7fcdd37cc0ab8cad0c8a4e61ddd" then
    --     _ds=false
    --     引擎.关闭()
    -- end
    -- 初始化加载

    self.资源 = require('script/资源类/加载类')(self)
    self.资源:打开()
    local 资源 = self.资源
    fsb(nil, nil, self)
    -- 初始化缓存数据
    self.资源缓存 = {} -- 已加载的was资源将保存在这里，避免重复读取
    -- UI
    self._滑块 = require('script/系统类/滑块')
    self._自适应 = require('script/系统类/自适应2')
    self._按钮 = require('script/系统类/按钮')
    self._小型选项栏 = require('script/系统类/小型选项栏')

    local bqs = {
        1295847816,
        1853525647,
        1076954610,
        3552721044,
        3990239921,
        3366615112,
        2782337201,
        3771134163,
        1462708813,
        2715893287,
        3002376600,
        3991654351,
        993860032,
        2666294756,
        454787878,
        1382010105,
        2912848813,
        3919700593,
        477926852,
        352380776,
        811687356,
        915719759,
        4249060934,
        1336751228,
        1950021903,
        2235513801,
        3594739784,
        1960900090,
        2382390242,
        1537855326,
        3907030953,
        2290431679,
        3202252097,
        4033571742,
        1492820992,
        655187057,
        2901001332,
        3190903022,
        298183232,
        1945354141,
        3436623848,
        1724964988,
        2592865169,
        3393696884,
        1494002331,
        1310769894,
        1152800681,
        2542768010,
        1378600591,
        2829693277,
        3846038890,
        3901444948,
        68667698,
        3331959614,
        432707334,
        4241851683,
        3448703702,
        2542506275,
        241536076,
        314448958,
        2242677963,
        1887092560,
        1489631920,
        2860202818,
        4076591726,
        4232189420,
        3498505860,
        4241140149,
        3858705890,
        2271353759,
        3452523393,
        963399171,
        2959831232,
        2917226350,
        4215743335,
        3987108486,
        365569753,
        3701218951,
        3044567112,
        3265766525,
        2129343522,
        2401287726,
        2716317030,
        292723042,
        4014574629,
        4183102172,
        4115700508,
        2139528734,
        276624883,
        4099788650,
        2578443618,
        3367759523,
        576638850,
        3586214754,
        2830927389,
        1915332364,
        1341579386,
        3743372972,
        1217313750,
        1208397371,
        156713767,
        2057251015,
        3084935361,
        1485268859,
        470535714,
        2868631088,
        3835251562,
        2896374671,
        3982186902,
        1708428735,
        2448085336,
        1354708809,
        943667221,
        1146784672,
        3592760724,
        611393967,
        1688780051,
        2042812914,
        1466206851,
        770780432,
        3612578974
    }
    self.包子表情动画 = {}
    for i = 0, 120 do
        self.包子表情动画[i] = 资源:载入('wzife.wdf', '网易WDF动画', bqs[i + 1])
    end
    self._丰富文本 = require('script/系统类/丰富文本')
    self._列表 = require('script/系统类/列表')
    -- 系统
    self._物品格子 = require('script/显示类/物品_格子')
    self._技能格子 = require('script/显示类/技能_格子')
    -- 内存
    self._物品 = require('script/显示类/物品')
    self._技能 = require('script/显示类/技能')
    self._宝宝库 = require('script/数据中心/宝宝库')
    self._队伍 = require('script/属性控制/队伍')
    --加载WDF资源后 48M
    -- 初始化字体表
    -- if jcsj<os.time()-2 then
    -- 	错误关闭数=100
    -- 	引擎.关闭()
    -- 	更新函数,渲染函数 = nil,nil
    -- 	tp=nil
    -- 	引擎.场景 =nil
    -- 	引擎=nil
    -- 	jcsjj=true
    -- 	return 0
    -- end
    local wz = require('gge文字类')
    self.文字类 = wz
    self.字体表 = {
        普通字体 = wz.创建(nil, 14, false, false, false),
        普通字体_ = wz.创建(nil, 13, false, false, false),
        普通字体__ = wz.创建(nil, 12.5, false, false, false),
        普通字体___ = wz.创建(nil, 14, false, false, false),
        描边字体 = wz.创建(nil, 14, false, true, false),
        道具字体 = wz.创建(nil, 21, true, false, true),
        人物字体 = wz.创建('wdf/font/宋体.ttf', 16, false, false, true),
        人物字体_ = wz.创建(nil, 16, false, false, false),
        提示字体 = wz.创建(nil, 18, false, false, false),
        时间字体 = wz.创建(nil, 16, false, true, false),
        常用字体 = wz.创建('wdf/font/宋体.ttf', 16, false, false, true),
        常用字体14 = wz.创建('wdf/font/宋体.ttf', 14, false, false, true),
        常用字体20 = wz.创建('wdf/font/宋体.ttf', 20, false, false, true),
        成就字体 = wz.创建('wdf/font/hyh1gjm.ttf', 26, false, false, true)
    }
    --加载字体表后 69M
    摊位文字 = wz.创建(nil, 14, false, false, false)
    摊位文字:置颜色(0xFF0000FF)
    名称字体 = wz.创建('wdf/font/宋体.ttf', 14, false, false, true)
    --wz=nil

    self.字体表.道具字体:置字间距(3.8)
    self.字体表.描边字体:置描边颜色(-16777216)
    self.字体表.描边字体:置颜色(4294967295)
    self.字体表.时间字体:置描边颜色(-16777216)
    self.字体表.时间字体:置颜色(0xFFEEE8AA)
    self.字体表.提示字体:置颜色(4278255360)
    self.字体表.普通字体___:置颜色(0XFF000000)
    -- 测试

    self.物品格子焦点_ = 资源:载入('wzife.wdf', '网易WDF动画', 0x6F88F494)
    self.物品格子确定_ = 资源:载入('wzife.wdf', '网易WDF动画', 0x10921CA7)
    self.物品格子禁止_ = 资源:载入('wzife.wdf', '网易WDF动画', 0x4138B067)
    self.装备强化升星_ = 资源:载入('mapani.wd2', '网易WDF动画', 0x0000017C) --钻石B01908B2  --天色9973A0CB --金色310E7EEB  --小兰2EA98928
    self.队伍格子焦点_ = 资源:载入('wzife.wdf', '网易WDF动画', 0x1ADE7867)
    self.队伍格子确定_ = 资源:载入('wzife.wdf', '网易WDF动画', 0xC540D7A7)
    self.装备强化升星蓝色_ = 资源:载入('wzife.wd2', '网易WDF动画', 0x9973A0CB)
    self.装备强化升星金色_ = 资源:载入('wzife.wd2', '网易WDF动画', 0x310E7EEB)
    self.装备强化升星钻石_ = 资源:载入('wzife.wd2', '网易WDF动画', 0xB01908B2)

    local fc = self._自适应.创建()
    fc:加载(self)
    self.提示框 = self._自适应.创建(6, 1, 1, 1, 3, 9)
    local fc = self._队伍()
    fc:置根(self)

    -- 初始化时间
    self.当前地图 = 0
    -- 初始化队伍打开
    self.队伍 = {}
    self.称谓 = {'梦幻测试'}
    self.当前称谓 = '无称谓'
    -- 初始化阵型
    self.阵型 = 1
    self.阵型表 = {
        [1] = {'无阵型', true, 0},
        [2] = {'天覆阵', false, 0},
        [3] = {'地载阵', false, 0},
        [4] = {'风扬阵', false, 0},
        [5] = {'云垂阵', false, 0},
        [6] = {'龙飞阵', false, 0},
        [7] = {'虎翼阵', false, 0},
        [8] = {'鸟翔阵', false, 0},
        [9] = {'蛇蟠阵', false, 0},
        [10] = {'鹰啸阵', false, 0},
        [11] = {'雷绝阵', false, 0}
    }
    self.地图 = nil
    -- 初始化宠物
    self.宠物 = {模型 = '生肖猪', 名称 = '生肖猪', 等级 = 1, 最大等级 = 40, 耐力 = 5, 最大耐力 = 5, 经验 = 1, 最大经验 = 10, 领养次数 = 0}
    -- 初始化游戏组件
    self.道具列表 = {}
    self.任务列表 = {}
    self.人物仓库 = {}
    self.召唤兽仓库 = {}
    self.道具仓库 = {}
    self.辅助技能 = {}
    self.房屋数据 = {}
    self.金钱 = 10000
    self.储备 = 0
    self.积分 = 3000
    self.存银 = 0
    self.摄妖香开启 = false
    self.摄妖香剩余功效时辰 = 0
    self.队伍数据 = {}
    -- 初始化剧情开关
    self.剧情开关 = {
        宝图 = false,
        抓鬼 = false,
        师门 = false,
        押镖 = false,
        四季 = false,
        十五门 = false,
        保卫长安 = false,
        进入副本 = false,
        副本 = false,
        跑环 = false,
        跑环开始 = false,
        十二生肖 = false,
        飞升 = false,
        禁止飞行 = false,
        禁止Npc = false,
        帮派 = nil,
        飞行 = true,
        任务追踪 = true
    }
    self.剧情进度 = {抓鬼 = 0, 师门 = 0, 押镖 = 0, 剧情 = 0, 十五门 = 0, 抽奖次数 = 0, 副本积分 = 0, 四季积分 = 0, 十五门积分 = 0, 保卫长安积分 = false}
    -- 加载资源
    self.战斗文字 = {{}, {}, nil, {}, {}}
    -- if jcsj<os.time()-2 then
    -- 	错误关闭数=100
    -- 	引擎.关闭()
    -- 	更新函数,渲染函数 = nil,nil
    -- 	jcsjj=true
    -- 	return 0
    -- end
    for n = 1, 10 do
        self.战斗文字[1][n] = 资源:载入('misc.wdf', '网易WDF动画', 0x30F737D8)
        --伤害字
        self.战斗文字[1][n].当前帧 = n - 1
        self.战斗文字[1][n]:更新纹理()
        self.战斗文字[2][n] = 资源:载入('misc.wdf', '网易WDF动画', 0x3CF8F9FE)
        --加血字
        self.战斗文字[2][n].当前帧 = n - 1
        self.战斗文字[2][n]:更新纹理()
        self.战斗文字[4][n] = 资源:载入('misc.wdf', '网易WDF动画', 0x0512F7DA)
        --中 外红内白字
        self.战斗文字[4][n].当前帧 = n - 1
        self.战斗文字[4][n]:更新纹理()
        self.战斗文字[5][n] = 资源:载入('misc.wdf', '网易WDF动画', 0x4EE0010A)
        --大 外红内白字
        self.战斗文字[5][n].当前帧 = n - 1
        self.战斗文字[5][n]:更新纹理()
    end

    self.底图 = 读配置('./配置.ini', 'mhxy', '底图') + 0
    local 底图资源 = 0x1BDDA833
    local 地图包 = 'xzsc.wdf'
    if self.底图 == 1 then
        底图资源 = 0x1BDDA833
        地图包 = 'wzife.wdf'
    elseif self.底图 == 2 then
        底图资源 = 2
        底图资源 = 0x00000001
    elseif self.底图 == 3 then
        底图资源 = 3
        底图资源 = 0x00000002
    elseif self.底图 == 4 then
        底图资源 = 4
        底图资源 = 0x00000003
    elseif self.底图 == 5 then
        底图资源 = 5
        底图资源 = 0x00000004
    elseif self.底图 == 6 then
        底图资源 = 6
        底图资源 = 0x00000005
    elseif self.底图 == 7 then
        底图资源 = 7
        底图资源 = 0x00000006
    elseif self.底图 == 8 then
        底图资源 = 8
        底图资源 = 0x00000007
    end
    self.外部聊天框 = 资源:载入(地图包, '网易WDF动画', 底图资源)
    self.外部聊天框:置区域(0, 0, 360, 1000)
    --可以充填

    self.活跃背景_ = self._自适应.创建(7, 1, 50, 22, 1, 3)

    小摊位 = 资源:载入('addon.wdf', '网易WDF动画', 0xBD80E0DB)
    中摊位 = 资源:载入('addon.wdf', '网易WDF动画', 0x6D33D98E)
    大摊位 = 资源:载入('addon.wdf', '网易WDF动画', 0x74786102)
    self.经验背景_ = self._自适应.创建(7, 1, 186, 22, 1, 3)

    self.影子 = 资源:载入('shape.wdf', '网易WDF动画', 0xDCE4B562)
    self.传送点 = 资源:载入('wpal/121.wpal', '网易WDF动画', 0x000002B6)
    -- 天气
    self.画线 = 资源:载入('wzife.wd4', '网易WDF动画', 0xA1442425)
    self.任务图标 = 资源:载入('addon.wdf', '网易WDF动画', 0x953624BC)
    -- 初始化大数据
    -- if jcsj<os.time()-3 then
    -- 	错误关闭数=100
    -- 	引擎.关闭()
    -- 	更新函数,渲染函数 = nil,nil
    -- 	jcsjj=true
    -- 	return 0
    -- end
    -- if jcsj<os.time()-4 then
    -- 	错误关闭数=100
    -- 	引擎.关闭()
    -- 	更新函数,渲染函数 = nil,nil
    -- 	tp=nil
    -- 	引擎.场景 =nil
    -- 	引擎=nil
    -- 	jcsjj=true
    -- 	return 0
    -- end
    self.假人库 = require('script/全局/假人控制')(self)
    -- if jcsj<os.time()-5 then
    -- 	错误关闭数=100
    -- 	引擎.关闭()
    -- 	更新函数,渲染函数 = nil,nil
    -- 	tp=nil
    -- 	引擎.场景 =nil
    -- 	引擎=nil
    -- 	jcsjj=true
    -- 	return 0
    -- end
    -- self.全局Npc = self.假人库:第三类假人()
    -- 初始化内存数据
    self.打造物品 = 绑定等级物品()
    -- 初始化窗口
    图像类 = require('gge图像类1')
    self.必杀动画 = 资源:载入('magic.wdf', '网易WDF动画', 3973111811)

    self.窗口 = {
        小地图 = require('script/功能界面/小地图').创建(self),
        对话栏 = require('script/多重对话类/对话栏').创建(self),
        文本栏 = require('script/显示类/文本栏').创建(self),
        队伍申请表 = require('script/场景类/队伍申请列表类').创建(self),
        人物状态栏 = require('script/场景类/人物状态栏').创建(self),
        人物称谓栏 = require('script/场景类/人物称谓栏').创建(self),
        召唤兽属性栏 = require('script/场景类/召唤兽属性栏').创建(self),
        召唤兽资质栏 = require('script/场景类/召唤兽资质栏').创建(self),
        道具行囊 = require('script/场景类/道具行囊').创建(self),
        幻化界面 = require('script/场景类/幻化界面').创建(self),
        队伍栏 = require('script/场景类/队伍栏').创建(self),
        队伍阵型栏 = require('script/场景类/队伍阵型栏').创建(self),
        宠物状态栏 = require('script/场景类/宠物状态栏').创建(self),
        宠物领养栏 = require('script/场景类/宠物领养栏').创建(self),
        宠物炼妖栏 = require('script/场景类/宠物炼妖栏').创建(self),
        宠物洗练栏 = require('script/场景类/宠物洗练栏').创建(self),
        宠物打书内丹栏 = require('script/场景类/宠物打书内丹栏').创建(self),
        宠物合宠栏 = require('script/场景类/宠物合宠栏').创建(self),
        任务栏 = require('script/场景类/任务栏').创建(self),
        打造 = require('script/场景类/打造').创建(self),
        修理 = require('script/场景类/修理').创建(self),
        商店 = require('script/场景类/商店').创建(self),
        跑商商店 = require('script/场景类/跑商商店').创建(self),
        召唤兽染色 = require('script/场景类/召唤兽染色').创建(self),
        武器染色 = require('script/场景类/武器染色').创建(self),
        出售 = require('script/场景类/出售').创建(self),
        技能学习 = require('script/场景类/技能学习').创建(self),
        染色 = require('script/场景类/染色').创建(self),
        飞行符 = require('script/场景类/飞行符').创建(self),
        钓鱼 = require('script/场景类/钓鱼').创建(self),
        系统设置 = require('script/初系统/设置').创建(self),
        道具仓库 = require('script/场景类/道具仓库').创建(self),
        好友列表 = require('script/功能界面/好友列表').创建(self),
        好友查找 = require('script/功能界面/h好友查找类').创建(self),
        自由技能栏 = require('script/场景类/自由技能栏').创建(self),
        奇经八脉 = require('script/场景类/奇经八脉').创建(self),
        没名系统 = require('script/场景类/m没名系统').创建(self),
        没名系统处理 = require('script/场景类/m没名系统处理').创建(self),
        合成 = require('script/场景类/合成').创建(self),
        召唤兽查看栏 = require('script/场景类/召唤兽查看栏').创建(self),
        灵饰 = require('script/场景类/灵饰').创建(self),
        法宝 = require('script/场景类/法宝').创建(self),
        组合输入框 = require('script/场景类/组合输入框').创建(self),
        任务追踪栏 = require('script/场景类/任务追踪栏').创建(self),
        生死劫 = require('script/场景类/生死劫').创建(self),
        梦幻指引 = require('script/顶部/梦幻指引2').创建(self),
        玩法介绍 = require('script/顶部/玩法介绍2').创建(self),
        召唤兽仓库 = require('script/场景类/召唤兽仓库').创建(self),
        快捷技能选择栏 = require('script/场景类/快捷技能选择栏').创建(self),
        表情窗口 = require('script/功能界面/表情窗口').创建(self),
        时辰 = require('script/功能界面/时辰').创建(self),
        人物框 = require('script/系统类/人物框').创建(self),
        底图框 = require('script/功能界面/底图框').创建(self),
        消息框 = require('script/功能界面/聊天框').创建(self),
        快捷技能栏 = require('script/系统类/快捷技能栏').创建(self),
        给予 = require('script/场景类/g给予类').创建(self),
        交易 = require('script/功能界面/交易类').创建(self),
        摊位出售 = require('script/功能界面/摊位出售类').创建(self),
        摊位购买 = require('script/功能界面/摊位购买类').创建(self),
        合成旗 = require('script/功能界面/合成旗类').创建(self),
        排行榜 = require('script/顶部/排行榜类').创建(self),
        好友消息 = require('script/功能界面/好友消息类').创建(self),
        好友查看 = require('script/功能界面/好友查看类').创建(self),
        世界地图分类小地图 = require('script/功能界面/世界地图分类小地图').创建(self),
        世界大地图 = require('script/功能界面/世界大地图').创建(self),
        世界大地图分类a = require('script/功能界面/世界大地图分类a').创建(self),
        世界大地图分类b = require('script/功能界面/世界大地图分类b').创建(self),
        世界大地图分类c = require('script/功能界面/世界大地图分类c').创建(self),
        世界大地图分类d = require('script/功能界面/世界大地图分类d').创建(self),
        小地图NPC = require('script/功能界面/小地图NPC').创建(self),
        商城类 = require('Script/顶部/商城类').创建(self),
        更多属性 = require('script/功能界面/更多属性').创建(self),
        装备开运 = require('script/场景类/装备开运').创建(self),
        符石镶嵌 = require('script/场景类/符石镶嵌').创建(self),
        坐骑属性栏 = require('script/功能界面/坐骑属性栏').创建(self),
        坐骑资质栏 = require('script/功能界面/坐骑资质栏').创建(self),
        坐骑技能栏 = require('script/功能界面/坐骑技能栏').创建(self),
        鉴定 = require('script/场景类/鉴定').创建(self),
        分解 = require('script/场景类/f分解').创建(self),
        附魔 = require('script/场景类/附魔').创建(self),
        帮派查看 = require('script/功能界面/帮派查看类').创建(self),
        帮派申请 = require('script/功能界面/帮派申请类').创建(self),
        钱庄存取钱 = require('script/场景类/钱庄存取钱').创建(self),
        帮派点修 = require('script/场景类/帮派点修').创建(self),
        帮派技能学习 = require('script/场景类/帮派技能学习').创建(self),
        符石合成 = require('script/场景类/符石合成').创建(self),
        坐骑染色 = require('script/场景类/坐骑染色').创建(self),
        坐骑饰品染色 = require('script/场景类/坐骑饰品染色').创建(self),
        法宝合成 = require('script/场景类/法宝合成').创建(self),
        附魔宝珠 = require('script/场景类/附魔宝珠').创建(self),
        碎星锤 = require('script/场景类/碎星锤').创建(self),
        神秘宝箱 = require('script/场景类/s神秘宝箱类').创建(self),
        助战界面 = require('script/功能界面/助战界面').创建(self),
        助战物品界面 = require('script/功能界面/助战物品').创建(self),
        助战技能栏 = require('script/功能界面/助战技能栏').创建(self),
        拍卖系统 = require('script/功能界面/拍卖系统').创建(self),
        拍卖系统管理 = require('script/功能界面/拍卖系统管理').创建(self),
        仙玉兑换 = require('script/功能界面/仙玉兑换').创建(self),
        炼丹炉 = require('script/功能界面/炼丹炉').创建(self),
        指定系统 = require('script/功能界面/指定系统').创建(self),
        签到界面 = require('script/功能界面/签到界面').创建(self),
        元神 = require('script/功能界面/元神').创建(self),
        活跃商城 = require('script/功能界面/活跃商城').创建(self),
        灵箓 = require('script/场景类/灵箓').创建(self),
        房屋拜访 = require('script/功能界面/房屋拜访类').创建(self),
        人物界面 = require('script/功能界面/人物界面类').创建(self),
        商店召唤兽 = require('script/功能界面/商店召唤兽').创建(self),
        死亡提示 = require('script/场景类/s死亡提示').创建(self),
        孩子技能学习 = require('script/场景类/h孩子技能学习').创建(self),
        藏宝阁 = require('script/顶部/藏宝阁类').创建(self),
        藏宝阁出售 = require('script/顶部/藏宝阁出售').创建(self),
        藏宝阁银子出售 = require('script/顶部/藏宝阁银子出售').创建(self),
        藏宝阁角色出售 = require('script/顶部/藏宝阁角色出售').创建(self),
        藏宝阁角色取回 = require('script/顶部/藏宝阁角色取回').创建(self),
        角色查看 = require('script/顶部/角色查看').创建(self),
        超级传送 = require('script/功能界面/超级传送').创建(self),
        点歌台 = require('script/功能界面/点歌台').创建(self),
        点歌播放 = require('script/功能界面/点歌播放').创建(self),
        武魂界面 = require('script/场景类/武魂界面').创建(self),
        取经之路 = require('script/场景类/取经之路').创建(self),
        取经图鉴 = require('script/场景类/取经图鉴').创建(self),
        充值系统 = require('script/功能界面/充值界面').创建(self),
        天梯 = require('script/顶部/天梯2').创建(self),
        洗炼丹 = require('script/场景类/洗炼丹').创建(self),
        高级洗炼丹 = require('script/场景类/高级洗炼丹').创建(self),
        召唤兽鉴定 = require('script/场景类/召唤兽鉴定').创建(self),
        召唤兽特殊鉴定 = require('script/场景类/召唤兽特殊鉴定').创建(self),
        召唤兽繁殖 = require('script/场景类/召唤兽繁殖').创建(self),
        点化石 = require('script/场景类/点化石').创建(self),
        --人物炫彩 = require("script/功能界面/人物炫彩").创建(self),
        VIP系统 = require('script/顶部/VIP系统').创建(self),
        内充抽奖 = require('script/功能界面/内充抽奖').创建(self),
        显示开关 = require('script/场景类/显示开关').创建(self),
        成就系统栏 = require('script/场景类/成就系统栏').创建(self),
        成就特效 = require('script/场景类/成就特效').创建(self),
        成就提示 = require('script/场景类/成就提示').创建(self),
        成就提示1 = require('script/场景类/成就提示1').创建(self),
        抽奖系统 = require('script/场景类/抽奖系统').创建(self),
        图鉴系统 = require('script/功能界面/图鉴系统').创建(self),
        助战宠物 = require('script/功能界面/助战宠物').创建(self),
        助战修炼界面 = require('script/助战界面/助战修炼界面').创建(self),
        助战技能学习 = require('script/助战界面/助战技能学习').创建(self),
        助战辅助技能 = require('script/助战界面/助战辅助技能').创建(self),
        助战灵饰 = require('script/助战界面/助战灵饰').创建(self),
        助战锦衣 = require('script/助战界面/助战锦衣').创建(self),
        助战法宝 = require('script/助战界面/助战法宝').创建(self),
        助战奇经八脉 = require('script/助战界面/助战奇经八脉').创建(self),
        --魂骨洗练 = require("script/功能界面/魂骨洗练").创建(self),
        魂环洗练 = require('script/功能界面/魂环洗练').创建(self),
        魂环穿戴与洗练 = require('script/功能界面/魂环穿戴与洗练').创建(self)
        --魂骨穿戴与洗练 = require("script/功能界面/魂骨穿戴与洗练").创建(self),
    }
    -- if jcsj<os.time()-8 then
    -- 	错误关闭数=100
    -- 	引擎.关闭()
    -- 	更新函数,渲染函数 = nil,nil
    -- 	tp=nil
    -- 	引擎.场景 =nil
    -- 	引擎=nil
    -- 	jcsjj=true
    -- 	return 0
    -- end
    --=========08开始
    require('script/全局/变量2')
    -- 加载头文件
    ffi = require('ffi')
    f函数 = require('ffi函数2')
    f函数.修改窗口图标('001.ico')
    客户端 = require('script/网络/hp').创建()
    --=========08结束
    self.窗口_ = {}
    -- 初始化标题
    self.标题 = require('script/初系统/标题').创建(self)
    self.注册 = require('script/初系统/注册').创建(self)
    self.分区 = require('script/初系统/分区').创建(self)
    self.登陆 = require('script/初系统/登陆').创建(self)
    self.创建 = require('script/初系统/创建').创建(self)
    self.读取 = require('script/初系统/选择角色').创建(self)
    self.退出 = require('script/初系统/退出').创建(self)
    -- 初始化鼠标
    self.鼠标 = require('script/显示类/鼠标').创建(self)
    self.提示 = require('script/显示类/提示类').创建(self)
    self.喊话 = require('script/显示类/喊话').创建(self)
    -- 角色坐标
    self.角色坐标 = xys()
    -- 初始化进程
    self.进程 = 1
    -- 系统设置
    self.系统设置 = {
        声音设置 = {0, 100, true, true},
        战斗设置 = {'一级药', 30, 30, true, true}
    }
    local a = {wdf配置 .. '/Audio/1091.mp3', wdf配置 .. '/Audio/1070.mp3'}
    self.音乐 = self.资源:载入(a[引擎.取随机整数(1, 2)], '音乐', nil)
    self.音乐:播放(读配置('./配置.ini', 'mhxy', '音乐播放') or true)
    self.音量 = math.ceil(读配置('./配置.ini', 'mhxy', '音量') + 0)
    self.音乐:置音量(self.音量)

    游戏音效 = math.ceil(读配置('./配置.ini', 'mhxy', '音效'))
    self.底图 = 读配置('./配置.ini', 'mhxy', '底图') + 0
    self.渐变音量 = 40
    self.战斗中 = false
    self.音乐开启 = true
    self.音效开启 = true
    self.称谓特效 = true
    self.足迹特效 = true
    self.光环特效 = true
    self.锦衣特效 = true
    self.坐骑特效 = true
    local 场景开关 = 读配置('./配置.ini', 'mhxy', '场景特效')
    if 场景开关 == 'true' then
        self.场景特效 = true
    else
        self.场景特效 = false
    end

    self.人物选中 = false
    self.选中UI = false
    self.隐藏UI = false
    self.第二场景开启 = false
    self.下一次确定 = false
    self.按钮焦点 = false
    self.禁止通行 = false
    self.消息栏焦点 = false
    self.快捷技能显示 = false
    self.按下中 = false
    self.第一窗口移动中 = false
    self.第二窗口移动中 = false
    self.第二次删除 = 0
    self.梦幻指引 = {}
    self.坐骑列表 = {}
    self.任务Npc = {}
    self.天梯 = {}
    -- self.临时Npc = {}
    系统参数.音量 = self.音量
    --self.选中窗口 = 0
    self.Npc任务事件 = nil -- 寄存押镖、送信之类的
    -- 初始化运行时间
    self.运行时间 = 0
    --self.音乐:置音量(80)
    self.恢复UI = false
    tp = self
end

function 取随机数(a, b)
    return 引擎.取随机整数(a, b)
end

function 场景类_场景:初始化设置()
    -- 初始化队伍
    self.系统设置 = {
        声音设置 = {140, 140}
    }
    -- 初始化时间
    self.当前地图 = 0
    -- 初始化队伍
    self.队伍 = {}
    self.称谓 = {'梦幻测试'}
    self.当前称谓 = '无称谓'
    -- 初始化阵型
    self.阵型 = 1
    self.阵型表 = {
        [1] = {'无阵型', true, 0},
        [2] = {'天覆阵', false, 0},
        [3] = {'地载阵', false, 0},
        [4] = {'风扬阵', false, 0},
        [5] = {'云垂阵', false, 0},
        [6] = {'龙飞阵', false, 0},
        [7] = {'虎翼阵', false, 0},
        [8] = {'鸟翔阵', false, 0},
        [9] = {'蛇蟠阵', false, 0},
        [10] = {'鹰啸阵', false, 0},
        [11] = {'雷绝阵', false, 0}
    }
    self.地图 = nil
    -- 初始化宠物
    self.宠物 = {模型 = '生肖猪', 名称 = '生肖猪', 等级 = 1, 最大等级 = 40, 耐力 = 5, 最大耐力 = 5, 经验 = 1, 最大经验 = 10}
    -- 初始化游戏组件
    self.道具列表 = {}
    self.任务列表 = {}
    self.人物仓库 = {}
    self.召唤兽仓库 = {}
    self.道具仓库 = {}
    self.辅助技能 = {}
    self.全局Npc = {}
    self.金钱 = 10000
    self.储备 = 0
    self.积分 = 0
    self.存银 = 0
    self.摄妖香开启 = false
    self.摄妖香剩余功效时辰 = 3
    -- 初始化剧情开关
    self.剧情开关 = {
        宝图 = false,
        抓鬼 = false,
        师门 = false,
        押镖 = false,
        四季 = false,
        十五门 = false,
        保卫长安 = false,
        进入副本 = false,
        副本 = false,
        禁止飞行 = false,
        禁止Npc = false
    }
    self.剧情进度 = {抓鬼 = 0, 师门 = 0, 押镖 = 0, 剧情 = 0, 十五门 = 0, 抽奖次数 = 0, 副本积分 = 0, 四季积分 = 0, 十五门积分 = 0, 保卫长安积分 = false}
    self.临时野怪 = nil
    self.角色坐标 = xys()
end

function 场景类_场景:关闭窗口()
    for i, v in pairs(self.窗口_) do
        if v.可视 then
            if v.ID ~= 3 then
                if v.ID == 4 or v.ID == 7 then
                    v:打开()
                else
                    v.可视 = false
                end
            end
        end
    end
    self.选中窗口 = 0
    self.选中UI = false
end

function 场景类_场景:取药品(等级)
    if 等级 == 1 then
        return {'佛手', '旋复花', '紫丹罗', '四叶花', '白玉骨头', '灵脂', '鬼切草', '天青地白', '曼佗罗花'}
    elseif 等级 == 2 then
        return {
            '丁香水',
            '月星子',
            '紫石英',
            '天不老',
            '地狱灵芝',
            '仙狐涎',
            '麝香',
            '血珊瑚',
            '餐风饮露',
            '白露为霜',
            '鹿茸',
            '血色茶花',
            '天龙水',
            '孔雀红',
            '六道轮回',
            '熊胆',
            '凤凰尾',
            '硫磺草',
            '龙之心屑',
            '火凤之睛'
        }
    elseif 等级 == 3 then
        return {'金创药', '金香玉', '风水混元丹', '定神香', '蛇蝎美人', '千年保心丹', '小还丹', '九转回魂丹', '佛光舍利子', '五龙丹'}
    end
end

function 场景类_场景:取进制等级(等级)
    local dj = 0
    if 等级 > 0 and 等级 < 10 then
        dj = 0
    elseif 等级 >= 10 and 等级 < 20 then
        dj = 10
    elseif 等级 >= 20 and 等级 < 30 then
        dj = 20
    elseif 等级 >= 30 and 等级 < 40 then
        dj = 30
    elseif 等级 >= 40 and 等级 < 50 then
        dj = 40
    elseif 等级 >= 50 and 等级 < 60 then
        dj = 50
    elseif 等级 >= 60 and 等级 < 70 then
        dj = 60
    elseif 等级 >= 70 and 等级 < 80 then
        dj = 70
    elseif 等级 >= 80 and 等级 < 90 then
        dj = 80
    elseif 等级 >= 90 and 等级 < 100 then
        dj = 90
    elseif 等级 >= 100 and 等级 < 110 then
        dj = 100
    elseif 等级 >= 110 and 等级 < 120 then
        dj = 110
    elseif 等级 >= 120 and 等级 < 130 then
        dj = 120
    elseif 等级 >= 130 and 等级 < 140 then
        dj = 130
    elseif 等级 >= 140 and 等级 < 150 then
        dj = 140
    elseif 等级 >= 150 and 等级 < 160 then
        dj = 150
    elseif 等级 >= 160 and 等级 < 170 then
        dj = 160
    elseif 等级 >= 170 and 等级 < 185 then
        dj = 170
    end
    return dj
end

function 场景类_场景:可通行()
    return not 人物点击 and not self.人物选中 and not self.选中UI and not self.按钮焦点 and not self.消息栏焦点 and self.场景.抓取物品 == nil and
        not self.禁止通行 and
        not self.下一次确定 and
        not self.按下中 and
        not self.第一窗口移动中 and
        not self.第二窗口移动中
end

function 场景类_场景:载入特效(特效, zl, ns)
    local a = txk(特效)
    if a[2] == nil and a[1] == nil then
    --   tp.窗口.消息框:添加文本("请截图给管理员,谢谢[ "..特效.." ]特效没技能素材","系统")
    end
    return self.资源:载入(a[2], '网易WDF动画', a[1], zl, nil, ns, false)
end

function 场景类_场景:可操作()
    return not self.消息栏焦点 and not self.选中UI
end

function UI排序(a, b)
    return a.窗口时间 < b.窗口时间
end

function 场景类_场景:取鼠标所在窗口(x, y)
    if not self.隐藏UI and not self.战斗中 then
        for n = #self.窗口_, 1, -1 do
            if self.窗口_[n]:检查点(x, y) then
                self.选中UI = true
                return n
            end
        end
    end
    return 0
end

local jz = 0

function 场景类_场景:显示(dt, x, y)
    if 客户端参数.分钟 ~= os.date('%M', os.time()) and os.date('%S', os.time()) == '00' then
        整分处理(os.date('%M', os.time()))
    end
    if 检测开启 == 1 then
        if math.random(1, 1000) <= 10 then
            检测WPE(动态加密文本)
            检测WPE2(动态加密文本)
            检测WPE3(动态加密文本)
            内存优化(动态加密文本)
        end
    end
    全局时辰刷新()
    for i = 0, 120 do
        self.包子表情动画[i]:更新(dt)
    end
    系统参数.时间 = os.time()
    self.传送点:更新(dt)
    self.任务图标:更新(dt)
    if self.隐藏UI then
        self.选中UI = false
    end
    if
        self.进程 == 1 or self.进程 == 2 or self.进程 == 3 or self.进程 == 5 or self.进程 == 6 or self.进程 == 7 or self.进程 == 8 or
            self.进程 == 9 or
            self.进程2 == 1
     then
        self.标题:显示(dt, x, y)
        if self.进程 == 2 then
            self.读取:显示(dt, x, y)
        elseif self.进程 == 3 then
            self.创建:显示(dt, x, y)
        elseif self.进程 == 5 then
            self.注册:显示(dt, x, y)
        elseif self.进程 == 6 then
            self.充值:显示(dt, x, y)
        elseif self.进程 == 7 then
            self.登陆:显示(dt, x, y)
        elseif self.进程 == 8 then
            self.分区:显示(dt, x, y)
        elseif self.进程 == 9 then
            self.退出:显示(dt, x, y)
        end
        if self.进程2 == 1 then
            self.退出:显示(dt, x, y)
        end
    elseif self.进程 == 4 then
        self.场景:显示(dt, x, y)
        self.喊话:显示()
        if self.场景.过度精灵 ~= nil then
            self.场景.过度时间 = self.场景.过度时间 - 0.55
            if self.场景.过度时间 <= 0 then
                self.场景.过度进度 = self.场景.过度进度 - (self.场景.过度减少 or 20)
                self.场景.过度时间 = 0
                if self.场景.过度进度 <= 0 then
                    self.场景.过度进度 = 0
                end
            end
            if self.场景.过度进度 <= 240 then
                if self.恢复UI then
                    self.隐藏UI = false
                    self.恢复UI = false
                end
            end
            self.场景.过度精灵:置颜色(ARGB(self.场景.过度进度, 255, 255, 255))
            self.场景.过度精灵:显示()
            if self.场景.过度进度 <= 0 then
                self.场景.过度精灵:释放()
                self.场景.过度精灵 = nil
                self.场景.过度减少 = nil
            end
        end
        if not self.隐藏UI then
            self.队伍格子焦点_:更新(dt)
            self.物品格子焦点_:更新(dt)
            self.窗口.时辰:显示(dt, x, y)
            self.窗口.人物框:显示(dt, x, y)
            self.窗口.底图框:显示(dt, x, y)
            self.窗口.快捷技能栏:显示(dt, x, y)
            if self.战斗中 then
                --[[for n=1,#self.场景.战斗.窗口_ do
					if not self.隐藏UI then
						self.场景.战斗.窗口_[n]:显示(dt,x,y)
						if self.按钮焦点 then
							self.场景.战斗.窗口_[n].焦点 = true
						end
					end
				end --]]
                self.窗口.消息框:显示(dt, x, y)
                if mousea(0) and 战斗类.自动栏 ~= nil and 战斗类.自动栏.可视 and 战斗类.自动栏:检查点(x, y) then
                    战斗类.自动栏:初始移动(x, y)
                elseif mouseb(0) or self.隐藏UI or self.消息栏焦点 then
                    self.移动窗口 = false
                    self.第一窗口移动中 = false
                end
                if self.移动窗口 and not self.隐藏UI and self.消息栏焦点 == false then
                    self.第一窗口移动中 = true
                    战斗类.自动栏:开始移动(x, y)
                end
            else
                游戏传音:显示(dt, x, y)
                self.窗口.消息框:显示(dt, x, y)
                self.窗口.任务追踪栏:显示(dt, x, y)
                sort(self.窗口_, UI排序)
                for n = 1, #self.窗口_ do
                    if self.窗口_[n].可视 then
                        self.窗口_[n]:显示(dt, x, y)
                        self.窗口_[n].焦点 = self.窗口_[n].焦点 or self.按钮焦点
                        if self.窗口_[self.选中窗口] ~= nil and self.窗口_[self.选中窗口].ID == self.窗口_[n].ID and not self.按下中 then
                            self.窗口_[n].鼠标 = true
                            if
                                mouseb(1) and self.窗口_[n].右键关闭 == nil and self.抓取物品 == nil and not self.禁止关闭 and
                                    not self.消息栏焦点 and
                                    not self.窗口_[n].焦点1
                             then
                                self.窗口_[n]:打开()
                                if self.窗口_[n].注释 == '炼丹炉' then
                                    发送数据(99)
                                end
                            end
                        else
                            if self.第一窗口移动中 == false then
                                self.窗口_[n].鼠标 = false
                            end
                        end
                    end
                end
                if
                    mousea(0) and self.选中窗口 ~= 0 and self.窗口_[self.选中窗口] ~= nil and self.窗口_[self.选中窗口].可移动 and
                        not self.消息栏焦点
                 then
                    self.窗口_[self.选中窗口]:初始移动(x, y)
                elseif mouseb(0) or self.隐藏UI or self.消息栏焦点 then
                    self.移动窗口 = false
                    self.第一窗口移动中 = false
                end
                if self.移动窗口 and not self.隐藏UI and not self.消息栏焦点 and self.窗口_[#self.窗口_] then
                    self.第一窗口移动中 = true
                    self.窗口_[#self.窗口_]:开始移动(x, y)
                end
                for n = 1, #self.窗口_ do
                    if self.窗口_[n] and not self.窗口_[n].可视 then
                        remove(self.窗口_, n)
                    end
                end
            end
        end
        if self.场景.抓取物品 ~= nil then
            self.场景.抓取物品.小模型:显示(x - 45, y - 40)
        end
    end
    if self.第二场景开启 then
        self.隐藏UI = true
        self.第二场景:显示(dt, x, y)
    end
    if #self.提示.寄存内容 > 0 then
        if self.提示.寄存内容.开启提示 then
            self.提示框:置宽高(self.提示.寄存内容.提示坐标[3] + 15, self.提示.寄存内容.提示坐标[4] + 12)
            self.提示框:显示(self.提示.寄存内容.提示坐标[1], self.提示.寄存内容.提示坐标[2])
        end
        for i = 1, #self.提示.寄存内容 do
            if self.提示.寄存内容[i].内容 ~= nil then
                self.提示.寄存内容[i].内容:显示(self.提示.寄存内容[i].x, self.提示.寄存内容[i].y)
            else
                if self.提示.寄存内容[i].文字 ~= nil then
                    self.提示.寄存内容[i].文字:置颜色(self.提示.寄存内容[i].颜色):显示(
                        self.提示.寄存内容[i].坐标[1],
                        self.提示.寄存内容[i].坐标[2],
                        self.提示.寄存内容[i].文本
                    )
                end
            end
        end
        self.提示:清空寄存()
    end
    if self.选中假人 and not tp.战斗中 then
        self.鼠标.置鼠标('事件')
    end
    self.提示:显示()
    self.鼠标:更新(dt, x, y)
    self.鼠标:显示(dt, x, y)
    self.选中UI = false
    if self.下一次确定 then
        self.选中UI = true
    end
    if self.选项栏选中 then
        self.第二次删除 = self.第二次删除 + 1
        if self.第二次删除 == 2 then
            self.第二次删除 = 0
            self.选项栏选中 = false
        end
    end
    self.禁止通行 = false
    self.按钮焦点 = false
    self.禁止关闭 = false
    self.消息栏焦点 = false
    if
        self.进程 == 1 or self.进程 == 2 or self.进程 == 3 or self.进程 == 5 or self.进程 == 6 or self.进程 == 7 or self.进程 == 8 or
            self.进程 == 9
     then
        if self.渐变音量 < self.系统设置.声音设置[1] then
            self.渐变音量 = self.渐变音量 + 2
            self.音乐:置音量(self.渐变音量)
            全局游戏音量 = self.渐变音量
        end
    elseif self.进程 == 4 then
        if not self.隐藏UI then
            if self.窗口.文本栏.可视 or self.窗口.对话栏.可视 then
                self.消息栏焦点 = true
            end
            if not self.战斗中 then
                self.选中窗口 = self:取鼠标所在窗口(x, y)
            else
                -- self.场景.战斗.选中窗口 = self.场景.战斗:取鼠标所在窗口(x,y)
            end
        end
    end
    if 坐标显示 then
        -- 	self.字体表.文书字体:显示(20,100,"角色坐标:"..self.角色坐标.x..","..self.角色坐标.y)
        self.字体表.普通字体:显示(0, 100, '鼠标：' .. 鼠标.x .. ',' .. 鼠标.y)
        self.字体表.普通字体:显示(0, 120, '角色坐标:' .. math.floor(self.角色坐标.x) .. ',' .. math.floor(self.角色坐标.y))
        self.字体表.普通字体:显示(0, 140, '地图：' .. tp.当前地图)
    end
end

function 场景类_场景:取模型(ID)
    local 角色信息 = {}
    角色信息[1] = '飞燕女'
    角色信息[2] = '英女侠'
    角色信息[3] = '巫蛮儿'
    角色信息[4] = '逍遥生'
    角色信息[5] = '剑侠客'
    角色信息[6] = '狐美人'
    角色信息[7] = '骨精灵'
    角色信息[8] = '杀破狼'
    角色信息[9] = '巨魔王'
    角色信息[10] = '虎头怪'
    角色信息[11] = '舞天姬'
    角色信息[12] = '玄彩娥'
    角色信息[13] = '羽灵神'
    角色信息[14] = '神天兵'
    角色信息[15] = '龙太子'
    角色信息[16] = '桃夭夭'
    角色信息[17] = '偃无师'
    角色信息[18] = '鬼潇潇'
    return 角色信息[ID]
end

function 场景类_场景:队伍角色(模型)
    local 角色信息 = {
        飞燕女 = {
            模型 = '飞燕女',
            ID = 1,
            染色方案 = 2601,
            性别 = '女',
            种族 = '人',
            门派 = {'大唐官府', '女儿村', '方寸山', '神木林'},
            武器 = {'双短剑', '环圈'}
        },
        英女侠 = {
            模型 = '英女侠',
            ID = 2,
            染色方案 = 2607,
            性别 = '女',
            种族 = '人',
            门派 = {'大唐官府', '女儿村', '方寸山', '神木林'},
            武器 = {'双短剑', '鞭'}
        },
        巫蛮儿 = {
            模型 = '巫蛮儿',
            ID = 3,
            染色方案 = 2616,
            性别 = '女',
            种族 = '人',
            门派 = {'大唐官府', '女儿村', '方寸山', '神木林'},
            武器 = {'宝珠', '法杖'}
        },
        逍遥生 = {模型 = '逍遥生', ID = 4, 染色方案 = 2611, 性别 = '男', 种族 = '人', 门派 = {'大唐官府', '化生寺', '方寸山', '神木林'}, 武器 = {'扇', '剑'}},
        剑侠客 = {模型 = '剑侠客', ID = 5, 染色方案 = 2609, 性别 = '男', 种族 = '人', 门派 = {'大唐官府', '化生寺', '方寸山', '神木林'}, 武器 = {'刀', '剑'}},
        狐美人 = {
            模型 = '狐美人',
            ID = 6,
            染色方案 = 2608,
            性别 = '女',
            种族 = '魔',
            门派 = {'盘丝洞', '阴曹地府', '魔王寨', '无底洞'},
            武器 = {'爪刺', '鞭'}
        },
        骨精灵 = {
            模型 = '骨精灵',
            ID = 7,
            染色方案 = 2608,
            性别 = '女',
            种族 = '魔',
            门派 = {'盘丝洞', '阴曹地府', '魔王寨', '无底洞'},
            武器 = {'魔棒', '爪刺'}
        },
        杀破狼 = {
            模型 = '杀破狼',
            ID = 8,
            染色方案 = 2601,
            性别 = '男',
            种族 = '魔',
            门派 = {'狮驼岭', '阴曹地府', '魔王寨', '无底洞'},
            武器 = {'宝珠', '弓弩'}
        },
        巨魔王 = {
            模型 = '巨魔王',
            ID = 9,
            染色方案 = 2601,
            性别 = '男',
            种族 = '魔',
            门派 = {'狮驼岭', '阴曹地府', '魔王寨', '无底洞'},
            武器 = {'刀', '斧钺'}
        },
        虎头怪 = {
            模型 = '虎头怪',
            ID = 10,
            染色方案 = 2608,
            性别 = '男',
            种族 = '魔',
            门派 = {'狮驼岭', '阴曹地府', '魔王寨', '无底洞'},
            武器 = {'斧钺', '锤子'}
        },
        舞天姬 = {模型 = '舞天姬', ID = 11, 染色方案 = 2610, 性别 = '女', 种族 = '仙', 门派 = {'天宫', '普陀山', '龙宫', '凌波城'}, 武器 = {'飘带', '环圈'}},
        玄彩娥 = {模型 = '玄彩娥', ID = 12, 染色方案 = 2610, 性别 = '女', 种族 = '仙', 门派 = {'天宫', '普陀山', '龙宫', '凌波城'}, 武器 = {'飘带', '魔棒'}},
        羽灵神 = {模型 = '羽灵神', ID = 13, 染色方案 = 2610, 性别 = '男', 种族 = '仙', 门派 = {'天宫', '普陀山', '龙宫', '凌波城'}, 武器 = {'法杖', '弓弩'}},
        神天兵 = {模型 = '神天兵', ID = 14, 染色方案 = 2610, 性别 = '男', 种族 = '仙', 门派 = {'天宫', '五庄观', '龙宫', '凌波城'}, 武器 = {'锤', '枪矛'}},
        龙太子 = {模型 = '龙太子', ID = 15, 染色方案 = 2606, 性别 = '男', 种族 = '仙', 门派 = {'天宫', '五庄观', '龙宫', '凌波城'}, 武器 = {'扇', '枪矛'}},
        桃夭夭 = {模型 = '桃夭夭', ID = 16, 染色方案 = 2614, 性别 = '女', 种族 = '仙', 门派 = {'天宫', '普陀山', '龙宫', '凌波城'}, 武器 = {'灯笼'}},
        偃无师 = {
            模型 = '偃无师',
            ID = 17,
            染色方案 = 2610,
            性别 = '男',
            种族 = '人',
            门派 = {'大唐官府', '化生寺', '方寸山', '神木林'},
            武器 = {'剑', '巨剑'}
        },
        鬼潇潇 = {
            模型 = '鬼潇潇',
            ID = 18,
            染色方案 = 2614,
            性别 = '女',
            种族 = '魔',
            门派 = {'盘丝洞', '阴曹地府', '魔王寨', '无底洞'},
            武器 = {'爪刺', '伞'}
        }
        -- 飞燕女 = {模型="飞燕女",ID=1,染色方案=3,性别="女",种族="人",门派={"大唐官府","女儿村","方寸山","神木林"},武器={"双剑","环圈"}},
        -- 英女侠 = {模型="英女侠",ID=2,染色方案=4,性别="女",种族="人",门派={"大唐官府","女儿村","方寸山","神木林"},武器={"双剑","鞭"}},
        -- 巫蛮儿 = {模型="巫蛮儿",ID=3,染色方案=1,性别="女",种族="人",门派={"大唐官府","女儿村","方寸山","神木林"},武器={"宝珠","法杖"}},
        -- 逍遥生 = {模型="逍遥生",ID=4,染色方案=1,性别="男",种族="人",门派={"大唐官府","化生寺","方寸山","神木林"},武器={"扇","剑"}},
        -- 剑侠客 = {模型="剑侠客",ID=5,染色方案=2,性别="男",种族="人",门派={"大唐官府","化生寺","方寸山","神木林"},武器={"刀","剑"}},
        -- 狐美人 = {模型="狐美人",ID=6,染色方案=7,性别="女",种族="魔",门派={"盘丝洞","阴曹地府","魔王寨","无底洞"},武器={"爪刺","鞭"}},
        -- 骨精灵 = {模型="骨精灵",ID=7,染色方案=8,性别="女",种族="魔",门派={"盘丝洞","阴曹地府","魔王寨","无底洞"},武器={"魔棒","爪刺"}},
        -- 杀破狼 = {模型="杀破狼",ID=8,染色方案=1,性别="男",种族="魔",门派={"狮驼岭","阴曹地府","魔王寨","无底洞"},武器={"宝珠","弓弩"}},
        -- 巨魔王 = {模型="巨魔王",ID=9,染色方案=5,性别="男",种族="魔",门派={"狮驼岭","阴曹地府","魔王寨","无底洞"},武器={"刀","斧钺"}},
        -- 虎头怪 = {模型="虎头怪",ID=10,染色方案=6,性别="男",种族="魔",门派={"狮驼岭","阴曹地府","魔王寨","无底洞"},武器={"斧钺","锤子"}},
        -- 舞天姬 = {模型="舞天姬",ID=11,染色方案=11,性别="女",种族="仙",门派={"天宫","普陀山","龙宫","凌波城"},武器={"飘带","环圈"}},
        -- 玄彩娥 = {模型="玄彩娥",ID=12,染色方案=12,性别="女",种族="仙",门派={"天宫","普陀山","龙宫","凌波城"},武器={"飘带","魔棒"}},
        -- 羽灵神 = {模型="羽灵神",ID=13,染色方案=1,性别="男",种族="仙",门派={"天宫","普陀山","龙宫","凌波城"},武器={"法杖","弓弩"}},
        -- 神天兵 = {模型="神天兵",ID=14,染色方案=9,性别="男",种族="仙",门派={"天宫","五庄观","龙宫","凌波城"},武器={"锤","枪矛"}},
        -- 龙太子 = {模型="龙太子",ID=15,染色方案=10,性别="男",种族="仙",门派={"天宫","五庄观","龙宫","凌波城"},武器={"扇","枪矛"}},
        -- 桃夭夭 = {模型="桃夭夭",ID=16,染色方案=1,性别="女",种族="仙",门派={"天宫","普陀山","龙宫","凌波城"},武器={"灯笼"}},
        -- 偃无师 = {模型="偃无师",ID=17,染色方案=1,性别="男",种族="人",门派={"大唐官府","化生寺","方寸山","神木林"},武器={"剑","巨剑"}},
        -- 鬼潇潇 = {模型="鬼潇潇",ID=18,染色方案=2,性别="女",种族="魔",门派={"盘丝洞","阴曹地府","魔王寨","无底洞"},武器={"爪刺","伞"}},
    }
    return 角色信息[模型]
end

function 场景类_场景:取初始属性(种族)
    local 属性 = {
        人 = {10, 10, 10, 10, 10},
        魔 = {12, 11, 11, 8, 8},
        仙 = {12, 5, 11, 12, 10}
    }
    return 属性[种族]
end

function 场景类_场景:取属性(种族, 五维, 技能)
    local 属性 = {}
    local 力量 = 五维[3]
    local 体力 = 五维[1]
    local 魔力 = 五维[2]
    local 耐力 = 五维[4]
    local 敏捷 = 五维[5]
    技能 = 技能 or {0, 0, 0, 0}
    if 种族 == '人' or 种族 == 1 then
        属性 = {
            命中 = ceil(力量 * 2 + 30),
            伤害 = ceil(力量 * 0.67 + 39),
            防御 = ceil(耐力 * 1.5),
            速度 = ceil(敏捷),
            灵力 = ceil(体力 * 0.3 + 魔力 * 0.7 + 耐力 * 0.2 + 力量 * 0.4),
            躲避 = ceil(敏捷 + 10),
            气血 = ceil((体力 * 5 + 100) * (1 + 技能[1] / 100) + 技能[3] * 4),
            法力 = ceil((魔力 * 3 + 80) * (1 + 技能[2] / 100))
        }
    elseif 种族 == '魔' or 种族 == 2 then
        属性 = {
            命中 = ceil(力量 * 2.3 + 29),
            伤害 = ceil(力量 * 0.77 + 39),
            防御 = ceil(耐力 * 214 / 153),
            速度 = ceil(敏捷),
            灵力 = ceil(体力 * 0.3 + 魔力 * 0.7 + 耐力 * 0.2 + 力量 * 0.4 - 0.3),
            躲避 = ceil(敏捷 + 10),
            气血 = ceil((体力 * 6 + 100) * (1 + 技能[1] / 100) + 技能[3] * 4),
            法力 = ceil((魔力 * 2.5 + 80) * (1 + 技能[2] / 100))
        }
    elseif 种族 == '仙' or 种族 == 3 then
        属性 = {
            命中 = ceil(力量 * 1.7 + 30),
            伤害 = ceil(力量 * 0.57 + 39),
            防御 = ceil(耐力 * 1.6),
            速度 = ceil(敏捷),
            灵力 = ceil(体力 * 0.3 + 魔力 * 0.7 + 耐力 * 0.2 + 力量 * 0.4 - 0.3),
            躲避 = ceil(敏捷 + 10),
            气血 = ceil((体力 * 4.5 + 100) * (1 + 技能[1] / 100) + 技能[3] * 4),
            法力 = ceil((魔力 * 3.5 + 80) * (1 + 技能[2] / 100))
        }
    end
    return 属性
end

function 场景类_场景:取经验(id, lv)
    local exp = {}
    if id == 1 then
        exp = {
            40,
            110,
            237,
            450,
            779,
            1252,
            1898,
            2745,
            3822,
            5159,
            6784,
            8726,
            11013,
            13674,
            16739,
            20236,
            24194,
            28641,
            33606,
            39119,
            45208,
            51902,
            55229,
            67218,
            75899,
            85300,
            95450,
            106377,
            118110,
            130679,
            144112,
            158438,
            173685,
            189882,
            207059,
            225244,
            244466,
            264753,
            286134,
            308639,
            332296,
            357134,
            383181,
            410466,
            439019,
            468868,
            500042,
            532569,
            566478,
            601799,
            638560,
            676790,
            716517,
            757770,
            800579,
            844972,
            890978,
            938625,
            987942,
            1038959,
            1091704,
            1146206,
            1202493,
            1260594,
            1320539,
            1382356,
            1446074,
            1511721,
            1579326,
            1648919,
            1720528,
            1794182,
            1869909,
            1947738,
            2027699,
            2109820,
            2194130,
            2280657,
            2369431,
            2460479,
            2553832,
            2649518,
            2747565,
            2848003,
            2950859,
            3056164,
            3163946,
            3274233,
            3387055,
            3502439,
            3620416,
            3741014,
            3864261,
            3990187,
            4118819,
            4250188,
            4384322,
            4521249,
            4660999,
            4803599,
            4998571,
            5199419,
            5406260,
            5619213,
            5838397,
            6063933,
            6295941,
            6534544,
            6779867,
            7032035,
            7291172,
            7557407,
            7830869,
            8111686,
            8399990,
            8695912,
            8999586,
            9311145,
            9630726,
            9958463,
            10294496,
            10638964,
            10992005,
            11353761,
            11724374,
            12103988,
            12492748,
            12890799,
            13298287,
            13715362,
            14142172,
            14578867,
            15025600,
            15482522,
            15949788,
            16427552,
            16915970,
            17415202,
            17925402,
            18446732,
            18979354,
            19523428,
            20079116,
            20646584,
            21225998,
            43635044,
            44842648,
            46075148,
            47332886,
            48616200,
            74888148,
            76891401,
            78934581,
            81018219,
            83142835,
            85308969,
            87977421,
            89767944,
            92061870,
            146148764,
            150094780,
            154147340,
            158309318,
            162583669,
            166973428,
            171481711,
            176111717,
            180866734,
            185780135,
            240602904,
            533679362,
            819407100,
            1118169947,
            1430306664,
            1756161225,
            2096082853
        }
    else
        exp = {
            50,
            200,
            450,
            800,
            1250,
            1800,
            2450,
            3250,
            4050,
            5000,
            6050,
            7200,
            8450,
            9800,
            11250,
            12800,
            14450,
            16200,
            18050,
            20000,
            22050,
            24200,
            26450,
            28800,
            31250,
            33800,
            36450,
            39200,
            42050,
            45000,
            48050,
            51200,
            54450,
            57800,
            61250,
            64800,
            68450,
            72200,
            76050,
            80000,
            84050,
            88200,
            92450,
            96800,
            101250,
            105800,
            110450,
            115200,
            120050,
            125000,
            130050,
            135200,
            140450,
            145800,
            151250,
            156800,
            162450,
            168200,
            174050,
            180000,
            186050,
            192200,
            198450,
            204800,
            211250,
            217800,
            224450,
            231200,
            238050,
            245000,
            252050,
            259200,
            266450,
            273800,
            281250,
            288800,
            296450,
            304200,
            312050,
            320000,
            328050,
            336200,
            344450,
            352800,
            361250,
            369800,
            378450,
            387200,
            396050,
            405000,
            414050,
            423200,
            432450,
            441800,
            451250,
            460800,
            470450,
            480200,
            490050,
            500000,
            510050,
            520200,
            530450,
            540800,
            551250,
            561800,
            572450,
            583200,
            594050,
            605000,
            616050,
            627200,
            638450,
            649800,
            661250,
            672800,
            684450,
            696200,
            708050,
            720000,
            732050,
            744200,
            756450,
            768800,
            781250,
            793800,
            806450,
            819200,
            832050,
            845000,
            858050,
            871200,
            884450,
            897800,
            911250,
            924800,
            938450,
            952200,
            966050,
            980000,
            994050,
            1008200,
            1022450,
            1036800,
            1051250,
            1065800,
            1080450,
            1095200,
            1110050,
            1125000,
            1140050,
            1155200,
            1170450,
            1185800,
            1201250,
            1216800,
            1232450,
            1248200,
            1264050,
            1280000,
            1300000,
            1340000,
            1380000,
            1420000,
            1460000,
            1500000,
            1540000,
            1580000,
            1700000,
            1780000,
            1820000,
            1940000,
            2400000,
            2880000,
            3220000,
            4020000,
            4220000,
            4420000,
            4620000,
            5220000,
            5820000,
            6220000,
            7020000,
            8020000,
            9020000
        }
    end
    return exp[lv + 1]
end

function 场景类_场景:取称谓说明(称谓)
    local n = {}
    n['梦幻测试'] = '欢迎测试梦幻西游(本称谓为纪念称谓)#91'
    n['梦幻新秀'] = '欢迎测试梦幻西游(本称谓为纪念称谓)#91'
    n['内测用户'] = '欢迎测试梦幻西游(本称谓为纪念称谓)#91'
    n['梦幻助战'] = '欢迎使用梦幻西游助战(本称谓为纪念称谓)#104'
    n['无称谓'] = '对不起!你目前无称谓哦,请继续加油.#9'
    n['帮众'] = '帮派证明身份的基础标识.#9'
    n['堂主'] = '作为一帮堂主的身份标识.#9'
    n['长老'] = '作为一帮长老的身份标识.#9'
    n['护法'] = '作为一帮护法的身份标识.#9'
    n['帮主'] = '作为一帮帮主的身份标识.#9'
    if 称谓 ~= nil and n[称谓] == nil and n[string.sub(称谓, -4)] == nil then
        n[称谓] = '暂时没有该称谓的记载!.#9'
    elseif 称谓 ~= nil and n[string.sub(称谓, -4)] ~= nil then
        return n[string.sub(称谓, -4)]
    end
    if 称谓 == nil or 称谓 == '' then
        return '对不起!你目前无称谓哦,请继续加油.#9'
    end
    return n[称谓]
end

function 场景类_场景:取武器附加名称(子类, 级别限制, 名称)
    if 子类 == 1 then
        if 级别限制 < 21 then
            return '红缨枪'
        elseif 级别限制 > 20 and 级别限制 < 51 then
            return '乌金三叉戟'
        elseif 级别限制 > 59 and 级别限制 < 90 then
            return '玄铁矛'
        end
    elseif 子类 == 2 then
        if 级别限制 < 21 then
            return '青铜斧'
        elseif 级别限制 > 20 and 级别限制 < 51 then
            return '双弦钺'
        elseif 级别限制 > 59 and 级别限制 < 90 then
            return '乌金鬼头镰'
        end
    elseif 子类 == 3 then
        if 级别限制 < 21 then
            return '青铜短剑'
        elseif 级别限制 > 20 and 级别限制 < 51 then
            return '青锋剑'
        elseif 级别限制 > 59 and 级别限制 < 90 then
            return '游龙剑'
        end
    elseif 子类 == 4 then
        if 级别限制 < 21 then
            return '双短剑'
        elseif 级别限制 > 20 and 级别限制 < 51 then
            return '竹节双剑'
        elseif 级别限制 > 59 and 级别限制 < 90 then
            return '赤焰双剑'
        end
    elseif 子类 == 5 then
        if 级别限制 < 21 then
            return '五色缎带'
        elseif 级别限制 > 20 and 级别限制 < 51 then
            return '无极丝'
        elseif 级别限制 > 59 and 级别限制 < 90 then
            return '七彩罗刹'
        end
    elseif 子类 == 6 then
        if 级别限制 < 21 then
            return '铁爪'
        elseif 级别限制 > 20 and 级别限制 < 51 then
            return '青龙牙'
        elseif 级别限制 > 59 and 级别限制 < 90 then
            return '青刚刺'
        end
    elseif 子类 == 7 then
        if 级别限制 < 21 then
            return '折扇'
        elseif 级别限制 > 20 and 级别限制 < 51 then
            return '铁面扇'
        elseif 级别限制 > 59 and 级别限制 < 90 then
            return '神火扇'
        end
    elseif 子类 == 8 then
        if 级别限制 < 21 then
            return '细木棒'
        elseif 级别限制 > 20 and 级别限制 < 51 then
            return '点金棒'
        elseif 级别限制 > 59 and 级别限制 < 90 then
            return '满天星'
        end
    elseif 子类 == 9 then
        if 级别限制 < 21 then
            return '松木锤'
        elseif 级别限制 > 20 and 级别限制 < 51 then
            return '狼牙锤'
        elseif 级别限制 > 59 and 级别限制 < 90 then
            return '震天锤'
        end
    elseif 子类 == 10 then
        if 级别限制 < 21 then
            return '牛皮鞭'
        elseif 级别限制 > 20 and 级别限制 < 51 then
            return '钢结鞭'
        elseif 级别限制 > 59 and 级别限制 < 90 then
            return '青藤柳叶鞭'
        end
    elseif 子类 == 11 then
        if 级别限制 < 21 then
            return '黄铜圈'
        elseif 级别限制 > 20 and 级别限制 < 51 then
            return '金刺轮'
        elseif 级别限制 > 59 and 级别限制 < 90 then
            return '蛇形月'
        end
    elseif 子类 == 12 then
        if 级别限制 < 21 then
            return '柳叶刀'
        elseif 级别限制 > 20 and 级别限制 < 51 then
            return '金背大砍刀'
        elseif 级别限制 > 59 and 级别限制 < 90 then
            return '狼牙刀'
        end
    elseif 子类 == 13 then
        if 级别限制 < 21 then
            return '曲柳杖'
        elseif 级别限制 > 20 and 级别限制 < 51 then
            return '墨铁拐'
        elseif 级别限制 > 59 and 级别限制 < 90 then
            return '腾云杖'
        end
    elseif 子类 == 14 then
        if 级别限制 < 21 then
            return '硬木弓'
        elseif 级别限制 > 20 and 级别限制 < 51 then
            return '宝雕长弓'
        elseif 级别限制 > 59 and 级别限制 < 90 then
            return '连珠神弓'
        end
    elseif 子类 == 15 then
        if 级别限制 < 21 then
            return '琉璃珠'
        elseif 级别限制 > 20 and 级别限制 < 51 then
            return '翡翠珠'
        elseif 级别限制 > 59 and 级别限制 < 90 then
            return '如意宝珠'
        end
    elseif 子类 == 16 then
        if 级别限制 < 21 then
            return '钝铁重剑'
        elseif 级别限制 > 20 and 级别限制 < 51 then
            return '壁玉长铗'
        elseif 级别限制 > 59 and 级别限制 < 90 then
            return '惊涛雪'
        end
    elseif 子类 == 17 then
        if 级别限制 < 21 then
            return '红罗伞'
        elseif 级别限制 > 20 and 级别限制 < 51 then
            return '琳琅盖'
        elseif 级别限制 > 59 and 级别限制 < 90 then
            return '金刚伞'
        end
    elseif 子类 == 18 then
        if 级别限制 < 21 then
            return '素纸灯'
        elseif 级别限制 > 20 and 级别限制 < 51 then
            return '如意宫灯'
        elseif 级别限制 > 59 and 级别限制 < 90 then
            return '玉兔盏'
        end
    end
    return 名称
end

function 场景类_场景:取武器子类(子类)
    local n = {
        '枪矛',
        '斧钺',
        '剑',
        '双短剑',
        '飘带',
        '爪刺',
        '扇',
        '魔棒',
        '锤',
        '鞭',
        '环圈',
        '刀',
        '法杖',
        '弓弩',
        '宝珠',
        '巨剑',
        '伞',
        '灯笼',
        '头盔',
        '发钗',
        '项链',
        '女衣',
        '男衣',
        '腰带',
        '鞋子'
    }
    return n[子类]
end
function 场景类_场景:取门派技能(门派)
    local n = {}
    if 门派 == '大唐官府' then
        return {'为官之道', '无双一击', '神兵鉴赏', '疾风步', '十方无敌', '紫薇之术', '文韬武略'}
    elseif 门派 == '方寸山' then
        return {'黄庭经', '磐龙灭法', '霹雳咒', '符之术', '归元心法', '神道无念', '斜月步'}
    elseif 门派 == '化生寺' then
        return {'小乘佛法', '金刚伏魔', '诵经', '佛光普照', '大慈大悲', '歧黄之术', '渡世步'}
    elseif 门派 == '女儿村' then
        return {'毒经', '倾国倾城', '沉鱼落雁', '闭月羞花', '香飘兰麝', '玉质冰肌', '清歌妙舞'}
    elseif 门派 == '阴曹地府' then
        return {'灵通术', '六道轮回', '幽冥术', '拘魂诀', '九幽阴魂', '尸腐恶', '无常步'}
    elseif 门派 == '魔王寨' then
        return {'牛逼神功', '震天诀', '火云术', '火牛阵', '牛虱阵', '回身击', '裂石步'}
    elseif 门派 == '狮驼岭' then
        return {'魔兽神功', '生死搏', '训兽诀', '阴阳二气诀', '狂兽诀', '大鹏展翅', '魔兽反噬'}
    elseif 门派 == '盘丝洞' then
        return {'蛛丝阵法', '迷情大法', '秋波暗送', '天外魔音', '盘丝大法', '盘丝步', '姊妹相随'}
    elseif 门派 == '天宫' then
        return {'天罡气', '傲世诀', '清明自在', '宁气诀', '乾坤塔', '混天术', '云霄步'}
    elseif 门派 == '五庄观' then
        return {'周易学', '潇湘仙雨', '乾坤袖', '修仙术', '混元道果', '明性修身', '七星遁'}
    elseif 门派 == '龙宫' then
        return {'九龙诀', '破浪诀', '呼风唤雨', '龙腾术', '逆鳞术', '游龙术', '龙附术'}
    elseif 门派 == '普陀山' then
        return {'灵性', '护法金刚', '观音咒', '五行学说', '金刚经', '五行扭转', '莲花宝座'}
    elseif 门派 == '神木林' then
        return {'瞬息万变', '万灵诸念', '巫咒', '万物轮转', '天人庇护', '神木恩泽', '驭灵咒'}
    elseif 门派 == '凌波城' then
        return {'天地无极', '九转玄功', '武神显圣', '啸傲', '气吞山河', '诛魔', '法天象地'}
    elseif 门派 == '无底洞' then
        return {'枯骨心法', '阴风绝章', '鬼蛊灵蕴', '燃灯灵宝', '地冥妙法', '混元神功', '秘影迷踪'}
    end
end

function 场景类_场景:取门派主技能(门派)
    if 门派 == 1 then
        a = {'催眠符', '落雷符', '追魂符', '五雷咒', '定身符', '定身符'}
    elseif 门派 == 2 then
        a = {'红袖添香', '楚楚可怜', '满天花雨', '雨落寒沙', '莲步轻舞', '如花解语'}
    elseif 门派 == 3 then
        a = {'落叶萧萧', '冰川怒', '血雨', '雾杀', '星月之惠', '蜜润'}
    elseif 门派 == 4 then
        a = {'唧唧歪歪', '韦陀护法', '金刚护体', '达摩护体', '一苇渡江', '金刚护法', '我佛慈悲', '推拿', '解毒', '活血', '推气过宫', '妙手回春', '救死扶伤'}
    elseif 门派 == 5 then
        a = {'杀气决', '后发制人', '横扫千军', '破釜沉舟'}
    elseif 门派 == 6 then
        a = {'还阳术', '阎罗令', '判官令'}
    elseif 门派 == 7 then
        a = {'勾魂', '摄魄', '含情脉脉'}
    elseif 门派 == 8 then
        a = {'移魂化骨', '夺魄令', '煞气决', '惊魂掌', '摧心术', '夺命咒', '地涌金莲'}
    elseif 门派 == 9 then
        a = {'三昧真火', '飞砂走石', '牛劲'}
    elseif 门派 == 10 then
        a = {'连环击', '鹰击', '狮搏', '象形', '变身'}
    elseif 门派 == 11 then
        a = {'五雷轰顶', '天雷斩', '百万神兵', '天神护体', '天神护法', '雷霆万钧'}
    elseif 门派 == 12 then
        a = {'普渡众生', '紧箍咒', '杨柳甘露', '日光华', '靛沧海', '巨岩破', '苍茫树', '地裂火', '颠倒五行', '灵动九天'}
    elseif 门派 == 13 then
        a = {'不动如山', '碎星诀', '裂石', '浪涌', '断岳势', '天崩地裂', '翻江搅海', '惊涛怒'}
    elseif 门派 == 14 then
        a = {'烟雨剑法', '飘渺式', '日月乾坤', '炼气化神', '生命之泉', '三花聚顶'}
    elseif 门派 == 15 then
        a = {'龙卷雨击', '龙腾', '龙吟', '逆鳞', '乘风破浪', '双龙戏珠'}
    end
    return a
end

function 场景类_场景:取包含技能(名称)
    local 技能 = {
        为官之道 = {'杀气诀'},
        无双一击 = {'后发制人'},
        神兵鉴赏 = {'兵器谱'},
        疾风步 = {'千里神行'},
        十方无敌 = {'横扫千军', '破釜沉舟'},
        紫薇之术 = {'斩龙诀'},
        文韬武略 = {'反间之计', '安神诀', '嗜血'},
        黄庭经 = {'三星灭魔'},
        磐龙灭法 = {nil},
        霹雳咒 = {'五雷咒'},
        符之术 = {'飞行符', '兵解符', '催眠符', '失心符', '落魄符', '失忆符', '追魂符', '离魂符', '失魂符', '定身符', '碎甲符', '落雷符'},
        归元心法 = {'归元咒', '凝神术'},
        神道无念 = {'乾天罡气', '分身术', '神兵护法'},
        斜月步 = {'乙木仙遁'},
        小乘佛法 = {'紫气东来'},
        金刚伏魔 = {'佛法无边'},
        诵经 = {'唧唧歪歪'},
        佛光普照 = {'达摩护体', '金刚护法', '韦陀护法', '金刚护体', '一苇渡江', '拈花妙指'},
        大慈大悲 = {'我佛慈悲'},
        歧黄之术 = {'推拿', '活血', '推气过宫', '妙手回春', '救死扶伤', '解毒', '舍身取义'},
        渡世步 = {'佛门普渡'},
        毒经 = {nil},
        倾国倾城 = {'红袖添香', '楚楚可怜', '一笑倾城'},
        沉鱼落雁 = {'满天花雨', '情天恨海', '雨落寒沙'},
        闭月羞花 = {'莲步轻舞', '如花解语', '似玉生香', '娉婷嬝娜'},
        香飘兰麝 = {'轻如鸿毛'},
        玉质冰肌 = {'百毒不侵'},
        清歌妙舞 = {'移形换影', '飞花摘叶'},
        灵通术 = {'堪察令', '寡欲令'},
        六道轮回 = {'魂飞魄散'},
        幽冥术 = {'阎罗令', '锢魂术', '黄泉之息'},
        拘魂诀 = {'判官令', '还阳术', '尸气漫天'},
        九幽阴魂 = {'幽冥鬼眼', '冤魂不散'},
        尸腐恶 = {'尸腐毒', '修罗隐身'},
        无常步 = {'杳无音讯'},
        牛逼神功 = {'魔王护持'},
        震天诀 = {'魂飞魄散'},
        火云术 = {'飞砂走石', '三昧真火', '火甲术'},
        火牛阵 = {'牛劲', '踏山裂石'},
        牛虱阵 = {'无敌牛虱', '无敌牛妖', '摇头摆尾'},
        回身击 = {'魔王回首'},
        裂石步 = {'牛屎遁'},
        魔兽神功 = {'变身', '魔兽啸天'},
        生死搏 = {'象形', '鹰击', '狮搏', '天魔解体'},
        训兽诀 = {'威慑'},
        阴阳二气诀 = {'定心术', '魔息术'},
        狂兽诀 = {'连环击', '神力无穷'},
        大鹏展翅 = {'振翅千里'},
        魔兽反噬 = {'极度疯狂'},
        蛛丝阵法 = {'盘丝舞', '夺命蛛丝'},
        迷情大法 = {'含情脉脉', '瘴气', '魔音摄魂'},
        秋波暗送 = {'勾魂', '摄魄'},
        天外魔音 = {nil},
        盘丝大法 = {'盘丝阵', '复苏'},
        盘丝步 = {'天罗地网', '天蚕丝', '幻镜术'},
        姊妹相随 = {'姐妹同心'},
        天罡气 = {'天神护体', '天神护法', '天诛地灭', '五雷轰顶', '雷霆万钧', '浩然正气'},
        傲世诀 = {'天雷斩'},
        清明自在 = {'知己知彼'},
        宁气诀 = {'宁心'},
        乾坤塔 = {'镇妖', '错乱'},
        混天术 = {'百万神兵', '金刚镯'},
        云霄步 = {'腾云驾雾'},
        九龙诀 = {'解封', '清心', '二龙戏珠'},
        破浪诀 = {'神龙摆尾'},
        呼风唤雨 = {'龙卷雨击'},
        龙腾术 = {'龙腾'},
        逆鳞术 = {'逆鳞'},
        游龙术 = {'乘风破浪', '水遁'},
        龙附术 = {'龙吟', '龙啸九天', '龙附'},
        灵性 = {'自在心法'},
        护法金刚 = {nil},
        观音咒 = {'紧箍咒', '杨柳甘露'},
        五行学说 = {'日光华', '靛沧海', '巨岩破', '苍茫树', '地裂火'},
        金刚经 = {'普渡众生', '灵动九天', '莲华妙法'},
        五行扭转 = {'五行错位', '颠倒五行'},
        莲花宝座 = {'坐莲'},
        周易学 = {'驱魔', '驱尸'},
        潇湘仙雨 = {'烟雨剑法', '飘渺式'},
        乾坤袖 = {'日月乾坤', '天地同寿', '乾坤妙法'},
        修仙术 = {'炼气化神', '生命之泉', '太极生化', '一气化三清'},
        混元道果 = {nil},
        明性修身 = {'三花聚顶'},
        七星遁 = {'斗转星移'},
        瞬息万变 = {'落叶萧萧'},
        万灵诸念 = {'荆棘舞', '尘土刃', '冰川怒'},
        巫咒 = {'雾杀', '血雨'},
        万物轮转 = {'星月之惠'},
        天人庇护 = {'炎护', '叶隐'},
        神木恩泽 = {'神木呓语'},
        驭灵咒 = {'蜜润', '蝼蚁蚀天'},
        天地无极 = {nil},
        九转玄功 = {'不动如山'},
        武神显圣 = {'碎星诀', '镇魂诀'},
        啸傲 = {nil},
        气吞山河 = {'裂石', '断岳势', '天崩地裂', '浪涌', '惊涛怒', '翻江搅海'},
        诛魔 = {'腾雷', '指地成钢'},
        法天象地 = {'无穷妙道', '纵地金光'},
        枯骨心法 = {'移魂化骨'},
        阴风绝章 = {'夺魄令', '煞气诀', '惊魂掌', '摧心术'},
        鬼蛊灵蕴 = {'夺命咒'},
        燃灯灵宝 = {'明光宝烛', '金身舍利'},
        地冥妙法 = {'地涌金莲', '万木凋枯'},
        混元神功 = {'元阳护体'},
        秘影迷踪 = {'遁地术'},
        天火献誓 = {nil},
        天罚之焰 = {'炽火流离', '极天炼焰'},
        煌火无明 = {'谜毒之缚', '诡蝠之刑', '怨怖之泣', '誓血之祭'},
        化神以灵 = {'唤灵·魂火', '唤魔·堕羽', '唤魔·毒魅', '唤灵·焚魂', '天魔觉醒'},
        弹指成烬 = {'净世煌火', '焚魔烈焰'},
        藻光灵狱 = {'幽影灵魄'},
        离魂 = {'魂兮归来'},
        神工无形 = {'一发而动'},
        攻玉以石 = {'针锋相对', '攻守易位'},
        擎天之械 = {'锋芒毕露'},
        千机奇巧 = {'诱袭', '匠心·破击'},
        匠心不移 = {'匠心·削铁', '匠心·固甲', '匠心·蓄锐'},
        运思如电 = {'天马行空'},
        探奥索隐 = {'鬼斧神工', '移山填海'},
        神通广大 = {'威震凌霄', '气慑天军'},
        如意金箍 = {'当头一棒', '神针撼海', '杀威铁棒', '泼天乱棒'},
        齐天逞胜 = {'九幽除名', '移星换斗', '云暗天昏'},
        金刚之躯 = {'担山赶月', '铜头铁臂'},
        灵猴九窍 = {'无所遁形', '天地洞明', '除光息焰'},
        七十二变 = {'呼子唤孙', '八戒上身'},
        腾云驾霧 = {'筋斗云'}
    }
    return 技能[名称]
end

function 场景类_场景:取辅助技能()
    return {'强身术', '冥想', '暗器技巧', '打造技巧', '裁缝技巧', '炼金术', '中药医理', '烹饪技巧', '逃离技巧', '追捕技巧', '养生之道', '健身术', '巧匠之术'}
end

function 场景类_场景:取师傅门派(ID, 名称)
    local 师门 = nil
    if 名称 == '程咬金' then
        师门 = '大唐官府'
    elseif 名称 == '地藏王' then
        师门 = '阴曹地府'
    elseif 名称 == '二郎神' then
        师门 = '凌波城'
    elseif 名称 == '大大王' then
        师门 = '狮驼岭'
    elseif 名称 == '空度禅师' then
        师门 = '化生寺'
    elseif 名称 == '巫奎虎' then
        师门 = '神木林'
    elseif 名称 == '地涌夫人' then
        师门 = '无底洞'
    elseif 名称 == '菩提祖师' then
        师门 = '方寸山'
    elseif 名称 == '孙婆婆' then
        师门 = '女儿村'
    elseif 名称 == '白晶晶' then
        师门 = '盘丝洞'
    elseif 名称 == '李靖' then
        师门 = '天宫'
    elseif 名称 == '观音姐姐' then
        师门 = '普陀山'
    elseif 名称 == '镇元子' then
        师门 = '五庄观'
    elseif 名称 == '东海龙王' then
        师门 = '龙宫'
    elseif 名称 == '牛魔王' then
        师门 = '魔王寨'
    end
    return 师门
end

function 场景类_场景:取师门地图(师门)
    local 地图
    if 师门 == '化生寺' then
        地图 = 1002
    elseif 师门 == '方寸山' then
        地图 = 1135
    elseif 师门 == '女儿村' then
        地图 = 1142
    elseif 师门 == '神木林' then
        地图 = 1138
    elseif 师门 == '大唐官府' then
        地图 = 1198
    elseif 师门 == '阴曹地府' then
        地图 = 1122
    elseif 师门 == '盘丝洞' then
        地图 = 1513
    elseif 师门 == '无底洞' then
        地图 = 1139
    elseif 师门 == '魔王寨' then
        地图 = 1512
    elseif 师门 == '狮驼岭' then
        地图 = 1131
    elseif 师门 == '天宫' then
        地图 = 1111
    elseif 师门 == '普陀山' then
        地图 = 1140
    elseif 师门 == '凌波城' then
        地图 = 1150
    elseif 师门 == '五庄观' then
        地图 = 1146
    elseif 师门 == '龙宫' then
        地图 = 1116
    end
    return 地图
end

function 场景类_场景:取坐标师傅(ID, 名称)
    local 师门 = nil
    if ID == 1043 and 名称 == '空度禅师' then
        师门 = '化生寺'
    elseif ID == 1054 and 名称 == '程咬金' then
        师门 = '大唐官府'
    elseif ID == 1117 and 名称 == '东海龙王' then
        师门 = '龙宫'
    elseif ID == 1137 and 名称 == '菩提祖师' then
        师门 = '方寸山'
    elseif ID == 1124 and 名称 == '地藏王' then
        师门 = '阴曹地府'
    elseif ID == 1112 and 名称 == '李靖' then
        师门 = '天宫'
    elseif ID == 1145 and 名称 == '牛魔王' then
        师门 = '魔王寨'
    elseif ID == 1141 and 名称 == '观音姐姐' then
        师门 = '普陀山'
    elseif ID == 1147 and 名称 == '镇元子' then
        师门 = '五庄观'
    elseif ID == 1134 and 名称 == '大大王' then
        师门 = '狮驼岭'
    elseif ID == 1144 and 名称 == '白晶晶' then
        师门 = '盘丝洞'
    elseif ID == 1150 and 名称 == '二郎神' then
        师门 = '凌波城'
    elseif ID == 1154 and 名称 == '巫奎虎' then
        师门 = '神木林'
    elseif ID == 1156 and 名称 == '地涌夫人' then
        师门 = '无底洞'
    elseif ID == 1143 and 名称 == '孙婆婆' then
        师门 = '女儿村'
    end
    return 师门
end

function 场景类_场景:刷新队伍()
    if self.窗口.召唤兽属性栏.可视 then
        for s = 1, 7 do
            if self.队伍[1].宝宝列表[s] ~= nil then
                self.队伍[1].宝宝列表[s].潜力 =
                    self.队伍[1].宝宝列表[s].潜力 +
                    (self.窗口.召唤兽属性栏.临时潜力[s].体质 + self.窗口.召唤兽属性栏.临时潜力[s].魔力 + self.窗口.召唤兽属性栏.临时潜力[s].力量 +
                        self.窗口.召唤兽属性栏.临时潜力[s].耐力 +
                        self.窗口.召唤兽属性栏.临时潜力[s].敏捷)
            end
            self.窗口.召唤兽属性栏.临时潜力[s] = {体质 = 0, 魔力 = 0, 力量 = 0, 耐力 = 0, 敏捷 = 0}
            self.窗口.召唤兽属性栏.预览属性[s] = {气血 = 0, 魔法 = 0, 伤害 = 0, 速度 = 0, 灵力 = 0, 防御 = 0}
        end
    end
    if self.窗口.人物状态栏.可视 then
        self.队伍[1].潜力 =
            self.队伍[1].潜力 +
            (self.窗口.人物状态栏.临时潜力.体质 + self.窗口.人物状态栏.临时潜力.魔力 + self.窗口.人物状态栏.临时潜力.力量 + self.窗口.人物状态栏.临时潜力.耐力 +
                self.窗口.人物状态栏.临时潜力.敏捷)
        self.窗口.人物状态栏.临时潜力 = {体质 = 0, 魔力 = 0, 力量 = 0, 耐力 = 0, 敏捷 = 0}
        self.窗口.人物状态栏.预览属性 = {气血 = 0, 魔法 = 0, 命中 = 0, 伤害 = 0, 速度 = 0, 灵力 = 0, 防御 = 0, 法伤 = 0, 躲避 = 0}
    end
    self.窗口.人物状态栏:刷新()
    self.窗口.召唤兽属性栏:刷新()
    self.窗口.道具行囊:刷新()
end

function 场景类_场景:增加经验(exp, id, ts)
    if id == nil then
        for i = 1, #self.队伍 do
            self.队伍[i].当前经验 = self.队伍[i].当前经验 + exp
            if self.队伍[i].参战宝宝.名称 ~= nil then
                self.队伍[i].参战宝宝.当前经验 = self.队伍[i].参战宝宝.当前经验 + exp
            end
        end
    else
        self.队伍[id].当前经验 = self.队伍[id].当前经验 + exp
        if self.队伍[id].参战宝宝.名称 ~= nil then
            self.队伍[id].参战宝宝.当前经验 = self.队伍[id].参战宝宝.当前经验 + exp
        end
    end
    if ts then
        self.提示:写入('#Y/你获得了#G/' .. exp .. '#Y/点经验')
    end
end

function 场景类_场景:平均等级()
    local dj = 0
    for i = 1, #self.队伍 do
        dj = dj + self.队伍[i].等级
    end
    return floor(dj / #self.队伍)
end

function 场景类_场景:指定等级物品(lv, id)
    local wps = self.打造物品[id]
    local random = 引擎.取随机整数
    local ids = floor(lv / 10 + 1)
    if id <= 18 and lv >= 90 and lv <= 140 then
        if ids <= 12 then
            ids = random(10, 12)
        else
            ids = random(13, 15)
        end
    end
    wps = wps[ids]
    if type(wps) == 'table' then
        wps = wps[random(1, 2)]
    end
    return wps
end

-- function 场景类_场景:生成Npc(方式,地图,x,y,模型,名称,方向,编号,染色方案,染色组,称谓,事件ID,执行事件,武器)
-- 	local npc = {地图=地图,名称=名称,称谓=称谓,模型=模型,武器=武器,X=x,Y=y,方向=方向,编号=方式.."_"..名称,染色方案=染色方案,染色组=染色组,事件ID=事件ID,执行事件=执行事件 or "不执行"}
-- 	if 方式 == 1 then
-- 		insert(self.临时Npc,npc)
-- 		if self.当前地图 == 地图 then
-- 			local npc = 假人最终库(npc)
-- 			insert(self.场景.假人,npc)
-- 			insert(self.场景.场景人物,npc)
-- 		end
-- 	end
-- end

-- function 场景类_场景:删除Npc(方式,地图,模型,名称)
-- 	if 方式 == 1 then
-- 		for i=1,#self.临时Npc do
-- 			if self.临时Npc[i].地图 == 地图 and self.临时Npc[i].模型 == 模型 and self.临时Npc[i].名称 == 名称 then
-- 				remove(self.临时Npc,i)
-- 				break
-- 			end
-- 		end
-- 	end
-- 	if self.当前地图 == 地图 then
-- 		for i=1,#self.场景.假人 do
-- 			if self.场景.假人[i].模型 == 模型 and self.场景.假人[i].名称 == 名称 then
-- 				remove(self.场景.假人,i)
-- 				break
-- 			end
-- 		end
-- 		for i=1,#self.场景.场景人物 do
-- 			if self.场景.场景人物[i].模型 == 模型 and self.场景.场景人物[i].名称 == 名称 then
-- 				remove(self.场景.场景人物,i)
-- 				break
-- 			end
-- 		end
-- 	end
-- 	地图 = self:取地图名称(地图)
-- 	for i=1,#self.任务Npc do
-- 		if self.任务Npc[i][1] == 地图 and self.任务Npc[i][2] == 名称 then
-- 			remove(self.任务Npc,i)
-- 			break
-- 		end
-- 	end
-- end

function 场景类_场景:播放特效(地图, 模型, 名称, 特效, 帧率)
    if self.当前地图 == 地图 then
        for i = 1, #self.场景.假人 do
            if self.场景.假人[i].模型 == 模型 and self.场景.假人[i].名称 == 名称 then
                self.场景.假人[i].特效 = self:载入特效(特效)
                self.场景.假人[i].帧率 = 帧率
                local mc = 引擎.取音效(特效)
                if mc ~= nil then
                    音效类_(mc.文件, mc.资源)
                end
                break
            end
        end
    end
end

function 场景类_场景:可坐骑(人物, 坐骑)
    if 坐骑 == '宝贝葫芦' then
        return true
    elseif 坐骑 == '神气小龟' then
        if 人物.模型 ~= '偃无师' and 人物.模型 ~= '鬼潇潇' and 人物.模型 ~= '桃夭夭' then
            return true
        end
    elseif (坐骑 == '汗血宝马' or 坐骑 == '汉血宝马' or 坐骑 == '欢喜羊羊') and 人物.种族 == '人' and 人物.模型 ~= '偃无师' then
        return true
    elseif (坐骑 == '魔力斗兽' or 坐骑 == '披甲战狼') and 人物.种族 == '魔' and 人物.模型 ~= '鬼潇潇' then
        return true
    elseif (坐骑 == '闲云野鹤' or 坐骑 == '云魅仙鹿') and 人物.种族 == '仙' and 人物.模型 ~= '桃夭夭' then
        return true
    end
    return false
end

function 场景类_场景:取y偏移(头像)
    if 头像 == '杀破狼' then
        return 35
    elseif 头像 == '巫蛮儿' then
        return 19
    elseif 头像 == '羽灵神' then
        return 25
    elseif 头像 == '吸血鬼' then
        return 25
    elseif 头像 == '鬼潇潇' then
        return 1
    elseif 头像 == '桃夭夭' then
        return 58
    elseif 头像 == '偃无师' then
        return 33
    elseif 头像 == '曼珠沙华' or 头像 == '狂豹人形' then
        return 303
    elseif 头像 == '鲛人' then
        return 27
    elseif 头像 == '犀牛将军_人' then
        return 32
    elseif 头像 == '野猪精' then
        return 25
    elseif 头像 == '修罗傀儡妖' or 头像 == '金身罗汉' then
        return 235
    elseif 头像 == '猫灵人形' then
        return 275
    elseif 头像 == '蔓藤妖花' or 头像 == '修罗傀儡鬼' then
        return 260
    elseif 头像 == '混沌兽' then
        return 350
    elseif 头像 == '蜃气妖' then
        return 215
    elseif 头像 == '泡泡' then
        return 20
    elseif 头像 == '福星' or 头像 == '长眉灵猴' or 头像 == '巨力神猿' then
        return 28
    elseif 头像 == '葫芦宝贝' then
        return 336
    elseif 头像 == '蝎子精' then
        return 236
    elseif 头像 == '猫灵兽形' or 头像 == '猫灵' then
        return 377
    elseif 头像 == '狂豹兽形' then
        return 363
    elseif 头像 == '物件_打铁炉' then
        return -63
    elseif 头像 == '银两' or 头像 == '食物' or 头像 == '口粮' or 头像 == '摄妖香' or 头像 == '药品' then
        return -20
    --===========================
    end
    return 0
end

function 引擎.取物品功效(物品, 品质, 食材)
    local pg = {}
    if 物品 == '四叶花' then
        pg.气血 = 40
    elseif 物品 == '七叶莲' then
        pg.气血 = 60
    elseif 物品 == '天青地白' then
        pg.气血 = 80
    elseif 物品 == '紫丹罗' or 物品 == '佛手' or 物品 == '旋复花' then
        pg.魔法 = 20
    elseif 物品 == '百色花' or 物品 == '香叶' or 物品 == '龙须草' then
        pg.魔法 = 30
    elseif 物品 == '灵脂' or 物品 == '白玉骨头' then
        pg.魔法 = 40
    elseif 物品 == '曼佗罗花' then
        pg.魔法 = 50
    elseif 物品 == '天不老' or 物品 == '紫石英' then
        pg.气血 = 100
    elseif 物品 == '鹿茸' or 物品 == '血色茶花' then
        pg.气血 = 150
    elseif 物品 == '六道轮回' or 物品 == '熊胆' then
        pg.气血 = 200
    elseif 物品 == '凤凰尾' or 物品 == '硫磺草' then
        pg.气血 = 250
    elseif 物品 == '龙之心屑' or 物品 == '火凤之睛' then
        pg.气血 = 300
    elseif 物品 == '丁香水' or 物品 == '月星子' then
        pg.魔法 = 100
    elseif 物品 == '仙狐涎' or 物品 == '地狱灵芝' or 物品 == '麝香' or 物品 == '血珊瑚' then
        pg.魔法 = 150
    elseif 物品 == '餐风饮露' or 物品 == '白露为霜' then
        pg.魔法 = 200
    elseif 物品 == '孔雀红' or 物品 == '天龙水' then
        pg.魔法 = 250
    elseif 物品 == '金创药' then
        pg.气血 = 500
    elseif 物品 == '金香玉' then
        pg.气血 = 1500
    elseif 物品 == '小还丹' then
        pg.气血 = 1200
    elseif 物品 == '千年保心丹' then
        pg.气血 = 1000
    elseif 物品 == '风水混元丹' then
        pg.魔法 = 400
    elseif 物品 == '定神香' then
        pg.魔法 = 550
    elseif 物品 == '蛇蝎美人' then
        pg.魔法 = 650
    elseif 物品 == '九转回魂丹' then
        pg.气血 = 600
        pg.复活 = 0
    elseif 物品 == '佛光舍利子' then
        pg.气血 = 300
        pg.复活 = 0
    elseif 物品 == '五龙丹' then
        pg.气血 = 300
        pg.功效 = '解除封类异常状态'
    elseif 物品 == '月饼' then
        pg.功效 = '增加10点潜力点'
    elseif 物品 == '元宵' then
        pg.功效 = '增加资质与成长'
        if 食材 ~= nil then
            if 食材 == '芝麻沁香' then
                pg.功效 = '攻击资质'
            elseif 食材 == '桂花酒酿' then
                pg.功效 = '防御资质'
            elseif 食材 == '细磨豆沙' then
                pg.功效 = '速度资质'
            elseif 食材 == '蜜糖腰果' then
                pg.功效 = '躲避资质'
            elseif 食材 == '山楂拔丝' then
                pg.功效 = '体力资质'
            elseif 食材 == '滑玉莲蓉' then
                pg.功效 = '法力资质'
            end
        end
    elseif 物品 == '包子' then
        pg.气血 = 100
    elseif 物品 == '秘制红罗羹' then
        pg.功效 = '增加10000点储备气血'
    elseif 物品 == '秘制绿罗羹' then
        pg.功效 = '增加10000点储备魔法'
    end
    return pg
end

-- 领取任务模块
function 场景类_场景:领取任务(任务, 编号)
    local 介绍
    local 描述
    if 任务 == '枯萎的金莲' then
        if 编号 == 1 then
            介绍 = '问问#R/王大嫂(建邺城 141,12)#L/在为什么而唉声叹气。'
            描述 = '无'
            self.任务Npc = {{'建邺城', '王大嫂'}}
        elseif 编号 == 5 then
            介绍 = '问问#R/吹牛王(建邺城 91,34)#L/有没有虎子的线索。'
            描述 = '无'
            self.任务Npc = {{'建邺城', '吹牛王'}}
        elseif 编号 == 7 then
            介绍 = '问问#R/马全有(建邺城 49,95)#L/关于虎子失踪的事情。'
            描述 = '无'
            self.任务Npc = {{'建邺城', '马全有'}}
        elseif 编号 == 9 then
            介绍 = '要到东海湾找虎子，先找#R/雷黑子(建邺城 70,133)#L/借狗一用吧。'
            描述 = '无'
            self.任务Npc = {{'建邺城', '雷黑子'}}
        elseif 编号 == 11 then
            介绍 = '旺财跑到#R/小花(建邺城 207,108)#L/了，过去找它吧。'
            描述 = '无'
            self.任务Npc = {{'建邺城', '小花'}}
        elseif 编号 == 13 then
            介绍 = '旺财往东海湾那边跑去了，到东海湾找#R/云游神医(东海湾 75,109)#L/问一问吧。'
            描述 = '无'
            self.任务Npc = {{'东海湾', '云游神医'}}
        elseif 编号 == 14 then
            介绍 = '僵尸虎子要冲上来了，保护好#R/云游神医(东海湾 75,109)#L/开战吧。'
            描述 = '无'
            self.任务Npc = {{'东海湾', '云游神医'}}
        elseif 编号 == 17 then
            介绍 = '虎子变成了僵尸，问问#R/云游神医(东海湾 75,109)#L/有办法救回来么。'
            描述 = '无'
            self.任务Npc = {{'东海湾', '云游神医'}}
        elseif 编号 == 19 then
            介绍 = '找#R/楚恋依(东海湾 57,37)#L/询问治疗虎子的办法。'
            描述 = '无'
            self.任务Npc = {{'东海湾', '楚恋依'}}
        elseif 编号 == 21 then
            介绍 = '去哪里寻找金莲花呢，还是先把狗还给#R/雷黑子(建邺城 70,133)#L/吧。'
            描述 = '无'
            self.任务Npc = {{'建邺城', '雷黑子'}}
        elseif 编号 == 24 then
            介绍 = '去念佛的#R/小花(建邺城 70,133)#L/处打听金莲花的下落。'
            描述 = '无'
            self.任务Npc = {{'建邺城', '小花'}}
        elseif 编号 == 26 then
            介绍 = '把枯萎的金莲交给#R/楚恋依(东海湾 57,37)#L/吧。'
            描述 = '无'
            self.任务Npc = {{'东海湾', '楚恋依'}}
        elseif 编号 == 28 then
            介绍 = '虎子的尸毒已经除去，再看看#R/楚恋依(东海湾 57,37)#L/还有什么话要说。'
            描述 = '无'
            self.任务Npc = {{'东海湾', '楚恋依'}}
        elseif 编号 == 30 then
            介绍 = '虎子已经平安无事了，回去跟#R/王大嫂(建邺城 57,37)#L/说一身吧。'
            描述 = '无'
            self.任务Npc = {{'建邺城', '王大嫂'}}
        end
    elseif 任务 == '商人的鬼魂' then
        if 编号 == 1 then
            介绍 = '找#R/老孙头(建邺城 223,12)#L/询问一下建邺城闹鬼的事情。'
            描述 = '无'
            self.任务Npc = {{'建邺城', '老孙头'}}
        elseif 编号 == 3 then
            介绍 = '既然#R/牛大胆(建邺城 231,35)#L/撞到鬼了，那一定会有线索'
            描述 = '无'
            self.任务Npc = {{'建邺城', '牛大胆'}}
        elseif 编号 == 3 then
            介绍 = '既然#R/牛大胆(建邺城 231,35)#L/撞到鬼了，那一定会有线索'
            描述 = '无'
            self.任务Npc = {{'建邺城', '牛大胆'}}
        elseif 编号 == 5 then
            介绍 = '去#R/王大嫂(建邺城 141,12)#L/那儿讨红烧鱼'
            描述 = '无'
            self.任务Npc = {{'建邺城', '王大嫂'}}
        elseif 编号 == 7 then
            介绍 = '前往#R/建邺城回春堂分店的药店老板(建邺城 219,136)#L/那儿，求一朵赤叶甘草。'
            描述 = '无'
            self.任务Npc = {{'建邺城', '药店老板', true, '建邺城进建邺回春堂'}}
        elseif 编号 == 9 then
            介绍 = '将#R/赤叶甘草#L/送给#R/王大嫂(建邺城 141,12)#L/'
            描述 = '无'
            self.任务Npc = {{'建邺城', '王大嫂'}}
        elseif 编号 == 11 then
            介绍 = '把#R/王大嫂(建邺城 141,12)#L/做的红烧鱼给牛大胆吧！'
            描述 = '无'
            self.任务Npc = {{'建邺城', '牛大胆'}}
        elseif 编号 == 13 then
            介绍 = '问问看#R/管家(建邺城 34,57)#L/李善人的病到底是什么回事。'
            描述 = '无'
            self.任务Npc = {{'建邺城', '管家'}}
        elseif 编号 == 15 then
            介绍 = '找到云游商人#R/马全有(建邺城 49,95)#L/问问看他那儿可有松风灵芝。'
            描述 = '无'
            self.任务Npc = {{'建邺城', '马全有'}}
        elseif 编号 == 17 then
            介绍 = '将松风灵芝送给#R/管家(建邺城 34,57)#L/'
            描述 = '无'
            self.任务Npc = {{'建邺城', '管家'}}
        elseif 编号 == 19 then
            介绍 = '和管家一起去看看#R/李善人(建邺城 4,59)#L/吧'
            描述 = '无'
            self.任务Npc = {{'建邺城', '李善人', true, '建邺城进建邺李府'}}
        elseif 编号 == 21 then
            介绍 = '击败#R/商人的鬼魂(沉船内室 24,24)#L/。（可经建邺城前往东海湾，再由东海湾前往东海沉船）'
            描述 = '无'
            self.任务Npc = {{'沉船', '商人的鬼魂', true, '沉船进沉船内室'}}
        elseif 编号 == 24 then
            介绍 = '原来#R/妖风(沉船 55,31)#L/才是罪魁祸首，看我怎么收拾他！'
            描述 = '无'
            self.任务Npc = {{'沉船', '妖风'}}
        elseif 编号 == 27 then
            介绍 = '打败了妖风，回去看看#R/商人的鬼魂(沉船内室 24,24)#L/吧'
            描述 = '无'
            self.任务Npc = {{'沉船', '商人的鬼魂', true, '沉船进沉船内室'}}
        elseif 编号 == 29 then
            介绍 = '回到建邺城去找#R/李善人(建邺城 4,59)#L/吧！'
            描述 = '无'
            self.任务Npc = {{'建邺城', '李善人', true, '建邺城进建邺李府'}}
        end
    elseif 任务 == '海毛虫剧情' then
        if 编号 == 1 then
            self:生成Npc(1, 1506, 83, 65, '蝴蝶仙子', '蝴蝶精灵', 1)
            介绍 = '去东海湾和#R/蝴蝶精灵(东海湾 83,65)#L/谈一谈'
            描述 = '无'
            self.任务Npc = {{'东海湾', '蝴蝶精灵'}}
        elseif 编号 == 3 then
            self:生成Npc(1, 1507, 23, 31, '海毛虫', '小海', 1)
            self:生成Npc(1, 1507, 4, 38, '海毛虫', '小毛', 0)
            self:生成Npc(1, 1507, 13, 62, '海毛虫', '小虫', 2)
            介绍 = '去东海海底告诉#R/小海(东海海底 23,31)#L/、#R/小毛(东海海底 4,38)#L/、#R/小虫(东海海底 13,62)#L/蜕变之法'
            描述 = '无'
            self.任务Npc = {{'东海海底', '小海', nil, nil}, {'东海海底', '小毛'}, {'东海海底', '小虫'}}
        elseif 编号 == 6 then
            self:生成Npc(1, 1507, 60, 64, '海毛虫', '海毛虫长老', 2, nil, 67, {1, 0})
            介绍 = '去东海海底问问#R/海毛虫长老(东海海底 60,64)#L/关于蜕变之法的意见'
            描述 = '无'
            self.任务Npc = {{'东海海底', '海毛虫长老'}}
        elseif 编号 == 8 then
            self:生成Npc(1, 1506, 83, 65, '蝴蝶仙子', '蝴蝶精灵', 1)
            介绍 = '回去把情况告诉#R/蝴蝶精灵(东海湾 83,65)#L/'
            描述 = '无'
            self.任务Npc = {{'东海湾', '蝴蝶精灵'}}
        elseif 编号 == 10 then
            介绍 = '回去把情况告诉#R/蝴蝶精灵(东海湾 83,65)#L/'
            描述 = '无'
            self.任务Npc = {{'东海湾', '转生后的蝴蝶精灵'}}
        end
    elseif 任务 == '树怪剧情' then
        if 编号 == 1 then
            self:生成Npc(1, 1193, 135, 51, '树怪', '树怪', 0)
            介绍 = '去江南野外和#R/蝴蝶精灵(江南野外 83,65)#L/谈一谈'
            描述 = '无'
            self.任务Npc = {{'江南野外', '树怪'}}
        elseif 编号 == 3 then
            self:生成Npc(1, 1193, 64, 96, '山贼', '伐木之人', 3)
            介绍 = '和树怪去江南野外找#R/伐木之人(江南野外 64,96)#L/'
            描述 = '无'
            self.任务Npc = {{'江南野外', '伐木之人'}}
        end
    end
    if 介绍 ~= nil then
        if self.窗口.任务栏:是否有该任务(任务) then
            self.窗口.任务栏:修改内容(任务, 介绍, 描述)
        else
            self.窗口.任务栏:添加(任务, 介绍, 描述)
        end
    end
end

return 场景类_场景
